{"1": [["dateVerse", "Friday, January 1", "Psalm 1", "Genesis 1:1–2:3", "Matthew 1:1–17"], ["watchD", "O give thanks to the Lord of lords, who alone does great wonders, for his steadfast love endures forever. Psalm 136:3–4"], ["docT", "Now to him who by the power at work within us is able to accomplish abundantly far more than all we can ask or imagine, to him be glory in the church and in Christ Jesus to all generations, forever and ever. Amen. Ephesians 3:20–21"], ["prayer", "Lord, through you all things are possible. As we sit at the precipice of a new year, may we look upon it with hope and expectation of what you will enable us to do in your name and through your love. Amen."]], "2": [["dateVerse", "Saturday, January 2", "Psalm 2", "Genesis 2:4–25", "Matthew 1:18–25"], ["watchD", "He guides me along the right paths for his name’s sake. Psalm 23:3 (NIV)"], ["docT", "Jesus Christ says, “My sheep hear my voice. I know them, and they follow me.” John 10:27"], ["prayer", "Guiding Spirit, may we recognize your voice as you call us by name into your wonderful kingdom: the kingdom you claim here on earth and the one where we will join you in heaven. Amen."]], "3": [["info", "Second Sunday after Christmas"], ["watchO", "Watchword for the Week — God has made known to us the mystery of his will, according to his good pleasure that he set forth in Christ. Ephesians 1:9"], ["dateVerse", "Sunday, January 3", "Jeremiah 31:7–14", "Psalm 147:12–20", "Ephesians 1:3–14", "John 1:(1–9),10–18"], ["watchD", "O come, let us worship and bow down, let us kneel before the Lord, our Maker! Psalm 95:6"], ["docT", "He called you out of darkness into his marvelous light. 1 Peter 2:9"], ["prayer", "Lord of light and love, we praise you for not only giving us life in your creation, but for also bringing the light of your love into the darkness of our lives. Amen."]], "4": [["dateVerse", "Monday, January 4", "Psalm 3", "Genesis 3,4", "Matthew 2:1–12"], ["watchD", "Search me, O God, and know my heart; test me and know my thoughts. See if there is any wicked way in me, and lead me in the way everlasting. Psalm 139:23–24"], ["docT", "Christ may dwell in your hearts through faith. Ephesians 3:17"], ["prayer", "Forgiving Lord, test our hearts and guide us in your ways. May the sins in our hearts be expelled by your love and may your righteousness inspire our faith. Amen. "]], "5": [["dateVerse", "Tuesday, January 5", "Psalm 4", "Genesis 5", "Matthew 2:13–23"], ["watchD", "Satisfy us early with your mercy, that we may rejoice and be glad all our days! Psalm 90:14 (NKJV)"], ["docT", "All the people would get up early in the morning to listen to him in the temple. Luke 21:38"], ["prayer", "Lord of mercy, all that you say and do is inscribed upon the hearts of the faithful. May we know the joy of your mercy and your call for our lives. Amen."]], "6": [["info", "Epiphany of the Lord"], ["watchO", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["dateVerse", "Wednesday, January 6", "Psalm 5", "Genesis 6:1–7:10", "Matthew 3"], ["specialVerse", "Epiphany of the Lord", "Isaiah 60:1–6", "Psalm 72:1–7,10–14", "Ephesians 3:1–12", "Matthew 2:1–12"], ["watchD", "The heavens are yours, the earth also is yours; the world and all that is in it—you have founded them. The north and the south—you created them. Psalm 89:11–12"], ["docT", "In Christ all things in heaven and on earth were created, things visible and invisible, whether thrones or dominions or rulers or powers—all things have been created through him and for him. Colossians 1:16"], ["prayer", "Creative Lord, we are blessed to be a part of your creation. May we be guided and inspired by your creative acts. May all that we do be done for your glory. Amen."]], "7": [["dateVerse", "Thursday, January 7", "Psalm 6", "Genesis 7:11–8:22", "Matthew 4:1–11"], ["watchD", "All the nations you have made shall come and bow down before you, O Lord, and shall glorify your name. Psalm 86:9"], ["docT", "The grace of God has appeared, bringing salvation to all. Titus 2:11"], ["prayer", "In this seemingly broken world, O Lord, your divine love shines through. Guide the nations into peace and understanding and help us to trust in your salvation and not in our own works. Amen."]], "8": [["dateVerse", "Friday, January 8", "Psalm 7:1–9", "Genesis 9", "Matthew 4:12–25"], ["watchD", "Break up your fallow ground, for it is time to seek the Lord until he comes to rain righteousness on you. Hosea 10:12 (NASB)"], ["docT", "Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God—what is good and acceptable and perfect. Romans 12:2"], ["prayer", "Loving Lord, you call us into repentance, a moment for us to be honest with you. Let the false luster of our lives be transformed by the beauty of your kingdom. May we be renewed by your Spirit in order to live the life to which you call us. Amen."]], "9": [["dateVerse", "Saturday, January 9", "Psalm 7:10–17", "Genesis 10:1–11:9", "Matthew 5:1–16"], ["watchD", "The Lord is a stronghold for the oppressed, a stronghold in times of trouble. Psalm 9:9"], ["docT", "Paul wrote: I am content with weaknesses, insults, hardships, persecutions, and calamities for the sake of Christ. 2 Corinthians 12:10"], ["prayer", "Sustaining Creator, in our weakness you give us strength; in hardship, an oasis; in persecution or calamities, protection. You are everything to us, dear Lord. Beyond our temporal concerns you bring love and hope. May we be such beacons in the lives of others. Amen."]], "10": [["info", "First Sunday after the Epiphany"], ["watchO", "Watchword for the Week — God says, “Do not fear, for I have redeemed you; I have called you by name, you are mine.” Isaiah 43:1"], ["dateVerse", "Sunday, January 10", "Isaiah 43:1–7", "Psalm 29", "Acts 8:14–17", "Luke 3:15–17,21–22"], ["watchD", "I will remove the heart of stone from their flesh and give them a heart of flesh, so that they may follow my statutes and keep my ordinances and obey them. Ezekiel 11:19–20"], ["docT", "If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["prayer", "You, O Lord, revel in a repentant heart. Teach us the value of humility before your throne and cleanse us from all unrighteousness. May we be dressed in the white robes of your salvation. Amen."]], "11": [["dateVerse", "Monday, January 11", "Psalm 8", "Genesis 11:10–12:9", "Matthew 5:17–26"], ["watchD", "Take delight in the Lord, and he will give you the desires of your heart. Psalm 37:4"], ["docT", "Whatever you ask for in prayer, believe that you have received it, and it will be yours. Mark 11:24"], ["prayer", "What should be the benefit of prayer, O God, but that we are able to speak to you, to know that you care so deeply to listen to our needs, sorrows, and joys? May we always be willing to take everything to you in prayer. Amen."]], "12": [["dateVerse", "Tuesday, January 12", "Psalm 9:1–10", "Genesis 12:10–13:18", "Matthew 5:27–42"], ["watchD", "One who rules over people justly, ruling in the fear of God, is like the light of morning, like the sun rising on a cloudless morning. 2 Samuel 23:3–4"], ["docT", "Keep watch over yourselves and over all the flock, of which the Holy Spirit has made you overseers. Acts 20:28"], ["prayer", "Gentle Shepherd, you grant us your authority of love. In every way that we find ourselves in authority over others, let us take your example and lead in gentleness and love. Amen."]], "13": [["dateVerse", "Wednesday, January 13", "Psalm 9:11–20", "Genesis 14,15", "Matthew 5:43–6:4"], ["watchD", "The Lord says, “I will be with them in trouble, I will rescue them and honor them.” Psalm 91:15"], ["docT", "Through death Jesus might free those who all their lives were held in slavery by the fear of death. Hebrews 2:15"], ["prayer", "O, to be free, dear Lord! We are no longer slaves to our sins and death but to the joy you offer us in serving you. Call us into the service of your love. Amen."]], "14": [["dateVerse", "Thursday, January 14", "Psalm 10:1–11", "Genesis 16,17", "Matthew 6:5–18"], ["watchD", "No inhabitant will say, “I am sick;” the people who live there will be forgiven their iniquity. Isaiah 33:24"], ["docT", "Jesus said to the paralytic, “Son, your sins are forgiven.” Mark 2:5"], ["prayer", "Too often, loving Lord, we fall victim to the sickness of sin. We allow ourselves to become complacent. Heal us with your forgiving love. Inspire us to lead a life of joy in your service. Amen."]], "15": [["dateVerse", "Friday, January 15", "Psalm 10:12–18", "Genesis 18", "Matthew 6:19–34"], ["watchD", "You know me, O Lord; you see me; and you examine my heart’s attitude toward you. Jeremiah 12:3 (NASB)"], ["docT", "Do not pronounce judgment before the time, before the Lord comes, who will bring to light the things now hidden in darkness and will disclose the purposes of the heart. Then each one will receive commendation from God. 1 Corinthians 4:5"], ["prayer", "O Lord, we open our hearts to you. May they be found not wanting, but ideal for your kingdom here on earth and your home in heaven. While we walk in your creation, may all that we do be pleasant in your sight. Amen."]], "16": [["dateVerse", "Saturday, January 16", "Psalm 11", "Genesis 19:1–29", "Matthew 7:1–12"], ["watchD", "You shall have no other gods before me. Exodus 20:3"], ["docT", "No one can serve two masters. Matthew 6:24"], ["prayer", "Heavenly Lord, use us! We are your own! Amen."]], "17": [["info", "Second Sunday after the Epiphany"], ["watchO", "Watchword for the Week — Now there are varieties of gifts, but \u2028the same Spirit; and there are varieties of services, but the same Lord. 1 Corinthians 12:4–5"], ["dateVerse", "Sunday, January 17", "Isaiah 62:1–5", "Psalm 36:5–10", "1 Corinthians 12:1–11", "John 2:1–11"], ["watchD", "My people shall be satisfied with my bounty, says the Lord. Jeremiah 31:14"], ["docT", "God is able to provide you with every blessing in abundance, so that by always having enough of everything, you may share abundantly in every good work. 2 Corinthians 9:8"], ["prayer", "Fill us, O Lord. Fill us with your grace to fullest measure that we may have it in abundance, that it may grow through our spirits, and that it may be an offering unto you and a gift to all whom we serve in your love. Amen."]], "18": [["dateVerse", "Monday, January 18", "Psalm 12", "Genesis 19:30–20:18", "Matthew 7:13–23"], ["watchD", "The Lord makes a way in the sea, a path in the mighty waters. Isaiah 43:16"], ["docT", "Jesus said, “Do not fear, only believe.” Mark 5:36"], ["prayer", "Lead on, lead on, O glorious Lord. Lead us on the path of righteousness! Turn not back to see if we follow; we follow you! Amen."]], "19": [["dateVerse", "Tuesday, January 19", "Psalm 13", "Genesis 21", "Matthew 7:24–8:4"], ["watchD", "Do not put the Lord your God to the test. Deuteronomy 6:16"], ["docT", "Jesus Christ says, “If you love me, you will keep my commandments.” John 14:15"], ["prayer", "Heavenly Lord, too often our actions could press you toward anger, yet you act out of love and concern for us. Guide us ever in lives of your love. Amen."]], "20": [["dateVerse", "Wednesday, January 20", "Psalm 14", "Genesis 22", "Matthew 8:5–22"], ["watchD", "We also will serve the Lord, for he is our God. Joshua 24:18"], ["docT", "Think of us in this way, as servants of Christ and stewards of God’s mysteries. 1 Corinthians 4:1"], ["prayer", "In us, O Lord, you have entrusted a sacred obligation. To us you have shown the great mysteries of your love; in humility you find greatness, in weakness you find strength, in self-giving you find abundance, and in death you find life. May we always be guided by the mystery of your love. Amen."]], "21": [["dateVerse", "Thursday, January 21", "Psalm 15", "Genesis 23:1–24:25", "Matthew 8:23–34"], ["watchD", "Then we your people, the flock of your pasture, will give thanks to you forever; from generation to generation we will recount your praise. Psalm 79:13"], ["docT", "With joy give thanks to the Father, who has made you fit to have your share of what God has reserved for his people in the kingdom of light. Colossians 1:12 (GNT)"], ["prayer", "Great Shepherd, we are your flock, honored to hear our names called by you. You, Lord, give us green pastures to lie down in and still waters to walk beside. In you we find all that we need for true purpose for our lives. Call on us; we are yours. Amen."]], "22": [["dateVerse", "Friday, January 22", "Psalm 16:1–6", "Genesis 24:26–66", "Matthew 9:1–13"], ["watchD", "O give thanks to the Lord, call on his name, make known his deeds among the peoples. Psalm 105:1"], ["docT", "Paul wrote: We may proclaim the good news in lands beyond you. 2 Corinthians 10:16"], ["prayer", "We find comfort in your message and purpose in its proclamation, heavenly Savior, but too often we feel like we are in a world that doesn’t want to listen. Remind us that it is your message that we are called to share, not our own. Help us to take ourselves out of the message and share only your true light. Amen."]], "23": [["dateVerse", "Saturday, January 23", "Psalm 16:7–11", "Genesis 25", "Matthew 9:14–26"], ["watchD", "Anxiety weighs down the human heart, but a good word cheers it up. Proverbs 12:25"], ["docT", "Let your gentleness be known to everyone. \u2028The Lord is near. Philippians 4:5"], ["prayer", "Lord of love and kindness, help us to show your true power. May we seek not our own joy but to bring happiness to others; not our own security but to help others find hope; not our own peace but a harmony that brings others together. Grant us your love. Amen."]], "24": [["info", "Third Sunday after the Epiphany"], ["watchO", "Watchword for the Week — Let the words of my mouth and the meditation of my heart be acceptable to you, O Lord, my rock and my redeemer. Psalm 19:14"], ["dateVerse", "Sunday, January 24", "Nehemiah 8:1–3,5–6,8–10", "Psalm 19", "1 Corinthians 12:12–31a", "Luke 4:14–21"], ["watchD", "When I felt secure, I said, “I will never be shaken,” but when you hid your face, I was dismayed. Psalm 30:6–7 (NIV)"], ["docT", "God opposes the proud, but gives grace to the humble. Humble yourselves therefore under the mighty hand of God, so that he may exalt you in due time. Cast all your anxiety on him, because he cares for you. 1 Peter 5:5–7"], ["prayer", "Lord of all blessings, we often become content with our lives, thinking we will never be shaken; but when hardship arises we fear losing you. You are never far from us and we need only to reach out with humble spirits, acknowledging your grace and love even in the most difficult times. Amen."]], "25": [["dateVerse", "Monday, January 25", "Psalm 17:1–7", "Genesis 26", "Matthew 9:27–38"], ["watchD", "He will bless those who fear the Lord, both small and great. Psalm 115:13"], ["docT", "Come; for everything is ready now. Luke 14:17"], ["prayer", "Gracious Lord, through your blessings we become ready for all things. We are strengthened with your grace and guided by your Spirit. We hope for every opportunity to show that we are ready to answer your call. Amen."]], "26": [["dateVerse", "Tuesday, January 26", "Psalm 17:8–15", "Genesis 27:1–29", "Matthew 10:1–16"], ["watchD", "The whole earth is filled with awe at your wonders; where morning dawns, where evening fades, you call forth songs of joy. Psalm 65:8 (NIV)"], ["docT", "The jailer and his entire household rejoiced that he had become a believer in God. Acts 16:34"], ["prayer", "From the first morning of our lives to the last evening that falls upon us, we live in your joy, Creator God. It is a blessing to be one with you, and with all those who serve you. As we continue our journeys here in your creation, may we hold each moment dearly. Amen."]], "27": [["dateVerse", "Wednesday, January 27", "Psalm 18:1–6", "Genesis 27:30–28:9", "Matthew 10:17–25"], ["watchD", "Lord, you gave your good spirit to instruct our ancestors. Nehemiah 9:20"], ["docT", "We have received not the spirit of the world, but the Spirit that is from God, so that we may understand the gifts bestowed on us by God. 1 Corinthians 2:12"], ["prayer", "Loving Spirit, we rejoice because you have called us into relationship with God. You have opened to us God’s word which proclaims the wonders of God’s work. You make us aware of all God’s miracles surrounding us each day. Amen."]], "28": [["dateVerse", "Thursday, January 28", "Psalm 18:7–15", "Genesis 28:10–29:14", "Matthew 10:26–42"], ["watchD", "The Lord said to Moses, “You shall speak all that I command you.” Exodus 7:1,2"], ["docT", "And now, Lord, grant to your servants to speak your word with all boldness. Acts 4:29"], ["prayer", "In a world that needs your message of love so dearly, Lord, give us words to share and strength to share them. Make our lives your message to all with whom you bring us into contact. May they hear your words in all that we do. Amen."]], "29": [["dateVerse", "Friday, January 29", "Psalm 18:16–24", "Genesis 29:15–30:24", "Matthew 11:1–10"], ["watchD", "Justice, and only justice, you shall pursue, so that you may live. Deuteronomy 16:20"], ["docT", "Pursue righteousness, godliness, faith, love, endurance, gentleness. 1 Timothy 6:11"], ["prayer", "Lord of righteousness, make all your treasures our pursuit. You brought into the turmoil of this world all good and great joy. Help us to focus our lives on all that you have given us. Guide us to live lives that show the joy of your creation. Amen."]], "30": [["dateVerse", "Saturday, January 30", "Psalm 18:25–29", "Genesis 30:25–31:21", "Matthew 11:11–24"], ["watchD", "Let us go with you, for we have heard that God is with you. Zechariah 8:23"], ["docT", "Now among those who went up to worship at the festival were some Greeks. They came to Philip, who was from Bethsaida in Galilee, and said to him, “Sir, we wish to see Jesus.” John 12:20–21"], ["prayer", "O, they wish to see Jesus; how we have longed for the same thing, Lord! We forget that you are all around us: in a child’s smile, in a loved one’s embrace, in outstretched hands, in every kind word. “Sir, they wish to see Jesus;” may they see you in us. Amen."]], "31": [["info", "Fourth Sunday after the Epiphany"], ["watchO", "Watchword for the Week — For now we see in a mirror, dimly, but then we will see face to face. 1 Corinthians 13:12"], ["dateVerse", "Sunday, January 31", "Jeremiah 1:4–10", "Psalm 71:1–6", "1 Corinthians 13:1–13", "Luke 4:21–30"], ["watchD", "From the least to the greatest of them, everyone is greedy for unjust gain; and from prophet to priest, everyone deals falsely. They have treated the wound of my people carelessly, saying, “Peace, peace,” when there is no peace. Jeremiah 6:13–14"], ["docT", "Paul wrote: I am not seeking my own good but the good of many, so that they may be saved. 1 Corinthians 10:33 (NIV)"], ["prayer", "Generous Lord, infuse our spirits with your love and compassion that we might see the broken spirits of others and respond as you have shown us. Where there is need, help us to meet it with your kindness. May all that is good be seen in us, your children. Amen."]], "32": [["dateVerse", "Monday, February 1", "Psalm 18:30–36", "Genesis 31:22–55", "Matthew 11:25–12:8"], ["watchD", "Lord God, do not destroy the people who are your very own possession, whom you redeemed in your greatness. Deuteronomy 9:26"], ["docT", "Paul wrote: I am confident of this, that the one who began a good work among you will bring it to completion by the day of Jesus Christ. Philippians 1:6"], ["prayer", "Gracious God, your greatness redeems us. Guide us as we work to bring others to you, so they too can know you. In your name we pray. Amen. "]], "33": [["dateVerse", "Tuesday, February 2", "Psalm 18:37–45", "Genesis 32:1–21", "Matthew 12:9–21"], ["watchD", "The earth feared and was still when God rose up to establish judgment, to save all the oppressed of the earth. Psalm 76:8–9"], ["docT", "The eyes of the Lord are on the righteous, and his ears are open to their prayer. But the face of the Lord is against those who do evil. 1 Peter 3:12"], ["prayer", "Heavenly Savior, yours is the true power over evil. Hear us as we bring our prayers for the oppressed of this world. Shine your light and power on those in desperate need of your love and care. Amen."]], "34": [["dateVerse", "Wednesday, February 3", "Psalm 18:46–50", "Genesis 32:22–33:20", "Matthew 12:22–32"], ["watchD", "The Lord of hosts has planned, and who will annul it? His hand is stretched out, and who will turn it back? Isaiah 14:27"], ["docT", "If God is for us, who is against us? Romans 8:31"], ["prayer", "Holy Protector, forgive us for those times when we believe we can handle this world on our own. Your mighty yet gentle hand guides us through both the good and trying times of our lives. Know that we are for you. Amen."]], "35": [["dateVerse", "Thursday, February 4", "Psalm 19:1–6", "Genesis 34", "Matthew 12:33–45"], ["watchD", "The Lord is just in all his ways, and kind in all his doings. Psalm 145:17"], ["docT", "Lord, who will not fear and glorify your name? For you alone are holy. All nations will come and worship before you, for your judgments have been revealed. Revelation 15:4"], ["prayer", "O Savior and Friend, we join the nations in singing your praise and living our lives in your glory. Help us to follow your way and heed your kind judgments. In your name we pray. Amen. "]], "36": [["dateVerse", "Friday, February 5", "Psalm 19:7–14", "Genesis 35:1–36:8", "Matthew 12:46–13:9"], ["watchD", "Take care what you do, for there is no perversion of justice with the Lord our God, or partiality, or taking of bribes. 2 Chronicles 19:7"], ["docT", "While Jesus was having dinner at Matthew’s house, many tax collectors and sinners came and ate with him and his disciples. Matthew 9:10 (NIV)"], ["prayer", "Father, we come to you as sinners. You know our deepest faults and wayward deeds. Yet, you invite us to your table, welcome us as disciples, and forgive us our trespasses. For these mercies, we thank you every day. Amen."]], "37": [["dateVerse", "Saturday, February 6", "Psalm 20", "Genesis 36:9–43", "Matthew 13:10–23"], ["watchD", "David said to his son Solomon, “The Lord God is with you. He will not fail you or forsake you, until all the work for the service of the house of the Lord is finished.” 1 Chronicles 28:20"], ["docT", "The Lord will give you understanding in all things. 2 Timothy 2:7"], ["prayer", "Gracious Lord, you give us greater knowledge of our world. Your light and grace lead us to a place of hope and love. May we have the courage to follow. Amen. "]], "38": [["info", "Last Sunday after the Epiphany\u2028Transfiguration of our Lord "], ["watchO", "Watchword for the Week — And when they looked up, they saw no one except Jesus himself alone. Matthew 17:8"], ["dateVerse", "Sunday, February 7", "Exodus 34:29–35", "Psalm 99", "2 Corinthians 3:12–4:2", "Luke 9:28–36,(37–43)"], ["watchD", "Trust in the Lord with all your heart, and do not rely on your own insight. In all your ways acknowledge him, and he will make straight your paths. Proverbs 3:5–6"], ["docT", "Christ says, “Abide in me as I abide in you. Just as the branch cannot bear fruit by itself unless it abides in the vine, neither can you unless you abide in me.” John 15:4"], ["prayer", "O Redeemer, today we remember how Jesus’ face shone like the sun and his clothes became dazzling white as you prepared to save the world through him. May your bright light continue to shine on us always. Amen."]], "39": [["dateVerse", "Monday, February 8", "Psalm 21", "Genesis 37", "Matthew 13:24–35"], ["watchD", "They went home, joyful and glad in heart for all the good things the Lord had done for his servant David and his people Israel. 1 Kings 8:66 (NIV)"], ["docT", "Yes, everything is for your sake, so that grace, as it extends to more and more people, may increase thanksgiving, to the glory of God. \u20282 Corinthians 4:15"], ["prayer", "Lord, the good you do for our sake fills our hearts with joy. Teach us to bring that joy to others, so they too may behold your love and grace. In your name we pray. Amen."]], "40": [["dateVerse", "Tuesday, February 9", "Psalm 22:1–8", "Genesis 38", "Matthew 13:36–46"], ["watchD", "The eyes of all look to you, and you give them their food in due season. You open your hand, satisfying the desire of every living thing. Psalm 145:15–16"], ["docT", "Look at the birds of the air; they neither sow nor reap nor gather into barns, and yet your heavenly Father feeds them. Are you not of more value than they? Matthew 6:26"], ["prayer", "Lord Jesus, in all we see and do, we recognize your life-giving touch. We thank you for feeding our hearts, our souls, and our minds. May we give ourselves entirely to you. Amen."]], "41": [["info", "Ash Wednesday"], ["dateVerse", "Wednesday, February 10", "Psalm 22:9–21", "Genesis 39", "Matthew 13:47–58"], ["specialVerse", "Ash Wednesday", "Joel 2:1–2,12–17", "Psalm 51:1–17", "2 Corinthians 5:20b–6:10", "Matthew 6:1–6,16–21"], ["watchD", "In the morning, Lord, you hear my voice; in the morning I lay my requests before you and wait expectantly. Psalm 5:3 (NIV)"], ["docT", "In the morning, while it was still very dark, Jesus got up and went out to a deserted place, and there he prayed. Mark 1:35"], ["prayer", "Holy Father, as we begin our Lenten journey, guide us to pray as you prayed. Help us to hear your voice during this season of preparation. Despite the dark days to come, we know that light and life await us come Easter. Amen. "]], "42": [["dateVerse", "Thursday, February 11", "Psalm 22:22–28", "Genesis 40:1–41:16", "Matthew 14:1–14"], ["watchD", "I will sing to the Lord, because he has dealt bountifully with me. Psalm 13:6"], ["docT", "Mary said, “My soul magnifies the Lord, and my spirit rejoices in God my Savior.” Luke 1:46–47"], ["prayer", "Gracious God, lifting our voices and singing your praise bring us closer to you. Hear us as we rejoice, thanking you for all the goodness and strength you bring to us and to the world. In your name we pray. Amen."]], "43": [["dateVerse", "Friday, February 12", "Psalm 22:29–31", "Genesis 41:17–57", "Matthew 14:15–24"], ["watchD", "In the place where it was said to them, “You are not my people,” it shall be said to them, “Children of the living God.” Hosea 1:10"], ["docT", "To all who received him, who believed in his name, he gave power to become children of God. John 1:12"], ["prayer", "Heavenly Father, we come to you as strangers, yet are welcomed as your children. Enfold your loving arms around us, protect us from evil and show us the right path to follow. With hope, we pray. Amen. "]], "44": [["dateVerse", "Saturday, February 13", "Psalm 23", "Genesis 42", "Matthew 14:25–15:9"], ["watchD", "Judgment will again be righteous, and all the upright in heart will follow it. Psalm 94:15 (NASB)"], ["docT", "Blessed are those who hunger and thirst for righteousness, for they will be filled. Matthew 5:6"], ["prayer", "Righteous One, help us to see right from wrong and good from evil in the world around us. Fill us with your Spirit, and lead us to lives of wisdom, justice, and understanding. In your name we pray. Amen. "]], "45": [["info", "First Sunday in Lent"], ["watchO", "Watchword for the Week — No one who believes in Christ will be put to shame. Romans 10:11"], ["dateVerse", "Sunday, February 14", "Deuteronomy 26:1–11", "Psalm 91:1–2,9–16", "Romans 10:8b–13", "Luke 4:1–13"], ["watchD", "The Lord is the stronghold of my life; of whom shall I be afraid? Psalm 27:1"], ["docT", "I can do all things through him who strengthens me. Philippians 4:13"], ["prayer", "Protector God, our strength for meeting life’s trials comes from you. You are our Shield, our Foundation, our Guardian, and our Friend. Help us to stay strong in faith, hope, and love so that we may serve others in your name. Amen."]], "46": [["dateVerse", "Monday, February 15", "Psalm 24", "Genesis 43", "Matthew 15:10–20"], ["watchD", "Shall we receive the good at the hand of God, and not receive the bad? Job 2:10"], ["docT", "God is faithful, and he will not let you be tested beyond your strength, but with the testing he will also provide the way out so that you may be able to endure it. 1 Corinthians 10:13"], ["prayer", "Heavenly Father, this world tests our resolve and our faith in you. Too many times we feel the fear and heartache of a life without you. Yet, your smiling face and gentle hand remind us of your love and give us the power to live lives of goodness and hope. Amen."]], "47": [["dateVerse", "Tuesday, February 16", "Psalm 25:1–7", "Genesis 44", "Matthew 15:21–28"], ["watchD", "I will make with you an everlasting covenant. Isaiah 55:3"], ["docT", "The Lord Jesus took the cup also, after supper, saying, “This cup is the new covenant in my blood.” 1 Corinthians 11:25"], ["prayer", "Lamb of God, with your shed blood you saved us all. When we drink from the cup, we remember your sacrifice and affirm the covenant that binds us to you. May we be one with you forever. Amen."]], "48": [["dateVerse", "Wednesday, February 17", "Psalm 25:8–22", "Genesis 45", "Matthew 15:29–16:4"], ["watchD", "May the Lord, who is good, pardon everyone who sets their heart on seeking God. 2 Chronicles 30:18–19 (NIV)"], ["docT", "A man was there by the name of Zacchaeus; he was a chief tax collector and was wealthy. He wanted to see who Jesus was. Luke 19:2–3 (NIV)"], ["prayer", "Gracious King, every day we seek your love and grace. We are pilgrims—sometimes lost, sometimes on the right path, sometimes tired of traveling—yet we always hope to see your face throughout our journey and at its end. Amen."]], "49": [["dateVerse", "Thursday, February 18", "Psalm 26", "Genesis 46:1–27", "Matthew 16:5–20"], ["watchD", "Declare his glory among the nations, his marvelous works among all the peoples. Psalm 96:3"], ["docT", "Paul and Barnabas related all that God had done with them, and how he had opened a door of faith for the Gentiles. Acts 14:27"], ["prayer", "Lord, your goodness and light fills all the world. As believers, we see that light and feel that goodness, yet many do not. Help us to open the door of faith to welcome those who desire your love. In your name we pray. Amen."]], "50": [["dateVerse", "Friday, February 19", "Psalm 27:1–6", "Genesis 46:28–47:31", "Matthew 16:21–28"], ["watchD", "A father of the fatherless and a judge for the widows is God in his holy habitation. God makes a home for the lonely; he leads out the prisoners into prosperity. Psalm 68:5–6 (NASB)"], ["docT", "Jesus Christ says, “Truly I tell you, just as you did it to one of the least of these who are members of my family, you did it to me.” Matthew 25:40"], ["prayer", "Father most holy, you teach us to feed the hungry, comfort the sick, clothe the naked, and welcome the stranger. Help us to see these as everyday occurrences, not occasional efforts, so that through you we can improve our world. In your name we pray. Amen."]], "51": [["dateVerse", "Saturday, February 20", "Psalm 27:7–14", "Genesis 48", "Matthew 17:1–13"], ["watchD", "Do not be frightened or dismayed, for the Lord your God is with you wherever you go. Joshua 1:9"], ["docT", "God did not give us a spirit of cowardice, but rather a spirit of power and of love and of self-discipline. 2 Timothy 1:7"], ["prayer", "Gracious God, the world presents us with many fears and worries. But in you we have one who makes us brave in the face of these fears. May your spirit of love and power strengthen and protect us all the days of our lives. Amen."]], "52": [["info", "Second Sunday in Lent"], ["watchO", "Watchword for the Week — The Lord is my light and my salvation; whom shall I fear? Psalm 27:1"], ["dateVerse", "Sunday, February 21", "Genesis 15:1–12,17–18", "Psalm 27", "Philippians 3:17–4:1", "Luke 13:31–35"], ["watchD", "There is a river whose streams make glad the city of God, the holy dwelling places of the Most High. God is in the midst of her, she will not be moved. Psalm 46:4–5 (NASB)"], ["docT", "In Jesus Christ you also are being built together for a dwelling place of God in the Spirit. Ephesians 2:22 (NKJV)"], ["prayer", "Benevolent Creator, you have built a home for us in you. Through the Spirit of your Son, help us to welcome into your house those seeking your love and forgiveness this and every Sunday. We worship you and give you thanks. Amen."]], "53": [["dateVerse", "Monday, February 22", "Psalm 28", "Genesis 49", "Matthew 17:14–27"], ["watchD", "For we are aliens and transients before you, as were all our ancestors; our days on the earth are like a shadow, and there is no hope. 1 Chronicles 29:15"], ["docT", "Here we have no lasting city, but we are looking for the city that is to come. Hebrews 13:14"], ["prayer", "Lord of light, many in your world wander without direction or hope. They do not hear your word or feel your touch. Guide them through your strength and wisdom to find the road to you. Direct them home and welcome them always. Amen."]], "54": [["dateVerse", "Tuesday, February 23", "Psalm 29", "Genesis 50", "Matthew 18:1–14"], ["watchD", "For as the earth brings forth its shoots, so the Lord God will cause righteousness and praise to spring up before all the nations. Isaiah 61:11"], ["docT", "He who supplies seed to the sower and bread for food will supply and multiply your seed for sowing and increase the harvest of your righteousness. 2 Corinthians 9:10"], ["prayer", "While winter still holds fast to our world, it is spring in our hearts. Your Son shines warm, life-giving light upon your children, helping us to grow in faith and love for you. Feed that faith and nurture it, so that we may follow you. Amen. "]], "55": [["dateVerse", "Wednesday, February 24", "Psalm 30:1–5", "Exodus 1:1–2:10", "Matthew 18:15–35"], ["watchD", "Do not cast me away from your presence, and do not take your holy spirit from me. Psalm 51:11"], ["docT", "God has destined us not for wrath but for obtaining salvation through our Lord Jesus Christ. 1 Thessalonians 5:9"], ["prayer", "Gracious Lord, keep us close, even as we doubt and sin. While we may not be worthy, we hope and trust that your spirit will always be with us. Through your love, help us to stand in your presence and serve you, we pray. Amen."]], "56": [["dateVerse", "Thursday, February 25", "Psalm 30:6–12", "Exodus 2:11–3:22", "Matthew 19:1–12"], ["watchD", "Even before a word is on my tongue, O Lord, you know it completely. Psalm 139:4"], ["docT", "When you are praying, do not heap up empty phrases as the Gentiles do; for they think that they will be heard because of their many words. Your Father knows what you need before you ask him. Matthew 6:7–8"], ["prayer", "Heavenly Father, you know our hearts and minds even better than we do. You understand our needs and you are there for us. Help us to express our love and thankfulness directly from the heart, unfiltered and true. In your name we pray. Amen."]], "57": [["dateVerse", "Friday, February 26", "Psalm 31:1–5", "Exodus 4:1–5:9", "Matthew 19:13–22"], ["watchD", "Woe to those who are wise in their own eyes and clever in their own sight. Isaiah 5:21 (NIV)"], ["docT", "If I understand all mysteries and all knowledge, and if I have all faith, so as to remove mountains, but do not have love, I am nothing. 1 Corinthians 13:2"], ["prayer", "Omnipotent God, though we may think ourselves wise, there are many mysteries to which only you know the answers. Help us to have faith in your knowledge and grant us understanding in ways that enlighten and enhance our lives and strengthen our love for all. Amen."]], "58": [["dateVerse", "Saturday, February 27", "Psalm 31:6–9", "Exodus 5:10–6:12", "Matthew 19:23–30"], ["watchD", "You have blessed it, O Lord, and it shall be blessed forever. 1 Chronicles 17:27 (NKJV)"], ["docT", "Do not repay evil for evil or abuse for abuse; but, on the contrary, repay with a blessing. It is for this that you were called—that you might inherit a blessing. 1 Peter 3:9"], ["prayer", "Righteous Redeemer, as you have blessed us with your love and power, teach us how to be blessings to those around us. Through those blessings, help us to make your world a more peaceful, grateful, loving, and glorious place. Amen."]], "59": [["info", "Third Sunday in Lent"], ["watchO", "Watchword for the Week — Seek the Lord while he may be found, call upon him while he is near. Isaiah 55:6"], ["dateVerse", "Sunday, February 28", "Isaiah 55:1–9", "Psalm 63:1–8", "1 Corinthians 10:1–13", "Luke 13:1–9"], ["watchD", "I, the Lord your God, hold your right hand; it is I who say to you, “Do not fear, I will help you.” Isaiah 41:13"], ["docT", "Simon’s mother-in-law was in bed with a fever, and they told Jesus about her at once. He came and took her by the hand and lifted her up. Then the fever left her. Mark 1:30–31"], ["prayer", "Benevolent Healer, you know the illnesses within your children. Take our hands, make us whole, help us face our fears. Heal us so that we may live the lives that you set forth for us with happiness and health. Amen."]], "60": [["dateVerse", "Monday, February 29", "Psalm 31:10–20", "Exodus 6:13–7:24", "Matthew 20:1–16"], ["watchD", "Correct me, O Lord, but in just measure; not in your anger, or you will bring me to nothing. Jeremiah 10:24"], ["docT", "No discipline seems pleasant at the time, but painful. Later on, however, it produces a harvest of righteousness and peace for those who have been trained by it. Hebrews 12:11 (NIV)"], ["prayer", "Teacher, we know that we are far from perfect. We stumble, we waiver, we doubt and do wrong. Yet in your eyes, and with your forgiveness, perfection is not required. We thank you for your saving grace and righteousness. Amen. "]], "61": [["info", "March 1, 1457: \u2028Beginning of the Unity of the Brethren in Bohemia"], ["dateVerse", "Tuesday, March 1", "Psalm 31:21–24", "Exodus 8", "Matthew 20:17–28"], ["watchD", "Be strong, and let your heart take courage, all you who wait for the Lord. Psalm 31:24"], ["docT", "The one who endures to the end will be saved. Mark 13:13"], ["prayer", "Lord God, help us to make patience and waiting a part of our Lenten disciplines, knowing that all who wait on you renew their strength. In patience we experience that all things do good work for those who love you. Amen. "]], "62": [["dateVerse", "Wednesday, March 2", "Psalm 32", "Exodus 9", "Matthew 20:29–21:11"], ["watchD", "How beautiful on the mountains are the feet of those who bring good news, who proclaim peace, who bring good tidings, who proclaim salvation, who say to Zion, “Your God reigns!” Isaiah 52:7 (NIV)"], ["docT", "As shoes for your feet put on whatever will make you ready to proclaim the gospel of peace. Ephesians 6:15"], ["prayer", "O God, the good news of Jesus Christ is to be neither hoarded nor withheld. Give us, we ask, the courage to be your witnesses for love, justice, and peace by our words, our actions, and our examples to others. Amen."]], "63": [["dateVerse", "Thursday, March 3", "Psalm 33:1–5", "Exodus 10", "Matthew 21:12–22"], ["watchD", "It is I, speaking in righteousness, mighty to save. Isaiah 63:1 (ESV)"], ["docT", "Just as one man’s trespass led to condemnation for all, so one man’s act of righteousness leads to justification and life for all. Romans 5:18"], ["prayer", "Wondrous Creator, we seek the transformation that takes away our resentments, prejudices, and fears, so that we may live life more fully, always seeking ways in which we can be good neighbors and advocates for the voiceless. Through Christ our Lord we pray. Amen."]], "64": [["dateVerse", "Friday, March 4", "Psalm 33:6–11", "Exodus 11:1–12:20", "Matthew 21:23–32"], ["watchD", "Only you know what is in every human heart. 1 Kings 8:39"], ["docT", "Now may our Lord Jesus Christ himself and God our Father, who loved us and through grace gave us eternal comfort and good hope, comfort your hearts and strengthen them in every good work and word. 2 Thessalonians 2:16–17"], ["prayer", "We open our hearts to you, dearest Friend; purify them with the refiner’s fire, tenderize them with awareness of the needs of others, and stimulate them so that we may reach out in compassion to answer the calls of our neighbors’ distress. Amen."]], "65": [["dateVerse", "Saturday, March 5", "Psalm 33:12–22", "Exodus 12:21–51", "Matthew 21:33–46"], ["watchD", "I said, “I have toiled in vain, I have spent my strength for nothing and vanity; yet surely the justice due to me is with the Lord, and my reward with my God.” Isaiah 49:4 (NASB)"], ["docT", "Jesus said, “The kingdom of God is as if someone would scatter seed on the ground, and would sleep and rise night and day, and the seed would sprout and grow, he does not know how. The earth produces of itself, first the stalk, then the head, then the full grain in the head.” Mark 4:26–28"], ["prayer", "O Master Gardener, if the soil of our lives is to be receptive to the seed of your word, our lives must be fertilized with your love and grace to promote good and healthy spiritual growth. We want to produce good fruit for your kingdom. Amen."]], "66": [["info", "Fourth Sunday in Lent"], ["watchO", "Watchword for the Week — If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["dateVerse", "Sunday, March 6", "Joshua 5:9–12", "Psalm 32", "2 Corinthians 5:16–21", "Luke 15:1–3,11b–32"], ["watchD", "God has power to help or to overthrow. 2 Chronicles 25:8"], ["docT", "Christ Jesus is our hope. 1 Timothy 1:1"], ["prayer", "Savior of the world, enable our voices to be in harmony with all who share a common faith in you; let the volume of what unites us overpower any discord between us. Amen."]], "67": [["dateVerse", "Monday, March 7", "Psalm 34:1–7", "Exodus 13:1–14:18", "Matthew 22:1–14"], ["watchD", "Honor your father and your mother. Exodus 20:12 (NIV)"], ["docT", "Children and grandchildren must first learn to practice piety in regard to their own family and to make some return to their parents; for this is acceptable in the sight of God. 1 Timothy 5:4 (NASB)"], ["prayer", "Passing before our windows are faces of family, friends, and neighbors who have given our faith journey meaning and purpose. Thanks be to you, O God, for placing them in our paths. Amen."]], "68": [["dateVerse", "Tuesday, March 8", "Psalm 34:8–18", "Exodus 14:19–15:21", "Matthew 22:15–22"], ["watchD", "The Lord says, “I will be gracious to whom I will be gracious, and will show mercy on whom I will show mercy.” Exodus 33:19"], ["docT", "Paul wrote: I am grateful to Christ Jesus our Lord, who has strengthened me, because he judged me faithful and appointed me to his service, even though I was formerly a blasphemer, a persecutor, and a man of violence. But I received mercy. 1 Timothy 1:12–13"], ["prayer", "Make us more merciful people, Lord, especially when we are quick to judge and ready to condemn. Too often we jump hastily to conclusions. As you have been merciful to us, so may we be to those around us, through your help and strength, O God. Amen."]], "69": [["dateVerse", "Wednesday, March 9", "Psalm 34:19–22", "Exodus 15:22–16:36", "Matthew 22:23–40"], ["watchD", "For as the new heavens and the new earth, which I will make, shall remain before me, says the Lord, so shall your descendants and your name remain. Isaiah 66:22"], ["docT", "Jesus said, “The gates of Hades will not prevail against my church.” Matthew 16:18"], ["prayer", "Lord Jesus, though your church faces struggles, conflicts within, and attacks from without, remind us that it is still your Church. Help us to rise beyond institutional trappings to live as the body of Christ in all we think, do, or say. In your name we pray. Amen."]], "70": [["dateVerse", "Thursday, March 10", "Psalm 35:1–10", "Exodus 17:1–18:6", "Matthew 22:41–23:12"], ["watchD", "Joseph said to his master’s wife, “How then could I do this great wickedness, and sin against God?” Genesis 39:9"], ["docT", "Christ was faithful over God’s house as a son. Hebrews 3:6"], ["prayer", "Heavenly Father, we are to be counted among the wayward and lost, ones who wander and squander. We confess to you specific sins of omission and commission, seeking your forgiveness through Jesus Christ our Lord. Amen."]], "71": [["dateVerse", "Friday, March 11", "Psalm 35:11–18", "Exodus 18:7–19:9", "Matthew 23:13–22"], ["watchD", "I am the Lord, and there is no other. I form light and create darkness, I make weal and create woe; I the Lord do all these things. Isaiah 45:6–7"], ["docT", "God, who said, “Let light shine out of darkness,” made his light shine in our hearts to give us the light of the knowledge of God’s glory displayed in the face of Christ. 2 Corinthians 4:6 (NIV)"], ["prayer", "Jesus, Savior, pilot us over the rough waters of each day’s living. Help us to find and hold a steady course, looking for the guiding lights of community, sacrament, and word. Hear our prayer in the name of the Christ. Amen."]], "72": [["dateVerse", "Saturday, March 12", "Psalm 35:19–28", "Exodus 19:10–20:21", "Matthew 23:23–32"], ["watchD", "God, from the depths of the earth you will bring me up again. You will increase my honor, and comfort me once again. Psalm 71:20–21"], ["docT", "When Peter noticed the strong wind, he became frightened, and beginning to sink, he cried out, “Lord, save me!” Matthew 14:30"], ["prayer", "O Jesus, we respond to your invitation to step out onto the water, but it doesn’t take long before our confidence wavers and our fears set in. We extend our hands to you, knowing that you will grasp them and save us. We praise you for your constant faithfulness. Amen."]], "73": [["info", "Fifth Sunday in Lent"], ["watchO", "Watchword for the Week — Forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal for the prize of the heavenly call of God in Christ Jesus. Philippians 3:13–14"], ["dateVerse", "Sunday, March 13", "Isaiah 43:16–21", "Psalm 126", "Philippians 3:4b–14", "John 12:1–8"], ["watchD", "Lord, to you I have committed my cause. Jeremiah 11:20"], ["docT", "Christ left you an example, so that you should follow in his steps. When he was abused, he did not return abuse; when he suffered, he did not threaten; but he entrusted himself to the one who judges justly. 1 Peter 2:21,23"], ["prayer", "Ever-present God, when the urge to retaliate is strong, when bitterness easily rises up from inner places and we desire to hurt as we have been hurt, help us to face down temptation with strength and follow each footstep of Christ. Amen."]], "74": [["dateVerse", "Monday, March 14", "Psalm 36", "Exodus 20:22–21:27", "Matthew 23:33–39"], ["watchD", "It is better to take refuge in the Lord than to put confidence in mortals. Psalm 118:8"], ["docT", "Let us approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Hebrews 4:16"], ["prayer", "O listening God, as you have been our refuge and help in times past, we trust that in and with you we can still find safety, respite, and restoration. Our confidence is in you and to you we will turn to satisfy our needs. Thanks be to you, living God. Amen. "]], "75": [["dateVerse", "Tuesday, March 15", "Psalm 37:1–6", "Exodus 21:28–22:24", "Matthew 24:1–25"], ["watchD", "Like an eagle that stirs up its nest, that hovers over its young, the Lord spread his wings and caught his people, he carried them on his pinions. Deuteronomy 32:11 (NASB)"], ["docT", "The peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus. Philippians 4:7"], ["prayer", "O God, when we think we can fly like eagles we come crashing back to earth; when we trust in the ways of the world, the battle increases. We race to your side for comfort and care. Help us rise to new heights of faith, hope, and love. Amen."]], "76": [["dateVerse", "Wednesday, March 16", "Psalm 37:7–15", "Exodus 22:25–23:26", "Matthew 24:26–35"], ["watchD", "Do not plan harm against your neighbor who lives trustingly beside you. Proverbs 3:29"], ["docT", "As we have opportunity, let us do good to all people. Galatians 6:10 (NIV)"], ["prayer", "Keep us, Lord, from the snare of spiritual arrogance; teach us to listen to what others believe, seeking to understand and respect their thoughts, and to find our common ground in relationship with Christ. In his name we pray. Amen."]], "77": [["dateVerse", "Thursday, March 17", "Psalm 37:16–22", "Exodus 23:27–25:9", "Matthew 24:36–44"], ["watchD", "Do not be far from me, for trouble is near and there is no one to help. Psalm 22:11"], ["docT", "Christ says, “Do not let your hearts be troubled. Believe in God, believe also in me.” John 14:1"], ["prayer", "Saving God, when we are caught in raging waters, when vicious winds toss us about, when demeaning actions and statements come from even those we love, throw us the lifeline of your mercy, love, and grace. Amen."]], "78": [["dateVerse", "Friday, March 18", "Psalm 37:23–26", "Exodus 25:10–40", "Matthew 24:45–51"], ["watchD", "As the rain and the snow come down from heaven, and do not return there until they have watered the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater, so shall my word be that goes out from my mouth. Isaiah 55:10–11"], ["docT", "Christ said, “Those are the ones on whom seed was sown on the good soil; and they hear the word and accept it and bear fruit.” Mark 4:20 (NASB)"], ["prayer", "Lord God, as we plan for this year’s garden, help us cultivate within our own lives fertile and receptive soil, so that our witness to your love and grace will be bold, far-reaching, and impacting. In Christ’s name we pray. Amen."]], "79": [["dateVerse", "Saturday, March 19", "Psalm 37:27–33", "Exodus 26", "Matthew 25:1–13"], ["watchD", "Do not fear disgrace; you will not be humiliated. Isaiah 54:4 (NIV)"], ["docT", "If any of you suffers as a Christian, do not consider it a disgrace, but glorify God because you bear this name. 1 Peter 4:16"], ["prayer", "Understanding God, you have created us in your image, saying “It is good.” Even when there are threats to our dignity, when we are spiritually bullied, we commit to walking with you through the coming Holy Week, at Jesus’ side and in your Spirit. Amen."]], "80": [["info", "Palm Sunday"], ["watchO", "Watchword for the Week — Let those who fear the Lord say, “His steadfast love endures forever.” Psalm 118:4"], ["dateVerse", "Sunday, March 20", "Isaiah 50:4–9a", "Psalm 118:1–2,19–29", "Philippians 2:5–11", "Luke 19:28–40"], ["watchD", "Our transgressions indeed are with us, and we know our iniquities: transgressing, and denying the Lord. Isaiah 59:12–13"], ["docT", "When the goodness and loving kindness of God our Savior appeared, he saved us, not because of any works of righteousness that we had done, but according to his mercy. Titus 3:4–5"], ["prayer", "Lord Jesus Christ, in this Holy Week we are among those shouting “Hosanna!” Save us, we ask you; grant us strength to remain at your side now and beyond, committed, faithful, and obedient, grateful for our salvation. Amen."]], "81": [["dateVerse", "Monday, March 21", "Psalm 37:34–40", "Exodus 27:1–28:14", "Matthew 25:14–30"], ["watchD", "This is God, our God forever and ever. He will be our guide. Psalm 48:14"], ["docT", "Lift your drooping hands and strengthen your weak knees, and make straight paths for your feet. Hebrews 12:12–13"], ["prayer", "Approachable God, worthy of our trust in all things and places, strengthen us when we are tempted to choose the path of least resistance, seeking peace at any price, putting on blinders instead of binoculars. We want to please and honor you now and always. Amen."]], "82": [["dateVerse", "Tuesday, March 22", "Psalm 38:1–8", "Exodus 28:15–43", "Matthew 25:31–46"], ["watchD", "Yours is the kingdom, O Lord, and you are exalted as head above all. 1 Chronicles 29:11"], ["docT", "We do see Jesus now crowned with glory and honor because of the suffering of death. Hebrews 2:9"], ["prayer", "Precious God, when we consider the things we exalt in this life, the things we honor, the things that receive our homage and devotion, too often they are less than worthy and are not what would please you. We make this confession, seeking your forgiveness. Amen."]], "83": [["dateVerse", "Wednesday, March 23", "Psalm 38:9–16", "Exodus 29:1–30", "Matthew 26:1–13"], ["watchD", "O that today you would listen to his voice! Do not harden your hearts. Psalm 95:7–8"], ["docT", "Be doers of the word, and not merely hearers. James 1:22"], ["prayer", "God of the living word, you have commanded us to be still, to wait patiently, and to listen more attentively for your voice. Help us to slow down, put on the brakes, shift into neutral, and remain in place awaiting your call through Jesus. Amen. "]], "84": [["info", "Maundy Thursday"], ["watchO", "Watchword for Maundy Thursday — He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4 "], ["dateVerse", "Thursday, March 24", "Psalm 38:17–22", "Exodus 29:31–30:16", "Matthew 26:14–30"], ["watchD", "God has made me fruitful in the land of my misfortunes. Genesis 41:52"], ["docT", "Jesus said to his disciples, “I am deeply grieved, even to death; remain here, and keep awake.” Mark 14:34"], ["prayer", "Lord Jesus Christ, you command that we gather at your table in your name and Spirit. Just as we are, we come to receive the signs of your mercy and the evidence of your grace. Thanks be to you, Lord Jesus Christ. Amen."]], "85": [["info", "Good Friday"], ["watchO", "Watchword for Good Friday — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16 "], ["dateVerse", "Friday, March 25", "Psalm 39:1–6", "Exodus 30:17–31:11", "Matthew 26:31–35"], ["watchD", "I will sing of your steadfast love, O Lord, forever; with my mouth I will proclaim your faithfulness to all generations. Psalm 89:1"], ["docT", "God was reconciling the world to himself in Christ, not counting people’s sins against them. And he has committed to us the message of reconciliation. 2 Corinthians 5:19 (NIV)"], ["prayer", "O God, there was much about Good Friday that does not seem good: your Son’s betrayal, denial, and crucifixion. But we understand that your all-encompassing love is what brought Jesus to the cross: to die for us—but not only for us—for all. Amen."]], "86": [["info", "Great Sabbath"], ["dateVerse", "Saturday, March 26", "Psalm 39:7–13", "Exodus 31:12–32:29", "Matthew 26:36–46"], ["watchD", "O Lord, let your ear be attentive to hear the prayer of your servant that I now pray before you day and night. Nehemiah 1:6"], ["docT", "Jesus prays, “Holy Father, protect them in your name that you have given me, so that they may be one, as we are one.” John 17:11"], ["prayer", "Watching God, like your followers in times before, we sometimes cower behind closed and locked doors in fear and desperation. We long for signs, for assurance that sin and death are not the final answer. Break the grip of grief and fear with the coming announcement of the Life. Amen. "]], "87": [["info", "Easter"], ["watchO", "Watchword for the Week — Why do you look for the living among the dead? Jesus is not here, but has risen. Luke 24:5"], ["dateVerse", "Sunday, March 27", "Acts 10:34–43", "Psalm 118:1–2,14–24", "1 Corinthians 15:19–26", "Luke 24:1–12"], ["watchD", "O send out your light and your truth; let them lead me to your dwelling. Psalm 43:3"], ["docT", "Now Christ is risen from the dead, and has become the firstfruits of those who have fallen asleep. 1 Corinthians 15:20 (NKJV)"], ["prayer", "We give praise to you, powerful God, for breaking the bonds of death and driving away fear and hopelessness with the resurrection of your son, Jesus. Even as he lives, so may we become alive in the Spirit and on fire with your truth and love. In Christ we pray. Amen."]], "88": [["info", "Easter Monday"], ["dateVerse", "Monday, March 28", "Psalm 40:1–8", "Exodus 32:30–33:23", "Matthew 26:47–58"], ["watchD", "Give us life, and we will call on your name. Psalm 80:18"], ["docT", "Christ Jesus abolished death and brought life and immortality to light through the gospel. 2 Timothy 1:10"], ["prayer", "O God of majesty, we want to live as Easter people, filled with the hope and power of the resurrection. Let the praise and joy in our hearts be the evidence that Christ is resurrected in us. In his Spirit we pray. Amen."]], "89": [["dateVerse", "Tuesday, March 29", "Psalm 40:9–17", "Exodus 34", "Matthew 26:59–75"], ["watchD", "In the shadow of your wings I will take refuge, until the destroying storms pass by. Psalm 57:1"], ["docT", "When it was evening on that day, the first day of the week, and the doors of the house where the disciples had met were locked, Jesus came and stood among them and said, “Peace be with you.” John 20:19"], ["prayer", "O great Creator, there are times when the conflicts and struggles of life leave us shaken and uncertain. Enable us to actively listen for your words of peace and in hearing be lifted up and renewed in spirit. Amen. "]], "90": [["dateVerse", "Wednesday, March 30", "Psalm 41", "Exodus 35", "Matthew 27:1–10"], ["watchD", "Lord, you are righteous, but this day we are covered with shame. Daniel 9:7 (NIV)"], ["docT", "A man had two sons; he went to the first and said, “Son, go and work in the vineyard today.” He answered, “I will not;” but later he changed his mind and went. Matthew 21:28–29"], ["prayer", "We ask, ever-present God, for the courage to launch new ministries where needs become visible, the perseverance to follow through with ministries that we have started, and the inspiration to celebrate what we have accomplished in your precious name. Amen."]], "91": [["dateVerse", "Thursday, March 31", "Psalm 42", "Exodus 36", "Matthew 27:11–31"], ["watchD", "Lord, do not let my heart be drawn to what is evil. Psalm 141:4 (NIV)"], ["docT", "Anyone, then, who knows the right thing to do and fails to do it, commits sin. James 4:17"], ["prayer", "Holy Father, you gave us the word. We confess that we use fragments of Scripture to support our biases; we justify sinful actions because we can’t find it within ourselves to admit that we are wrong. Spirit of the living God, melt us, mold us, fill us, use us. In Jesus’ name we pray. Amen."]], "92": [["dateVerse", "Friday, April 1", "Psalm 43", "Exodus 37", "Matthew 27:32–44"], ["watchD", "I will exalt you, Lord, for you lifted me out of the depths. Psalm 30:1 (NIV)"], ["docT", "For just as the sufferings of Christ are abundant for us, so also our consolation is abundant through Christ. 2 Corinthians 1:5"], ["prayer", "All-caring and merciful God, we are grateful that you do not ignore our suffering. We reach out to you from the depths of our troubles and give thanks that—through Christ—healing, salvation, and deliverance are ours. Amen."]], "93": [["dateVerse", "Saturday, April 2", "Psalm 44:1–8", "Exodus 38", "Matthew 27:45–56"], ["watchD", "Be still, and know that I am God! Psalm 46:10"], ["docT", "Jesus said to them, “Come away to a deserted place all by yourselves and rest a while.” For many were coming and going, and they had no leisure even to eat. Mark 6:31"], ["prayer", "God of the stillness, remind us to stop to refresh and renew our lives. May we wait patiently in the silence and truly listen to your voice and leading, rededicating ourselves in service to you and your children. Amen. "]], "94": [["info", "Second Sunday of Easter"], ["watchO", "Watchword for the Week — Jesus says, “Peace be with you. As the Father has sent me, so I send you.” John 20:21"], ["dateVerse", "Sunday, April 3", "Acts 5:27–32", "Psalm 150", "Revelation 1:4–8", "John 20:19–31"], ["watchD", "The Lord is our judge, the Lord is our ruler, the Lord is our king; he will save us. Isaiah 33:22"], ["docT", "The Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3"], ["prayer", "Mighty God, thank you for the shelter of your love. Your grace surrounds us, keeping us safe, even though we know we don’t deserve it. Help us to share your love and mercy with all we meet this day. Amen."]], "95": [["dateVerse", "Monday, April 4", "Psalm 44:9–16", "Exodus 39:1–31", "Matthew 27:57–66"], ["watchD", "Just as I have watched over them to pluck up and break down, so I will watch over them to build and to plant, says the Lord. Jeremiah 31:28"], ["docT", "Paul wrote: I planted, Apollos watered, but God gave the growth. So neither the one who plants nor the one who waters is anything, but only God who gives the growth. 1 Corinthians 3:6–7"], ["prayer", "Lord Jesus, you gave all glory to God. Help us to seek fields in need of planting and nurture, so that good fruit may grow! Let us be aware of you—the Vine on which we are all branches. Amen."]], "96": [["dateVerse", "Tuesday, April 5", "Psalm 44:17–26", "Exodus 39:32–40:23", "Matthew 28:1–20"], ["watchD", "The Lord will save me, and we will sing to stringed instruments all the days of our lives at the house of the Lord. Isaiah 38:20"], ["docT", "Thanks be to God, who gives us the victory through our Lord Jesus Christ. 1 Corinthians 15:57"], ["prayer", "Thanks to you, Lord Christ! Today we sing your praises, lifting our voices in joy and gratitude for all the many blessings that you have given to us and to those we love! Thank you for the assurance of salvation. Amen."]], "97": [["dateVerse", "Wednesday, April 6", "Psalm 45:1–9", "Exodus 40:24–Leviticus 1:17", "Mark 1:1–8"], ["watchD", "The Lord has sent me to comfort all who mourn. Isaiah 61:1,2"], ["docT", "When Jesus rose early on the first day of the week, he appeared first to Mary Magdalene, out of whom he had driven seven demons. She went and told those who had been with him and who were mourning and weeping. Mark 16:9–10 (NIV)"], ["prayer", "God, the grief you must have endured in Jesus’ torment and death! Secure in the knowledge that Jesus defeated death once and for all, we turn to you in our times of sorrow to find comfort in your arms. Heal our pain. Amen."]], "98": [["dateVerse", "Thursday, April 7", "Psalm 45:10–17", "Leviticus 2,3", "Mark 1:9–20"], ["watchD", "In God we boast all day long, and praise your name forever. Psalm 44:8 (NKJV)"], ["docT", "With gratitude in your hearts sing psalms, hymns, and spiritual songs to God. Colossians 3:16"], ["prayer", "Jesus, we could give thanks and praise all day and night and never come close to expressing our gratitude for all that you have done for us. Today we pause to thank you for all our blessings, great and small. Amen."]], "99": [["dateVerse", "Friday, April 8", "Psalm 46", "Leviticus 4", "Mark 1:21–34"], ["watchD", "It is the Lord who goes before you. He will be with you; he will not fail you or forsake you. Do not fear or be dismayed. Deuteronomy 31:8"], ["docT", "I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation will be able to separate us from the love of God in Christ Jesus our Lord. Romans 8:38–39"], ["prayer", "God—Father, Mother, Creator—what magnificent promises you make to us! You will never leave us. Nothing in all creation can separate us from your love in Christ Jesus our Lord. Let that assurance resonate in our hearts today! Amen."]], "100": [["dateVerse", "Saturday, April 9", "Psalm 47", "Leviticus 5:1–6:13", "Mark 1:35–45"], ["watchD", "In the congregations I will bless the Lord. Psalm 26:12 (NKJV)"], ["docT", "Every day they continued to meet together in the temple courts. They broke bread in their homes and ate together with glad and sincere hearts, praising God. Acts 2:46–47 (NIV)"], ["prayer", "Come, Lord Jesus, and be our guest. As we eat alone, with family, or with friends, remind us not only of your presence, but also of how very blessed we are. Bless our food, our faith, and our fellowship together in you. Amen."]], "101": [["info", "Third Sunday of Easter"], ["watchO", "Watchword for the Week — Worthy is the Lamb that was slain to receive power and wealth and wisdom and might and honor and glory and blessing! Revelation 5:12"], ["dateVerse", "Sunday, April 10", "Acts 9:1–6,(7–20)", "Psalm 30", "Revelation 5:11–14", "John 21:1–19"], ["watchD", "Not one word has failed of all his good promise, which he spoke through his servant Moses. 1 Kings 8:56"], ["docT", "The one who calls you is faithful, and he will do this. 1 Thessalonians 5:24"], ["prayer", "Brother Jesus, we forget that you’ve known everything we feel. We forget that you walk, hurt, and rejoice by our sides, faithful no matter what. Help us to acknowledge your presence alongside us as we go through this day. Amen."]], "102": [["dateVerse", "Monday, April 11", "Psalm 48", "Leviticus 6:14–7:21", "Mark 2:1–12"], ["watchD", "Bring the full tithe, and thus put me to the test, says the Lord of hosts; see if I will not open the windows of heaven for you and pour down for you an overflowing blessing. Malachi 3:10"], ["docT", "The one who sows sparingly will also reap sparingly, and the one who sows bountifully will also reap bountifully. 2 Corinthians 9:6"], ["prayer", "Jesus, you teach that we are what we do. Let our words, actions, and hearts be generous. May we take all that you’ve given to us and be blessings to others—sowing joy, hope, and acceptance! Send us forth to love! Amen."]], "103": [["dateVerse", "Tuesday, April 12", "Psalm 49:1–12", "Leviticus 7:22–8:17", "Mark 2:13–28"], ["watchD", "For lo, the one who forms the mountains, creates the wind, and reveals his thoughts to mortals, the Lord, the God of hosts, is his name! Amos 4:13"], ["docT", "Jesus said, “You know how to interpret the appearance of the sky, but you cannot interpret the signs of the times.” Matthew 16:3"], ["prayer", "God of power and might, we rejoice in your presence in all creation! We see many things plainly, but often, the simplest things escape us. May we pay attention to the signs around us pointing to you. In Jesus’ name we pray. Amen."]], "104": [["dateVerse", "Wednesday, April 13", "Psalm 49:13–20", "Leviticus 8:18–9:11", "Mark 3:1–12"], ["watchD", "Our heart is glad in the Lord, because we trust in his holy name. Psalm 33:21"], ["docT", "Set all your hope on the grace that Jesus Christ will bring you when he is revealed. 1 Peter 1:13"], ["prayer", "Jesus, we set our sights and hopes on your gift of grace; a gift unearned. It is with great joy that we await the revealing of this great mystery of love—one day face-to-face with its Giver. Amen."]], "105": [["dateVerse", "Thursday, April 14", "Psalm 50:1–6", "Leviticus 9:12–10:20", "Mark 3:13–19"], ["watchD", "These people draw near with their mouths and honor me with their lips, while their hearts are far from me. Isaiah 29:13"], ["docT", "Jesus said, “Whoever does the will of God is my brother and sister and mother.” Mark 3:35"], ["prayer", "Lord of patience, our spirits are willing but our lives are so busy! We mean well, but forget. Remind us that in doing your will we become sisters and brothers in love. Slow us down to see what you require of us. Amen."]], "106": [["dateVerse", "Friday, April 15", "Psalm 50:7–15", "Leviticus 11:1–28", "Mark 3:20–35"], ["watchD", "The Lord your God is gracious and merciful, and will not turn away his face from you, if you return to him. 2 Chronicles 30:9"], ["docT", "Repent therefore, and turn to God so that your sins may be wiped out, so that times of refreshing may come from the presence of the Lord. Acts 3:19–20"], ["prayer", "God, today we say more than a simple, “I’m sorry.” We ask forgiveness for all of the ways that we fall short, resolving to truly repent and repair the brokenness in our lives and in the world. Guide us in Jesus’ name. Amen. "]], "107": [["dateVerse", "Saturday, April 16", "Psalm 50:16–23", "Leviticus 11:29–13:8", "Mark 4:1–20"], ["watchD", "But you, O Lord, do not be far from me; O my Strength, hasten to help me! Psalm 22:19 (NKJV)"], ["docT", "Bartimaeus, a blind beggar, began to shout out and say, “Jesus, Son of David, have mercy on me!” Many sternly ordered him to be quiet, but he cried out even more loudly, “Son of David, have mercy on me!” Mark 10:47–48"], ["prayer", "Lord Jesus Christ, have mercy on our blindness! Forgive our failure to see those who need our help and our ignorance to the sufferings of those around us. We cry out for strength and sight. Lord Jesus Christ, have mercy on us! Amen. "]], "108": [["info", "Fourth Sunday of Easter"], ["watchO", "Watchword for the Week — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Sunday, April 17", "Acts 9:36–43", "Psalm 23", "Revelation 7:9–17", "John 10:22–30"], ["watchD", "I will sing aloud of your steadfast love in the morning. For you have been a fortress for me and a refuge in the day of my distress. Psalm 59:16"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation. 2 Corinthians 1:3"], ["prayer", "Lord, thank you for the newness of each day and the mercies that come with each dawn. You are our refuge and shelter in all circumstances. You keep constant watch over us. Truly, we are blessed! Amen. "]], "109": [["dateVerse", "Monday, April 18", "Psalm 51:1–6", "Leviticus 13:9–46", "Mark 4:21–29"], ["watchD", "The God of heaven will set up a kingdom that shall never be destroyed. Daniel 2:44"], ["docT", "John wrote: Then I heard a loud voice in heaven, proclaiming, “Now have come the salvation and the power and the kingdom of our God and the authority of his Messiah.” Revelation 12:10"], ["prayer", "Savior of our lives, we rejoice that your kingdom is near. Let us work for peace and justice until it comes. Find us ready to enter into your immediate presence, having fulfilled your call to prepare the way! Amen."]], "110": [["dateVerse", "Tuesday, April 19", "Psalm 51:7–12", "Leviticus 13:47–14:18", "Mark 4:30–41"], ["watchD", "For the Lord is good; his steadfast love endures forever, and his faithfulness to all generations. Psalm 100:5"], ["docT", "God reconciled us to himself through Christ. 2 Corinthians 5:18"], ["prayer", "Lord God, you amaze us by not rejecting your sinful children! Thank you for choosing to love us and to work wonders through us. Your love never ends and never fails! In Jesus’ name, alleluia! Amen."]], "111": [["dateVerse", "Wednesday, April 20", "Psalm 51:13–19", "Leviticus 14:19–57", "Mark 5:1–20"], ["watchD", "Return to me, says the Lord of hosts, and I will return to you. Zechariah 1:3"], ["docT", "The Lord is not slow about his promise, as some think of slowness, but is patient with you, not wanting any to perish, but all to come to repentance. 2 Peter 3:9"], ["prayer", "Merciful Lord, your patience is amazing! You wait for us when we stray, search for us when we are lost, and open your arms when we come running back! Keep us close to your heart as we find our way home. Amen."]], "112": [["dateVerse", "Thursday, April 21", "Psalm 52", "Leviticus 15:1–24", "Mark 5:21–43"], ["watchD", "Listen to me, my people, and give heed to me, my nation; for a teaching will go out from me, and my justice for a light to the peoples. Isaiah 51:4"], ["docT", "God our Savior desires everyone to be saved and to come to the knowledge of the truth. 1 Timothy 2:3–4"], ["prayer", "Jesus, let the knowledge of your love and sacrifice burn so brightly within us that all who meet us today will know that we are yours. Let the light of justice shine in our lives as we work for peace. Amen."]], "113": [["dateVerse", "Friday, April 22", "Psalm 53", "Leviticus 15:25–16:25", "Mark 6:1–6"], ["watchD", "I—my hands—stretched out the heavens, and all their host I have commanded. Isaiah 45:12 (NKJV)"], ["docT", "Great and amazing are your deeds, Lord God the Almighty! Revelation 15:3"], ["prayer", "Mighty God! Sometimes we forget your majesty. How blessed we are that you choose us as your family to share in all creation! Increase our awareness of your presence and of our stewardship over all entrusted to us. Amen."]], "114": [["dateVerse", "Saturday, April 23", "Psalm 54", "Leviticus 16:26–18:5", "Mark 6:7–13"], ["watchD", "Hatred stirs up strife, but love covers all offenses. Proverbs 10:12"], ["docT", "Love is patient; love is kind; love is not envious or boastful or arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice in wrongdoing, but rejoices in the truth. 1 Corinthians 13:4–6"], ["prayer", "Lord Jesus, the love you inspire is the most powerful force in the world. Help us to do more than talk about it. Move us to love selflessly, sacrificially, and sincerely so that all will know your love. Amen."]], "115": [["info", "Fifth Sunday of Easter"], ["watchO", "Watchword for the Week — Jesus says, “I am the Alpha and the Omega, the beginning and the end. To the thirsty I will give water as a gift from the spring of the water of life.” Revelation 21:6"], ["dateVerse", "Sunday, April 24", "Acts 11:1–18", "Psalm 148", "Revelation 21:1–6", "John 13:31–35"], ["watchD", "With weeping they shall come, and with consolations I will lead them back, I will let them walk by brooks of water, in a straight path in which they shall not stumble; for I have become a father to Israel. Jeremiah 31:9"], ["docT", "Now is your time of grief, but I will see you again and you will rejoice, and no one will take away your joy. John 16:22 (NIV)"], ["prayer", "Lord, there are times when our pain seems too much to bear. In realizing that you have experienced the same pain and still choose to bear ours, we are comforted. Help us in our grief to find joy, healing, and renewed life. Amen. "]], "116": [["dateVerse", "Monday, April 25", "Psalm 55:1–8", "Leviticus 18:6–19:11", "Mark 6:14–29"], ["watchD", "Remember the former things of old; for I am God, and there is no other; I am God, and there is no one like me. Isaiah 46:9"], ["docT", "For us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:6"], ["prayer", "Lord—Father, Son, Spirit—you call us together as your people. You bless us with gifts and abilities to use in service to you and your children. Everything comes from you; today we pay special attention to that grace. Amen."]], "117": [["dateVerse", "Tuesday, April 26", "Psalm 55:9–15", "Leviticus 19:12–20:8", "Mark 6:30–44"], ["watchD", "Does God not see my ways, and number all my steps? Job 31:4"], ["docT", "Nothing in all creation is hidden from God’s sight. Everything is uncovered and laid bare before the eyes of him to whom we must give account. Hebrews 4:13 (NIV)"], ["prayer", "Lord, if we came before you on our own merits, no one would stand. Thank you for the grace which redeems us through Jesus. We are grateful that you see what is unrevealed and redeemable in us. Amen."]], "118": [["dateVerse", "Wednesday, April 27", "Psalm 55:16–19", "Leviticus 20:9–21:12", "Mark 6:45–56"], ["watchD", "For in many dreams and in many words there is emptiness. Rather, fear God. Ecclesiastes 5:7 (NASB)"], ["docT", "But avoid stupid controversies, genealogies, dissensions, and quarrels about the law, for they are unprofitable and worthless. Titus 3:9"], ["prayer", "Father, we grieve you with our pettiness! People know we are Christ’s by the love we have for each other. Remind us: in essentials, unity; in non-essentials, liberty; and in everything, love. Reconcile us to one another in you. Amen."]], "119": [["dateVerse", "Thursday, April 28", "Psalm 55:20–23", "Leviticus 21:13–22:16", "Mark 7:1–8"], ["watchD", "I am poor and needy, but the Lord takes thought for me. Psalm 40:17"], ["docT", "Jesus blessed and broke the loaves, and gave them to his disciples to set before the people; and he divided the two fish among them all. And all ate and were filled. Mark 6:41–42"], ["prayer", "Jesus, you meet everyone at their points of need. In appreciation of that blessing from you to us, let us seek out the points where others need us and give them aid. As you bless and feed us, may we do the same for each other. Amen."]], "120": [["dateVerse", "Friday, April 29", "Psalm 56:1–8", "Leviticus 22:17–23:22", "Mark 7:9–23"], ["watchD", "The Lord says, “I will not continually accuse, nor will I always be angry.” Isaiah 57:16"], ["docT", "God saved us and called us with a holy calling, not according to our works but according to his own purpose and grace. This grace was given to us in Christ Jesus. 2 Timothy 1:9"], ["prayer", "Savior, your grace sustains and surprises us! You give us this gift freely, no strings attached. As a result, we feel your calling on our hearts—to follow where you lead—to serve. Thanks be to God! Amen."]], "121": [["dateVerse", "Saturday, April 30", "Psalm 56:9–13", "Leviticus 23:23–24:9", "Mark 7:24–37"], ["watchD", "He guarded his people as the apple of his eye. Deuteronomy 32:10"], ["docT", "We have known and believe the love that God has for us. 1 John 4:16"], ["prayer", "God, how much we long for your love! We search for it in many different places and ways, forgetting sometimes that it is always near and available. Wrap us in your arms and keep us close to your heart. Amen."]], "122": [["info", "Sixth Sunday of Easter"], ["watchO", "Watchword for the Week — Jesus says, “Peace I leave with you; my peace I give to you.” John 14:27"], ["dateVerse", "Sunday, May 1", "Acts 16:9–15", "Psalm 67", "Revelation 21:10,22–22:5", "John 14:23–29"], ["watchD", "I will give them a heart to know that I am the Lord. Jeremiah 24:7"], ["docT", "Remember Jesus Christ, raised from the dead. 2 Timothy 2:8"], ["prayer", "Father, you constantly remind us that you will never leave us or forsake us. Help us give our hearts to you so that you may fill them with your grace and mercy. Amen."]], "123": [["dateVerse", "Monday, May 2", "Psalm 57:1–6", "Leviticus 24:10–25:17", "Mark 8:1–13"], ["watchD", "He bore the sin of many, and made intercession for the transgressors. Isaiah 53:12"], ["docT", "For our sake God made him to be sin who knew no sin, so that in him we might become the righteousness of God. 2 Corinthians 5:21"], ["prayer", "Father, in a world where there is so much sin, we humbly bow before your throne, beneath the cross of Jesus, to seek your forgiveness. Help us to forgive others as you forgive us in our times of need. Amen."]], "124": [["dateVerse", "Tuesday, May 3", "Psalm 57:7–11", "Leviticus 25:18–55", "Mark 8:14–21"], ["watchD", "I will teach transgressors your ways, and sinners will return to you. Psalm 51:13"], ["docT", "Jesus said, “The time is fulfilled, and the kingdom of God has come near; repent, and believe in the good news.” Mark 1:15"], ["prayer", "Have mercy on us, O God, have mercy. When we seek the good news of the kingdom, you always show us how to let the Holy Spirit lead. Help us to put our trust in you for all your promises. Amen."]], "125": [["dateVerse", "Wednesday, May 4", "Psalm 58", "Leviticus 26:1–35", "Mark 8:22–38"], ["watchD", "There are glad songs of victory in the tents of the righteous: “The right hand of the Lord is exalted; the right hand of the Lord does valiantly.” Psalm 118:15–16"], ["docT", "The righteous will shine like the sun in the kingdom of their Father. Matthew 13:43"], ["prayer", "We pray, O Father, for justice on the earth. When no justice can be found, help us to know that justice will ultimately triumph because you are a God who will judge with complete fairness. Thank you, God. Amen."]], "126": [["info", "Ascension Day"], ["watchO", "Watchword for the Ascension — Christ says, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32"], ["dateVerse", "Thursday, May 5", "Psalm 59:1–9", "Leviticus 26:36–27:15", "Mark 9:1–10"], ["specialVerse", "Ascension of the Lord", "Acts 1:1–11", "Psalm 47", "Ephesians 1:15–23", "Luke 24:44–53"], ["watchD", "God is our refuge and strength, a very present help in trouble. Therefore we will not fear. Psalm 46:1–2"], ["docT", "Jesus said, “All authority in heaven and on earth has been given to me.” Matthew 28:18"], ["prayer", "With praise and thanksgiving in our hearts we thank you, God, for your saving grace and help. Your constant love continues to outpour on us each day. May we freely give to others as you give to us. Amen.\f"]], "127": [["dateVerse", "Friday, May 6", "Psalm 59:10–17", "Leviticus 27:16–Numbers 1:16", "Mark 9:11–29"], ["watchD", "A soft answer turns away wrath, but a harsh word stirs up anger. Proverbs 15:1"], ["docT", "The Lord’s servant must not be quarrelsome but kindly to everyone, an apt teacher, patient, correcting opponents with gentleness. \u20282 Timothy 2:24–25"], ["prayer", "In your unfailing love, O God, help us to never forget that you are our Fortress and Strength. Each day we will sing of your new mercies and the joy that you bring to us. Amen."]], "128": [["dateVerse", "Saturday, May 7", "Psalm 60", "Numbers 1:17–54", "Mark 9:30–37"], ["watchD", "Then you shall see the difference between the righteous and the wicked, between one who serves God and one who does not serve him. Malachi 3:18"], ["docT", "Not everyone who says to me, “Lord, Lord,” will enter the kingdom of heaven, but only the one who does the will of my Father in heaven. Matthew 7:21"], ["prayer", "All-powerful God, real help comes from you alone when situations seem out of control. But we know that you can do mighty and great things when we leave it to you, our God, to order and provide. Help us, we pray, to still our souls and wait upon you. Amen."]], "129": [["info", "Ascension Sunday\u2028Seventh Sunday of Easter"], ["watchO", "Watchword for the Week — Rejoice in the Lord, O you righteous, and give thanks to his holy name! Psalm 97:12"], ["dateVerse", "Sunday, May 8", "Acts 16:16–34", "Psalm 97", "Revelation 22:12–14,16–17,20–21", "John 17:20–26"], ["watchD", "Sing to the Lord! Give praise to the Lord! He rescues the life of the needy from the hands of the wicked. Jeremiah 20:13 (NIV)"], ["docT", "Be joyful in hope, patient in affliction, faithful in prayer. Romans 12:12 (NIV)"], ["prayer", "We rejoice in knowing that you, O Lord, are King above the earth. Give us the patience and courage to face the challenges that arise in our homes and family lives. Bless those in authority as parents and guardians to seek your direction and guidance in taking care of your children on earth. Amen."]], "130": [["dateVerse", "Monday, May 9", "Psalm 61", "Numbers 2", "Mark 9:38–50"], ["watchD", "I will establish my covenant with you, and you shall know that I am the Lord. Ezekiel 16:62"], ["docT", "You have heard of this hope before in the word of the truth, the gospel that has come to you. Just as it is bearing fruit and growing in the whole world, so it has been bearing fruit among yourselves from the day you heard it and truly comprehended the grace of God. Colossians 1:5–6"], ["prayer", "Heavenly Father, we are so grateful that we can trust you wherever we are in our lives. We know that your will is our answer when we cry for help. We give thanks for this assurance, in the name of Jesus. Amen."]], "131": [["dateVerse", "Tuesday, May 10", "Psalm 62", "Numbers 3:1–32", "Mark 10:1–12"], ["watchD", "I will save you that you may become a blessing. Zechariah 8:13 (NASB)"], ["docT", "Paul wrote: Not that we are competent of ourselves to claim anything as coming from us; our competence is from God. 2 Corinthians 3:5"], ["prayer", "Lord, you continue to breathe the breath of life within us. Purge our spirits so that your life anew in us will be pleasing in your sight when we recognize that all things come from and through you. Amen."]], "132": [["dateVerse", "Wednesday, May 11", "Psalm 63", "Numbers 3:33–4:14", "Mark 10:13–31"], ["watchD", "I, the Lord, am your Savior and your Redeemer, the mighty One. Isaiah 60:16"], ["docT", "Jesus took her by the hand and said to her, “Talitha cum,” which means, “Little girl, get up!” And immediately the girl got up and began to walk about. Mark 5:41–42"], ["prayer", "Father in heaven, continue to help us to realize that you are our guide through a barren land. We thank you for restoring our faith in you as we trust you to feed us now and evermore on our life’s journey. Amen."]], "133": [["dateVerse", "Thursday, May 12", "Psalm 64", "Numbers 4:15–49", "Mark 10:32–45"], ["watchD", "Do not fear or be dismayed! Joshua 8:1"], ["docT", "Fight the good fight of the faith. 1 Timothy 6:12"], ["prayer", "Gracious God, we give thanks, knowing that when we are going through the storms of life you are there. In all areas of our lives, help us to let go and let you work in us. Let your glory be revealed. Amen."]], "134": [["dateVerse", "Friday, May 13", "Psalm 65:1–8", "Numbers 5", "Mark 10:46–52"], ["watchD", "There is forgiveness with you, so that you may be revered. Psalm 130:4"], ["docT", "If we walk in the light as he himself is in the light, we have fellowship with one another, and the blood of Jesus his Son cleanses us from all sin. 1 John 1:7"], ["prayer", "Thank you, O Father, for being our vision and leading us in the paths of righteousness. Help us to open our spiritual eyes to experience your greatness and your divine presence. These things we ask in Jesus’ name. Amen. "]], "135": [["dateVerse", "Saturday, May 14", "Psalm 65:9–13", "Numbers 6", "Mark 11:1–11"], ["watchD", "You shall not covet your neighbor’s wife. Deuteronomy 5:21 (NIV)"], ["docT", "For this is the will of God, your sanctification: that you abstain from fornication. 1 Thessalonians 4:3"], ["prayer", "Heavenly Father, we thank you for the love with which you continue to fill our spirits and for helping us to be at peace with you. Teach us to wait on you for the answers to our unceasing prayers, so that we can truly see the glory of God shining through our lives. Amen."]], "136": [["info", "Day of Pentecost"], ["watchO", "Watchword for the Week — For all who are led by the Spirit of God are children of God. Romans 8:14"], ["dateVerse", "Sunday, May 15", "Acts 2:1–21", "Psalm 104:24–34,35b", "Romans 8:14–17", "John 14:8–17,(25–27)"], ["watchD", "With my whole heart I seek you; do not let me stray from your commandments. Psalm 119:10"], ["docT", "It is well for the heart to be strengthened by grace. Hebrews 13:9"], ["prayer", "The time is now, O God, when we need to reach out more to you in our faith. We continue to fight battles and you remind us that we fight for you and that the victory is ours. Free us from the forces that keep us from clinging to you and help us to press onward with your promises. Amen. "]], "137": [["dateVerse", "Monday, May 16", "Psalm 66:1–7", "Numbers 7:1–35", "Mark 11:12–26"], ["watchD", "I will say, “They are my people;” and they will say, “The Lord is our God.” Zechariah 13:9"], ["docT", "You were going astray like sheep, but now you have returned to the shepherd and guardian of your souls. 1 Peter 2:25"], ["prayer", "Gracious God, we kneel before you to give thanks for the refreshment that only you can give. Pardon us for the mistakes that we have made and the results of those mistakes which sometimes cause pain and sorrow. We lean on you now as our Shepherd and Guardian. Amen."]], "138": [["dateVerse", "Tuesday, May 17", "Psalm 66:8–15", "Numbers 7:36–71", "Mark 11:27–12:12"], ["watchD", "You shall be called priests of the Lord; you shall be named ministers of our God. Isaiah 61:6"], ["docT", "Paul wrote to Timothy: I remind you to rekindle the gift of God that is within you. 2 Timothy 1:6"], ["prayer", "We bow before you this day to honor, worship, and praise you, living God. The Psalmist reminds us that you are our light, strength, and salvation, and no good thing will you withhold from those who walk uprightly. Hear our prayer today at this time, and renew a right spirit within us. Amen."]], "139": [["dateVerse", "Wednesday, May 18", "Psalm 66:16–20", "Numbers 7:72–8:4", "Mark 12:13–17"], ["watchD", "You shall be holy, for I the Lord your God am holy. Leviticus 19:2 (NASB)"], ["docT", "Clothe yourselves with the new self, created according to the likeness of God in true righteousness and holiness. Ephesians 4:24"], ["prayer", "We give thanks, dear Father, that you wake us to receive new mercies and blessings each day. We are so grateful that we can rise and know that you are always there to lead and guide us even when we become preoccupied. We love you, Father; in the name of Jesus we pray. Amen. "]], "140": [["dateVerse", "Thursday, May 19", "Psalm 67", "Numbers 8:5–9:14", "Mark 12:18–34"], ["watchD", "All people are grass, their constancy is like the flower of the field. The grass withers, the flower fades; but the word of our God will stand forever. Isaiah 40:6,8"], ["docT", "Heaven and earth will pass away, but my words will not pass away. Mark 13:31"], ["prayer", "We stand amazed at your goodness and greatness, gracious Savior, as we seek to walk closer in communion with you. Sin is so prevalent in our human societies. Give us a clear vision of who we are and remind us that we are your representation here on earth. Let us act justly and walk humbly before our God. Amen."]], "141": [["dateVerse", "Friday, May 20", "Psalm 68:1–6", "Numbers 9:15–10:36", "Mark 12:35–44"], ["watchD", "You shall not join hands with the wicked to act as a malicious witness. Exodus 23:1"], ["docT", "So then, putting away falsehood, let all of us speak the truth to our neighbors. Ephesians 4:25"], ["prayer", "We ask you, Gracious Savior, to calm our thoughts and our spirits so that we may hear from you when you need to speak to us. The still small voice reminds us that you are never far away and we only need to quiet ourselves before your throne. Have mercy upon us we pray. Amen."]], "142": [["dateVerse", "Saturday, May 21", "Psalm 68:7–18", "Numbers 11", "Mark 13:1–13"], ["watchD", "The Lord God is a sun and shield. Psalm 84:11"], ["docT", "Therefore do not worry. Matthew 6:31"], ["prayer", "When we worry, Lord, it reminds us that we do not trust you fully. We allow fear to override your promises for us. Remind us that all things belong to you and that you always have the final say. We give you thanks. Amen."]], "143": [["info", "Trinity Sunday"], ["watchO", "Watchword for the Week — Since we are justified by faith, we have peace with God through our Lord Jesus Christ. Romans 5:1"], ["dateVerse", "Sunday, May 22", "Proverbs 8:1–4,22–31", "Psalm 8", "Romans 5:1–5", "John 16:12–15"], ["watchD", "Come, let us go to entreat the favor of the Lord, and to seek the Lord of hosts; I myself am going. Zechariah 8:21"], ["docT", "Through him we have access by one Spirit to the Father. Ephesians 2:18 (NKJV)"], ["prayer", "Thank you, God, that we have access to you and your Son Jesus Christ by the one Spirit. We behave at times as though we have no communication with you and need to fix all things on our own. Forgive us, gracious Father, and show us today that your promises never fail us when we stand on your word. Amen."]], "144": [["dateVerse", "Monday, May 23", "Psalm 68:19–27", "Numbers 12:1–13:16", "Mark 13:14–27"], ["watchD", "You shall rise up before the grayheaded and honor the aged. Leviticus 19:32 (NASB)"], ["docT", "Outdo one another in showing honor. Romans 12:10"], ["prayer", "You have created us in your image to serve and to honor each other in Jesus Christ. Yet sometimes we behave as though we must choose whom we serve and care for. Teach us to respect and love each other so that our lives here on earth are blessings to others, as you always bless us. Amen."]], "145": [["dateVerse", "Tuesday, May 24", "Psalm 68:28–35", "Numbers 13:17–33", "Mark 13:28–37"], ["watchD", "Woe to those who make unjust laws to deprive the poor of their rights and withhold justice from the oppressed. Isaiah 10:1–2 (NIV)"], ["docT", "What partnership is there between righteousness and lawlessness? Or what fellowship is there between light and darkness? 2 Corinthians 6:14"], ["prayer", "God of justice and mercy, guide the nations of the world into the way of justice and truth. Establish among them that peace which is the fruit of righteousness that they may become the kingdom of our Lord and Savior Jesus Christ. Amen."]], "146": [["dateVerse", "Wednesday, May 25", "Psalm 69:1–12", "Numbers 14", "Mark 14:1–11"], ["watchD", "The Lord will command his angels concerning you to guard you in all your ways. On their hands they will bear you up, so that you will not dash your foot against a stone. Psalm 91:11–12"], ["docT", "Paul wrote: The Lord stood by me and gave me strength. 2 Timothy 4:17"], ["prayer", "We forget that you, God, are our strength and stay, and even in our busyness we weary ourselves as we go about our day-to-day chores. In our hearts you are asking us to rest in you. Forgive us; bring us to the awareness that you alone give us true rest. In your name we pray. Amen."]], "147": [["dateVerse", "Thursday, May 26", "Psalm 69:13–21", "Numbers 15:1–31", "Mark 14:12–31"], ["watchD", "Make known his deeds among the nations; proclaim that his name is exalted. Isaiah 12:4"], ["docT", "Jesus said to them, “Go into all the world and proclaim the good news to the whole creation.” Mark 16:15"], ["prayer", "Heavenly Father, sometimes we are scared to go out and proclaim the good news to those we meet, as too often we prefer issues over people and selfishness over helping others. Forgive our foolish ways, dear Savior, and bring us to that saving knowledge that when we share the good news, we are also winning souls for your kingdom. Amen."]], "148": [["dateVerse", "Friday, May 27", "Psalm 69:22–29", "Numbers 15:32–16:27", "Mark 14:32–42"], ["watchD", "Lord, do not let the downtrodden be put to shame. Psalm 74:21"], ["docT", "My grace is sufficient for you, for my power is made perfect in weakness. 2 Corinthians 12:9 (NIV)"], ["prayer", "Heavenly Father, help us to receive the gift of grace that only you can give when we seek your salvation in our lives. Help us to remember that we toil unto you, and not unto ourselves, in your vineyard here on earth as we continue to seek your great salvation. Our thanks we lift to you. Amen."]], "149": [["dateVerse", "Saturday, May 28", "Psalm 69:30–36", "Numbers 16:28–17:13", "Mark 14:43–52"], ["watchD", "He has redeemed my soul from going down to the pit, and my life shall see the light. Job 33:28"], ["docT", "God raised the Lord and will also raise us by his power. 1 Corinthians 6:14"], ["prayer", "God, we walk as though we have no hope in you. Your word declares that nothing can separate us from your love which is in Christ Jesus. Melt us, mold us, fill us, use us in your ministry as we journey on our toilsome way here on earth, for you are our faithful God. Amen."]], "150": [["info", "Second Sunday after Pentecost"], ["watchO", "Watchword for the Week — Declare God’s glory among the nations, his marvelous works among all the peoples. Psalm 96:3"], ["dateVerse", "Sunday, May 29", "1 Kings 8:22–23,41–43", "Psalm 96:1–9", "Galatians 1:1–12", "Luke 7:1–10"], ["watchD", "I stretch out my hands to you; my soul thirsts for you like a parched land. Psalm 143:6"], ["docT", "Come to me, all you that are weary and are carrying heavy burdens, and I will give you rest. Matthew 11:28"], ["prayer", "We pause to say within our hearts that we need you, God. Troubles come our way, burdens are heavy, and we can no longer walk the path. We feel like giving up, but you remind us that you carried the cross to Calvary for us and took all of our burdens. Refresh our spirits, Lord, and have mercy on us. Amen."]], "151": [["dateVerse", "Monday, May 30", "Psalm 70", "Numbers 18:1–24", "Mark 14:53–65"], ["watchD", "God said to Moses, “I am who I am.” Exodus 3:14"], ["docT", "Jesus Christ says, “I am with you always, to the end of the age.” Matthew 28:20"], ["prayer", "Hear our prayer, O Lord, in the words of the hymn writer. We are reminded of the great city Jerusalem, descending from above and the joy that waits for us there. We celebrate and rejoice in knowing and tasting such sweet bliss beyond compare. Incline your ear to us, and grant us your peace. Amen."]], "152": [["dateVerse", "Tuesday, May 31", "Psalm 71:1–8", "Numbers 18:25–19:22", "Mark 14:66–72"], ["watchD", "Blessed are those who act justly, who always do what is right. Psalm 106:3 (NIV)"], ["docT", "This is my commandment, that you love one another as I have loved you. John 15:12"], ["prayer", "Fill our hearts today with the knowledge that we have a purpose to fulfill, as we come to your throne asking for the confidence and the courage to complete the tasks set before us. As we close another month in this year, help us to walk in your deep love with our brothers and sisters. Bless us we pray. Amen."]], "153": [["dateVerse", "Wednesday, June 1", "Psalm 71:9–18a", "Numbers 20:1–21:9", "Mark 15:1–20"], ["watchD", "I gave them my statutes and showed them my ordinances, by whose observance everyone shall live. Ezekiel 20:11"], ["docT", "Jesus answered, “Those who love me will keep my word, and my Father will love them, and we will come to them and make our home with them.” John 14:23"], ["prayer", "Lord, make your home in our hearts and guide us to live in your ways. Give us the strength to honor you through our words and actions, to praise you alone, and to shine your light in the world. Amen."]], "154": [["dateVerse", "Thursday, June 2", "Psalm 71:18b–24", "Numbers 21:10–22:6", "Mark 15:21–32"], ["watchD", "Turn back from your evil ways; for why will you die? Ezekiel 33:11"], ["docT", "There will be more joy in heaven over one sinner who repents than over ninety-nine righteous persons who need no repentance. Luke 15:7"], ["prayer", "Faithful Father, thank you for the hope, peace, joy, and love that knowing you brings to our lives. Help us to take comfort in you in times of trial and suffering, and to praise you with our whole beings in times of joy and celebration. Amen."]], "155": [["dateVerse", "Friday, June 3", "Psalm 72:1–11", "Numbers 22:7–41", "Mark 15:33–47"], ["watchD", "Even the sparrow finds a home, and the swallow a nest for herself, where she may lay her young, at your altars, O Lord of hosts, my King and my God. Psalm 84:3"], ["docT", "So then you are no longer strangers and aliens, but you are citizens with the saints and also members of the household of God. Ephesians 2:19"], ["prayer", "Gracious, heavenly Father, teach all those in positions of power about your justice and righteousness. Be with those living in poverty and oppression that they may find a life of abundance through you. Empower us to do your mission, to be your sheep, and to take the time to listen for you each and every day. Amen."]], "156": [["dateVerse", "Saturday, June 4", "Psalm 72:12–20", "Numbers 23", "Mark 16:1–13"], ["watchD", "I will show love to Judah; and I will save them—not by bow, sword or battle, or by horses and horsemen, but I, the Lord their God, will save them. Hosea 1:7 (NIV)"], ["docT", "So it depends not on human will or exertion, but on God who shows mercy. Romans 9:16"], ["prayer", "Heavenly Father, thank you for our many blessings, gifts, and talents. Show us how to use these blessings to glorify you. Give us true understanding of your words of love, and give us trust in your ways that we may better hear and see your will. Amen."]], "157": [["info", "Third Sunday after Pentecost"], ["watchO", "Watchword for the Week — Sing praises to the Lord, O you his faithful ones, and give thanks to his holy name. Psalm 30:4"], ["dateVerse", "Sunday, June 5", "1 Kings 17:17–24", "Psalm 30", "Galatians 1:11–24", "Luke 7:11–17"], ["watchD", "Moses said to the Lord, “If your presence does not go with us, do not send us up from here.” Exodus 33:15 (NIV)"], ["docT", "When the Spirit of truth comes, he will guide you into all the truth. John 16:13"], ["prayer", "Loving God, thank you for your words that remind us that your people will always have enough. Thank you for our lives of abundance; help us to share that abundance with those in need. Walk with us each day, and help us to slow down to see your love and works of wonder in the world around us. Amen."]], "158": [["dateVerse", "Monday, June 6", "Psalm 73:1–12", "Numbers 24,25", "Mark 16:14– Luke 1:4"], ["watchD", "Woe to you who join house to house, and add field to field, until there is room for no one but you, and you are left to live alone in the midst of the land! Isaiah 5:8"], ["docT", "Take care! Be on your guard against all kinds of greed; for one’s life does not consist in the abundance of possessions. Luke 12:15"], ["prayer", "Holy One, give us pure hearts and minds; help us to think and act with the love that you have taught us. Forgive us when we stray and think or act in jealousy, and remind us of our many blessings. Help us to proclaim your truth and love in all that we think and do. In Jesus’ name we pray. Amen."]], "159": [["dateVerse", "Tuesday, June 7", "Psalm 73:13–20", "Numbers 26:1–24", "Luke 1:5–25"], ["watchD", "You show me the path of life. Psalm 16:11"], ["docT", "The free gift of God is eternal life in Christ Jesus our Lord. Romans 6:23"], ["prayer", "Teacher, light the path that you have laid for us to follow so that we might see your plans for us and know your will. Give us the strength and courage to follow where you lead, trusting in you with our whole selves. Amen."]], "160": [["dateVerse", "Wednesday, June 8", "Psalm 73:21–28", "Numbers 26:25–56", "Luke 1:26–38"], ["watchD", "The Lord lifts up those who are bowed down. Psalm 146:8"], ["docT", "Jesus said in a loud voice, “Let anyone who is thirsty come to me and drink.” John 7:37 (NIV)"], ["prayer", "Father, be with us when our minds and bodies are weak and we find it difficult to understand your ways. Help us to lay our burdens at your feet and take comfort and strength in you and your promise of eternity. Amen."]], "161": [["dateVerse", "Thursday, June 9", "Psalm 74:1–9", "Numbers 26:57–27:23", "Luke 1:39–45"], ["watchD", "God will not take away a life; he will devise plans so as not to keep an outcast banished forever from his presence. 2 Samuel 14:14"], ["docT", "The scribes said to Jesus’ disciples, “Why does he eat with tax collectors and sinners?” When Jesus heard this, he said to them, “Those who are well have no need of a physician, but those who are sick.” Mark 2:16–17"], ["prayer", "Lord, open our hearts to love all those we meet, our eyes to see all those in need, our hands to hold and help where we can, our minds to learn from others and to allow you to lead, and our ears to listen more than we speak and to hear your words. Amen."]], "162": [["dateVerse", "Friday, June 10", "Psalm 74:10–17", "Numbers 28:1–29:6", "Luke 1:46–56"], ["watchD", "What god in heaven or on earth can perform deeds and mighty acts like yours! Deuteronomy 3:24"], ["docT", "Everyone then who hears these words of mine and acts on them will be like a wise man who built his house on rock. Matthew 7:24"], ["prayer", "Gracious God, let our hearts be filled with gratitude, let our voices rise to praise you, and let our hands outstretch to serve you. Let us praise and honor you with our gifts offered freely, for your blessings are bountiful. Amen."]], "163": [["dateVerse", "Saturday, June 11", "Psalm 74:18–23", "Numbers 29:7–40", "Luke 1:57–66"], ["watchD", "By the ordinances of the Lord is your servant warned. Psalm 19:11"], ["docT", "Pay attention to how you listen. Luke 8:18"], ["prayer", "Forgive us, God, when we fail to walk with you; guide us back to you, and fill us with your love and grace that we might better serve you. Amen."]], "164": [["info", "Fourth Sunday after Pentecost"], ["watchO", "Watchword for the Week — We know that a person is justified not by the works of the law but through faith in Jesus Christ. Galatians 2:16"], ["dateVerse", "Sunday, June 12", "2 Samuel 11:26–12:10,13–15", "Psalm 32", "Galatians 2:15–21", "Luke 7:36–8:3"], ["watchD", "Teach me to do your will, for you are my God. Let your good spirit lead me on a level path. Psalm 143:10"], ["docT", "As you therefore have received Christ Jesus the Lord, continue to live your lives in him, rooted and built up in him and established in the faith. Colossians 2:6–7"], ["prayer", "Thank you, God, for your gift of love and grace through your Son, Jesus Christ. Help us to live lives rooted deep in faith, acting in love toward all as Jesus taught. Amen."]], "165": [["dateVerse", "Monday, June 13", "Psalm 75", "Numbers 30:1–31:12", "Luke 1:67–80"], ["watchD", "You shall be like a watered garden, like a spring of water, whose waters never fail. Isaiah 58:11"], ["docT", "Those who drink of the water that I will give them will never be thirsty. The water that I will give will become in them a spring of water gushing up to eternal life. John 4:14"], ["prayer", "God, we thank you for your promise of abundance. Sustain us through difficult times and help us to remain faithful to you. Bless all those who don’t have enough; teach us to be helping hands of love and make us compassionate to those in need. Amen."]], "166": [["dateVerse", "Tuesday, June 14", "Psalm 76", "Numbers 31:13–47", "Luke 2:1–20"], ["watchD", "Commit your way to the Lord; trust in him, and he will act. Psalm 37:5"], ["docT", "Through Jesus Christ we have obtained access to this grace in which we stand; and we boast in our hope of sharing the glory of God. Romans 5:2"], ["prayer", "Keep us humble and in wonder of your glory, God. Help us to trust in you, and to honor and praise you throughout our lives for the grace and hope that we share through the gift of your Son. Amen. "]], "167": [["dateVerse", "Wednesday, June 15", "Psalm 77:1–9", "Numbers 31:48–32:27", "Luke 2:21–32"], ["watchD", "Must I not take care to say what the Lord puts into my mouth? Numbers 23:12"], ["docT", "We cannot keep from speaking about what we have seen and heard. Acts 4:20"], ["prayer", "Lord, be our comfort on stressful days and sleepless nights, when our minds are full of worry and anxiety. Shine in our hearts, ease our troubled minds, and give us the optimism, strength, and clarity of mind that we need to overcome our obstacles. Amen."]], "168": [["dateVerse", "Thursday, June 16", "Psalm 77:10–15", "Numbers 32:28–33:9", "Luke 2:33–40"], ["watchD", "The Lord knows our thoughts, that they are but an empty breath. Psalm 94:11"], ["docT", "Do not claim to be wiser than you are. Romans 12:16"], ["prayer", "Heavenly Father, guide our prayer and meditation to your wonder. Help our thoughts to remain positive and rooted in love. Let us speak only words of love and act with kindness and humility. Amen. "]], "169": [["dateVerse", "Friday, June 17", "Psalm 77:16–20", "Numbers 33:10–56", "Luke 2:41–52"], ["watchD", "Let the prophet who has a dream tell the dream, but let the one who has my word speak my word faithfully. What has straw in common with wheat? says the Lord. Jeremiah 23:28"], ["docT", "Beloved, do not believe every spirit, but test the spirits. 1 John 4:1"], ["prayer", "Faithful Shepherd, lead us; through trial and injustice, lead us; through stress and business, lead us; through illness and loss, lead us. Carry us when we are weak and tired, find us when we are lost, heal us when we are sick; leave no one behind. Faithful Shepherd, lead your flock. Amen."]], "170": [["dateVerse", "Saturday, June 18", "Psalm 78:1–8", "Numbers 34", "Luke 3:1–20"], ["watchD", "And Jerusalem shall be to me a name of joy, a praise and a glory before all the nations of the earth who shall hear of all the good that I do for them. Jeremiah 33:9"], ["docT", "Christ has become a servant of the circumcised on behalf of the truth of God in order that he might confirm the promises given to the patriarchs, and in order that the Gentiles might glorify God for his mercy. Romans 15:8–9"], ["prayer", "God, in this time of greed and injustice where what we have is never enough, let us be reminded of what is truly important. Let our hearts and prayers be filled with gratitude. Help us to give to those with less, be fair and just with others, and listen to and live your teachings of love. Amen."]], "171": [["info", "Fifth Sunday after Pentecost"], ["watchO", "Watchword for the Week — For dominion belongs to the Lord, and he rules over the nations. Psalm 22:28"], ["dateVerse", "Sunday, June 19", "Isaiah 65:1–9", "Psalm 22:19–28", "Galatians 3:23–29", "Luke 8:26–39"], ["watchD", "Thus says the Lord: heaven is my throne and the earth is my footstool; what is the house that you would build for me? Isaiah 66:1"], ["docT", "If anyone says to you at that time, “Look! Here is the Messiah!” or “Look! There he is!”—do not believe it. Mark 13:21"], ["prayer", "Heavenly Sustainer, as we gather for worship today, we pray for safety in our travels, and we thank you for our church fellowship. We ask that you strengthen and restore us. Let us be inspired by one another and by your words and our pastors’ words. Strengthen us, restore us, and fill us with your peace and love to help us through the week ahead. Amen."]], "172": [["dateVerse", "Monday, June 20", "Psalm 78:9–16", "Numbers 35:1–30", "Luke 3:21–38"], ["watchD", "Though the Lord is high, he regards the lowly; but the haughty he perceives from far away. Psalm 138:6"], ["docT", "God chose what is low and despised in the world. 1 Corinthians 1:28"], ["prayer", "Father, give us energy and serenity for the week ahead. Help us to feel fulfilled by the work that we do, and to be mindful that we do all things through you and for you. Be with us this week, lead our decisions, and calm our minds so that we may focus on you. Amen."]], "173": [["dateVerse", "Tuesday, June 21", "Psalm 78:17–31", "Numbers 35:31–Deuteronomy 1:18", "Luke 4:1–13"], ["watchD", "So acknowledge and take to heart this day that the Lord is God in heaven above and on the earth below. There is no other. Deuteronomy 4:39 (NIV)"], ["docT", "He is not far from each one of us. For “In him we live and move and have our being.” Acts 17:27–28"], ["prayer", "May our homes be a refuge from the stress and injustice in the world around us where we are safe, rejuvenated, and loved. May our schools inspire a love of learning where students and teachers feel safe, loved, and happy. Bless our homes and schools, that they may be places where we grow closer to you. Amen."]], "174": [["dateVerse", "Wednesday, June 22", "Psalm 78:32–39", "Deuteronomy 1:19–46", "Luke 4:14–21"], ["watchD", "So now, O Israel, what does the Lord your God require of you? Only to fear the Lord your God, to walk in all his ways, to love him, to serve the Lord your God with all your heart and with all your soul. Deuteronomy 10:12"], ["docT", "Whoever obeys his word, truly in this person the love of God has reached perfection. By this we may be sure that we are in him. 1 John 2:5"], ["prayer", "Lord, hear the prayers of all those in need, of those who are sick, hungry, homeless, oppressed, and impoverished. For all those who carry a heavy burden, please lighten their load. Help them to find your light and love in the world. Amen."]], "175": [["dateVerse", "Thursday, June 23", "Psalm 78:40–55", "Deuteronomy 2", "Luke 4:22–30"], ["watchD", "You have given me the shield of your salvation, and your right hand has supported me. Psalm 18:35"], ["docT", "The kingdom of God does not consist in words but in power. 1 Corinthians 4:20 (NASB)"], ["prayer", "Guide our nation and world leaders, grant them wisdom, conviction, courage, and compassion. We pray for an end to hatred and war, for a world united in love and peace. We pray for the ecological healing of our world, that we may be conscious of our impact on your creation. Help us to be better stewards of the world we live in and all those who inhabit it. Amen."]], "176": [["dateVerse", "Friday, June 24", "Psalm 78:56–64", "Deuteronomy 3", "Luke 4:31–44"], ["watchD", "O magnify the Lord with me, and let us exalt his name together. Psalm 34:3"], ["docT", "There was a man sent from God, whose name was John. He came as a witness to testify to the light, so that all might believe through him. John 1:6–7"], ["prayer", "God, thank you for our church families where we share and strengthen our faith. Empower and inspire us to live your love in the world each and every day. Amen."]], "177": [["dateVerse", "Saturday, June 25", "Psalm 78:65–72", "Deuteronomy 4:1–31", "Luke 5:1–11"], ["watchD", "The steadfast love of the Lord is from everlasting to everlasting on those who fear him, and his righteousness to children’s children, to those who keep his covenant. Psalm 103:17–18"], ["docT", "Jesus Christ is the same yesterday and today and forever. Hebrews 13:8"], ["prayer", "God, we pray for Christians, that we might hear your words and seek a deeper faith. Open our minds, hearts, and hands to love others so that we may share with them the good news of your grace. Amen."]], "178": [["info", "Sixth Sunday after Pentecost"], ["watchO", "Watchword for the Week — If we live by the Spirit, let us also be guided by the Spirit. Galatians 5:25"], ["dateVerse", "Sunday, June 26", "1 Kings 19:15–16,19–21", "Psalm 16", "Galatians 5:1,13–25", "Luke 9:51–62"], ["watchD", "Do not be afraid, for I am with you and will bless you. Genesis 26:24"], ["docT", "When they saw the boldness of Peter and John and realized that they were uneducated and ordinary men, they were amazed and recognized them as companions of Jesus. Acts 4:13"], ["prayer", "Lord our God, thank you for providing us with all that we need, for the many gifts that you have entrusted to us, and for your protection and presence throughout our lives. Guide our futures so that we may faithfully serve you. Amen."]], "179": [["dateVerse", "Monday, June 27", "Psalm 79:1–8", "Deuteronomy 4:32–5:21", "Luke 5:12–26"], ["watchD", "Love the Lord, all you his saints. Psalm 31:23"], ["docT", "The scribe said to Jesus, “You are right, Teacher; you have truly said that ‘He is one, and besides him there is no other;’ and ‘to love him with all the heart, and with all the understanding, and with all the strength,’ and ‘to love one’s neighbor as oneself,’—this is much more important than all whole burnt offerings and sacrifices.” Mark 12:32–33"], ["prayer", "Teacher, help us to live in and be guided by the Spirit. Help us to seek a true understanding of your words, to be faithful and to love one another with our whole selves, and to love you with all of our hearts, minds, and souls. Amen."]], "180": [["dateVerse", "Tuesday, June 28", "Psalm 79:9–13", "Deuteronomy 5:22–6:25", "Luke 5:27–39"], ["watchD", "You shall go out in joy, and be led back in peace. Isaiah 55:12"], ["docT", "Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled, and do not let them be afraid. John 14:27"], ["prayer", "Give us peaceful minds and loving hearts, O Lord, to share your love with all we connect with. Let us trust and take comfort in you when our hearts are troubled and we live in fear. Help us to feel your love shining in us always. Amen."]], "181": [["dateVerse", "Wednesday, June 29", "Psalm 80:1–7", "Deuteronomy 7", "Luke 6:1–11"], ["watchD", "When you have eaten and are satisfied, praise the Lord your God. Deuteronomy 8:10 (NIV)"], ["docT", "God has not left himself without a witness in doing good—giving you rains from heaven and fruitful seasons, and filling you with food and your hearts with joy. Acts 14:17"], ["prayer", "Let us praise you with joyous hearts for our many blessings: for enough food to nourish our bodies; for love and fellowship; for our warm and comfortable homes; for the convenience technology brings to our lives; for health, strength, and energy; and for the beauty that we find in nature. Thank you. Amen."]], "182": [["dateVerse", "Thursday, June 30", "Psalm 80:8–11", "Deuteronomy 8:1–9:6", "Luke 6:12–26"], ["watchD", "I have seen their ways, but I will heal them; I will lead them and repay them with comfort. Isaiah 57:18"], ["docT", "The Twelve went out and proclaimed that all should repent. They cast out many demons, and anointed with oil many who were sick and cured them. Mark 6:12–13"], ["prayer", "Guide us, Lord, as we walk your path. Shine your light through us in the darkness and give us strength and courage for our journey. Live in our hearts, we pray. Amen. "]], "183": [["dateVerse", "Friday, July 1", "Psalm 80:12–19", "Deuteronomy 9:7–10:22", "Luke 6:27–38"], ["watchD", "But who am I, and who are my people, that we should be able to offer so willingly as this? For all things come from you, and of your own have we given you. 1 Chronicles 29:14 (NKJV)"], ["docT", "Paul wrote: At the present time your plenty will supply what they need, so that in turn their plenty will supply what you need. The goal is equality. 2 Corinthians 8:14 (NIV)"], ["prayer", "God of all creation, all we have is yours; we are but caretakers of your bounty. Open our hearts and our hands and make us willing to give back to you so that others will hear your good news! Amen. "]], "184": [["dateVerse", "Saturday, July 2", "Psalm 81:1–5", "Deuteronomy 11", "Luke 6:39–49"], ["watchD", "You, Lord, brought me up from the realm of the dead; you spared me from going down to the pit. Psalm 30:3 (NIV)"], ["docT", "He has rescued us from the power of darkness and transferred us into the kingdom of his beloved Son. Colossians 1:13"], ["prayer", "Gracious God, you rescued us from the depths of darkness. Help us to reach out to others and share your word with them so that they will not taste death, but will receive eternal life and live in your kingdom. Amen."]], "185": [["info", "Seventh Sunday after Pentecost"], ["watchO", "Watchword for the Week — So let us not grow weary in doing what is right. Galatians 6:9"], ["dateVerse", "Sunday, July 3", "Isaiah 66:10–14", "Psalm 66:1–9", "Galatians 6:(1–6),7–16", "Luke 10:1–11,16–20"], ["watchD", "Truly the day of the Lord is great; terrible indeed—who can endure it? Yet even now, says the Lord, return to me with all your heart. Joel 2:11–12"], ["docT", "The night is far gone, the day is near. Let us then lay aside the works of darkness and put on the armor of light. Romans 13:12"], ["prayer", "Savior of the world, the time of your return is drawing nigh; bring your light into our hearts and rekindle our spirits as we await your return. Equip us to endure the darkness that surrounds us. Amen."]], "186": [["dateVerse", "Monday, July 4", "Psalm 81:6–10", "Deuteronomy 12", "Luke 7:1–17"], ["watchD", "I will sing to the Lord as long as I live; I will sing praise to my God while I have being. Psalm 104:33"], ["docT", "Sing psalms and hymns and spiritual songs among yourselves, singing and making melody to the Lord in your hearts. Ephesians 5:19"], ["prayer", "Good Shepherd, we praise you for your abounding love and goodness. We thank you for your boundless and sacrificial gift of grace for us when we were lost to sin, and for the gift of eternal life! Amen."]], "187": [["dateVerse", "Tuesday, July 5", "Psalm 81:11–16", "Deuteronomy 13:1–14:21", "Luke 7:18–30"], ["watchD", "Your hands have made and fashioned me; give me understanding that I may learn your commandments. Psalm 119:73"], ["docT", "I give thanks to my God always for you because of the grace of God that has been given you in Christ Jesus, for in every way you have been enriched in him, in speech and knowledge of every kind. 1 Corinthians 1:4–5"], ["prayer", "Lord Jesus, it pleases you for your people to be united as one. Grant us direction, Lord, so that we may remain united in love and service. Let your light shine in us, as we love and serve you and others. Amen."]], "188": [["dateVerse", "Wednesday, July 6", "Psalm 82:1–4", "Deuteronomy 14:22–15:18", "Luke 7:31–38"], ["specialVerse", "John Hus Festival†", "Isaiah 49:1–7", "Psalm 135:1–13", "1 Corinthians 1:18–24", "Mark 8:34–38"], ["watchD", "The king of Israel, the Lord, is in your midst; you shall fear disaster no more. Zephaniah 3:15"], ["docT", "Keep alert, stand firm in your faith, be courageous, be strong. 1 Corinthians 16:13"], ["prayer", "King of kings and Lord of lords, empower us to stand firm as we continue to await your return. Give us renewed strength. Keep us alert and equip us for standing up against the evils of this dark world! Amen."], ["info", "†On July 6, 1415, John Hus was martyred at the Council of Constance."]], "189": [["dateVerse", "Thursday, July 7", "Psalm 82:5–8", "Deuteronomy 15:19–17:7", "Luke 7:39–50"], ["watchD", "Do not say, “I am too young.” You must go to everyone I send you to and say whatever I command you. Jeremiah 1:7 (NIV)"], ["docT", "The Lord said to Paul, “Do not be afraid, but speak and do not be silent; for I am with you.” Acts 18:9–10"], ["prayer", "Lord, speak to us; graciously reveal your wisdom and strength as we continue to let your light shine in and through us in the world. Let us not be afraid, but in boldness proclaim you as our Lord. Amen."]], "190": [["dateVerse", "Friday, July 8", "Psalm 83:1–8", "Deuteronomy 17:8–18:22", "Luke 8:1–15"], ["watchD", "The mighty one, God the Lord, speaks and summons the earth from the rising of the sun to its setting. Psalm 50:1"], ["docT", "In the past God spoke to our ancestors through the prophets at many times and in various ways, but in these last days he has spoken to us by his Son. Hebrews 1:1–2 (NIV)"], ["prayer", "King of glory, it is the Father’s pleasure that you alone be honored, glorified, and praised, for you alone are worthy to have every knee bow and every tongue confess. You are Lord of all. Amen. "]], "191": [["dateVerse", "Saturday, July 9", "Psalm 83:9–12", "Deuteronomy 19:1–20:9", "Luke 8:16–25"], ["watchD", "Ah Lord God! It is you who made the heavens and the earth by your great power and by your outstretched arm! Nothing is too hard for you. Jeremiah 32:17"], ["docT", "We rely not on ourselves but on God who raises the dead. He who rescued us from so deadly a peril will continue to rescue us; on him we have set our hope that he will rescue us again. \u20282 Corinthians 1:9–10"], ["prayer", "Great Father of glory, nothing is too difficult for you. You render unto us the same strength and power that raised Jesus from the dead. It is you who equips and strengthens us to serve your kingdom. Amen."]], "192": [["info", "Eighth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Make me to know your ways, O Lord; teach me your paths. Psalm 25:4"], ["dateVerse", "Sunday, July 10", "Deuteronomy 30:9–14", "Psalm 25:1–10", "Colossians 1:1–14", "Luke 10:25–37"], ["watchD", "You shall be a crown of beauty in the hand of the Lord, and a royal diadem in the hand of your God. Isaiah 62:3"], ["docT", "I saw the holy city, the new Jerusalem, coming down out of heaven from God, prepared as a bride adorned for her husband. Revelation 21:2"], ["prayer", "Strong Deliverer, shower us with your healing strength; be our Shield as we move as pilgrims in this land. Be our Pillar of fire that leads us on our journey. Be our Guide and Redeemer as we await your approaching return. Amen."]], "193": [["dateVerse", "Monday, July 11", "Psalm 83:13–18", "Deuteronomy 20:10–21:23", "Luke 8:26–39"], ["watchD", "Amos cried out, “O Lord God, forgive, I beg you! How can Jacob stand? He is so small!” The Lord relented concerning this; “It shall not be,” said the Lord. Amos 7:2–3"], ["docT", "Pray in the Spirit at all times in every prayer and supplication. To that end keep alert and always persevere in supplication for all the saints. Ephesians 6:18"], ["prayer", "God of hope, pour out your Spirit upon us; let us feel the warmth of your abounding love and your merciful grace. Let us feel surrounded by your calmness and gentleness as we daily gain our victory over sin. Amen."]], "194": [["dateVerse", "Tuesday, July 12", "Psalm 84:1–7", "Deuteronomy 22", "Luke 8:40–56"], ["watchD", "Seek good and not evil, that you may live. Amos 5:14"], ["docT", "Let all that you do be done in love. 1 Corinthians 16:14"], ["prayer", "Lover of our souls, we look trustingly and with hope toward the cross of Calvary, for you alone are our true salvation. You alone hear our prayers and fill our hearts with abounding love and forgiveness. Amen."]], "195": [["dateVerse", "Wednesday, July 13", "Psalm 84:8–12", "Deuteronomy 23:1–24:13", "Luke 9:1–11"], ["watchD", "I said, “I will guard my ways that I may not sin with my tongue.” Psalm 39:1"], ["docT", "Let no evil talk come out of your mouths, but only what is useful for building up, as there is need, so that your words may give grace to those who hear. Ephesians 4:29"], ["prayer", "Redeeming Lord, give to us your Spirit of grace and love so that evil will not prevail in our lives. Use us to build up and encourage those around us, both in our homes and in our communities. Amen. "]], "196": [["dateVerse", "Thursday, July 14", "Psalm 85:1–7", "Deuteronomy 24:14–25:19", "Luke 9:12–27"], ["watchD", "You who love the Lord, hate evil! Psalm 97:10 (NKJV)"], ["docT", "For it is God’s will that by doing right you should silence the ignorance of the foolish. As servants of God, live as free people, yet do not use your freedom as a pretext for evil. 1 Peter 2:15–16"], ["prayer", "Jesus, Master, whom we serve, we are wholly yours: bodies, minds, and souls. We desire to do your perfect will in our lives; we desire to serve you and others faithfully all the days of our lives. Amen."]], "197": [["dateVerse", "Friday, July 15", "Psalm 85:8–13", "Deuteronomy 26:1–27:13", "Luke 9:28–36"], ["watchD", "You shall not commit adultery. Exodus 20:14"], ["docT", "Let marriage be held in honor. Hebrews 13:4"], ["prayer", "Merciful God, how grateful we are for your covenant love that reigns over us and within us. May your love continue to unite all people, as we strive to be living examples of your love to others. Amen."]], "198": [["dateVerse", "Saturday, July 16", "Psalm 86:1–10", "Deuteronomy 27:14–28:24", "Luke 9:37–50"], ["watchD", "O Lord, my strength and my stronghold, my refuge on the day of trouble. Jeremiah 16:19"], ["docT", "Jairus came and, when he saw Jesus, fell at his feet and begged him repeatedly, “My little daughter is at the point of death. Come and lay your hands on her, so that she may be made well, and live.” So he went with him. Mark 5:22–24"], ["prayer", "Precious Savior and Friend, in our times of desperate need, when we bear great personal griefs, our hope is built on you alone. In you we find hope for healing, hope for the future, and hope for all eternity. Amen. "]], "199": [["info", "Ninth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Is anything too wonderful for the Lord? Genesis 18:14"], ["dateVerse", "Sunday, July 17", "Genesis 18:1–10a", "Psalm 15", "Colossians 1:15–28", "Luke 10:38–42"], ["watchD", "He sent redemption to his people; he has commanded his covenant forever. Psalm 111:9"], ["docT", "The crowd was amazed when they saw the mute speaking, the maimed whole, the lame walking, and the blind seeing. And they praised the God of Israel. Matthew 15:31"], ["prayer", "Savior of the world, you died and rose to save and redeem a lost world. So wondrous is your gift of eternal salvation; you heal all the broken places of our bodies, minds, and souls. Amen."]], "200": [["dateVerse", "Monday, July 18", "Psalm 86:11–17", "Deuteronomy 28:25–57", "Luke 9:51–62"], ["watchD", "The Lord’s mercies never come to an end; they are new every morning; great is your faithfulness. Lamentations 3:22–23"], ["docT", "So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 2 Corinthians 4:16"], ["prayer", "Prince of Peace, we rejoice in our hearts knowing that we are not alone, for you neither sleep nor slumber. Despite our physical deterioration, you continue to renew our inner beings, as we await your return. Amen. "]], "201": [["dateVerse", "Tuesday, July 19", "Psalm 87", "Deuteronomy 28:58–29:21", "Luke 10:1–16"], ["watchD", "My thoughts are not your thoughts, nor are your ways my ways, says the Lord. Isaiah 55:8"], ["docT", "John said to Jesus, “Teacher, we saw someone casting out demons in your name, and we tried to stop him, because he was not following us.” But Jesus said, “Do not stop him. Whoever is not against us is for us.” Mark 9:38–39a,40"], ["prayer", "Master, whom we serve, give us the mind of Christ as we seek to faithfully obey your precepts. Give us the strength of Christ as we strive to serve others and be Christ-like examples to them. Amen. "]], "202": [["dateVerse", "Wednesday, July 20", "Psalm 88:1–5", "Deuteronomy 29:22–31:8", "Luke 10:17–24"], ["watchD", "All shall give as they are able, according to the blessing of the Lord your God that he has given you. Deuteronomy 16:17"], ["docT", "Like good stewards of the manifold grace of God, serve one another with whatever gift each of you has received. 1 Peter 4:10"], ["prayer", "Chief Elder of our heart, kindle in us your abounding love and heartfelt compassion for others; use the gifts, talents, and resources you have blessed each of us with to serve all of humanity. Amen."]], "203": [["dateVerse", "Thursday, July 21", "Psalm 88:6–12", "Deuteronomy 31:9–32:9", "Luke 10:25–42"], ["watchD", "I the Lord will speak the word that I speak, and it will be fulfilled. Ezekiel 12:25"], ["docT", "May the Lord direct your hearts to the love of God and to the steadfastness of Christ. 2 Thessalonians 3:5"], ["prayer", "Jesus, Master and Friend, keep our tongues pure and holy; fill our mouths with your words. Set our hearts and minds on the heavenly things above. Set our feet on your firm and strong foundation. Amen. "]], "204": [["dateVerse", "Friday, July 22", "Psalm 88:13–18", "Deuteronomy 32:10–43", "Luke 11:1–13"], ["watchD", "Lord, your decrees are my delight, they are my counselors. Psalm 119:24"], ["docT", "Jesus’ parents found him in the temple, sitting among the teachers, listening to them and asking them questions. Luke 2:46"], ["prayer", "Most gracious and loving Father, Jesus was found in the temple listening and asking questions; let us, O Lord, also be found daily seeking your rich words of wisdom and truth as proclaimed in Scripture. Amen. "]], "205": [["dateVerse", "Saturday, July 23", "Psalm 89:1–8", "Deuteronomy 32:44–33:17", "Luke 11:14–28"], ["watchD", "Do not fear the reproach of others, and do not be dismayed when they revile you. Isaiah 51:7"], ["docT", "Woe to you when all speak well of you. Luke 6:26"], ["prayer", "Lord over all, help us to remember that we are all sinners, saved only by your merciful grace. Help us to resolve in our own individual hearts a sincere desire and need to come before you in prayer. Amen."]], "206": [["info", "Tenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Lord, teach us to pray. Luke 11:1"], ["dateVerse", "Sunday, July 24", "Genesis 18:20–32", "Psalm 138", "Colossians 2:6–15,(16–19)", "Luke 11:1–13"], ["watchD", "The Lord frustrates the plans of the peoples. Psalm 33:10"], ["docT", "God raised Jesus from the dead and seated him at his right hand in the heavenly places, far above all rule and authority and power and dominion, and above every name that is named. Ephesians 1:20–21"], ["prayer", "Savior of the world, how comforting it is to know that you are our Savior at all times. Your name, Jesus, is worthy to be praised above all creation, for you, Lord, offered up yourself for the sins of all the world! Amen. "]], "207": [["dateVerse", "Monday, July 25", "Psalm 89:9–18", "Deuteronomy 33:18–34:12", "Luke 11:29–36"], ["watchD", "By the word of the Lord the heavens were made, and all their host by the breath of his mouth. Psalm 33:6"], ["docT", "God is not served by human hands, as if he needed anything. Rather, he himself gives everyone life and breath and everything else. Acts 17:25 (NIV)"], ["prayer", "Creator God, Lord of all the living, fill our hearts with the abundant warmth of your abounding love. Light up our contrite hearts so that we will remain faithful and ablaze for you until your return! Amen."]], "208": [["dateVerse", "Tuesday, July 26", "Psalm 89:19–29", "Joshua 1,2", "Luke 11:37–54"], ["watchD", "The Lord God helps me; therefore I have not been disgraced. Isaiah 50:7"], ["docT", "On him we have set our hope that he will rescue us again, as you also join in helping us by your prayers. 2 Corinthians 1:10–11"], ["prayer", "Lord Jesus, your word reminds us that no servant of yours will ever be put to shame. Help us to be mindful of your anointing upon us as we journey our pathways of life in this dark world. Amen."]], "209": [["dateVerse", "Wednesday, July 27", "Psalm 89:30–37", "Joshua 3,4", "Luke 12:1–12"], ["watchD", "Rise up, O Lord! Do not let mortals prevail. Psalm 9:19"], ["docT", "And will not God grant justice to his chosen ones who cry to him day and night? Luke 18:7"], ["prayer", "Redeeming Savior, Lord of all hope, we come before you with contrite hearts; hear our cries for healing and cleansing. Be our safe and secure Refuge; restore us to the wealth of our eternal salvation. Amen."]], "210": [["dateVerse", "Thursday, July 28", "Psalm 89:38–45", "Joshua 5,6", "Luke 12:13–21"], ["watchD", "Return to your God, hold fast to love and justice, and wait continually for your God. Hosea 12:6"], ["docT", "As God’s chosen ones, holy and beloved, clothe yourselves with compassion, kindness, humility, meekness, and patience. Colossians 3:12"], ["prayer", "Mighty God, as your chosen people, let the mind of Christ richly dwell in us. Grant us the power to surrender ourselves to your leading as we look beyond this earthly home toward our heavenly home. Amen. "]], "211": [["dateVerse", "Friday, July 29", "Psalm 89:46–52", "Joshua 7", "Luke 12:22–34"], ["watchD", "Consider then and realize how evil and bitter it is for you when you forsake the Lord your God and have no awe of me. Jeremiah 2:19 (NIV)"], ["docT", "Hold fast to what you have, so that no one may seize your crown. Revelation 3:11"], ["prayer", "Gracious Savior, teach us your ways so that we will never forget your greatness or go astray. Plant seeds of your holiness and righteousness within us so that we will yield good fruit for your kingdom. Amen. "]], "212": [["dateVerse", "Saturday, July 30", "Psalm 90", "Joshua 8:1–29", "Luke 12:35–48"], ["watchD", "He has told you, O mortal, what is good; and what does the Lord require of you but to do justice, and to love kindness, and to walk humbly with your God? Micah 6:8"], ["docT", "Jesus says, “For I have set you an example, that you also should do as I have done to you.” John 13:15"], ["prayer", "Master of our souls, be present with us, your feeble servants; lead us on your pathway. Refresh and renew our hearts and minds in service to you. We reach out to all those in the world around us! Amen."]], "213": [["info", "Eleventh Sunday after Pentecost"], ["watchO", "Watchword for the Week — Set your minds on things that are above, not on things that are on earth. Colossians 3:2"], ["dateVerse", "Sunday, July 31", "Ecclesiastes 1:2,12–14,2:18–23", "Psalm 49:1–12", "Colossians 3:1–11", "Luke 12:13–21"], ["watchD", "You shall not revile the deaf or put a stumbling-block before the blind; you shall fear your God. Leviticus 19:14 "], ["docT", "When you give a banquet, invite the poor, the crippled, the lame, and the blind. And you will be blessed, because they cannot repay you. Luke 14:13–14"], ["prayer", "Gracious God, your boundless love for us and your gifts of abundance far exceed our needs. Lord, make us servants of your bounty so that we will sow seeds of faith, hope, and love in the world around us! Amen. "]], "214": [["dateVerse", "Monday, August 1", "Psalm 91:1–8", "Joshua 8:30–9:27", "Luke 12:49–59"], ["watchD", "The Lord executes justice for the orphan and the widow, and loves the strangers, providing them food and clothing. You shall also love the stranger. Deuteronomy 10:18–19"], ["docT", "I was a stranger and you welcomed me. Matthew 25:35"], ["prayer", "Holy Father, thank you for our many blessings. Help us, Lord, to share our gifts and our talents with the world around us. Give us strength to use our hands and feet to show the love of Christ to our friends, neighbors, and coworkers. Amen."]], "215": [["dateVerse", "Tuesday, August 2", "Psalm 91:9–16", "Joshua 10:1–28", "Luke 13:1–17"], ["watchD", "One generation shall laud your works to another, and shall declare your mighty acts. Psalm 145:4"], ["docT", "Every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. Philippians 2:11"], ["prayer", "Gracious Savior, you have given us the blessings of minds to think and hearts to love. Lord, please forgive us our shortcomings, and strengthen us to do your will. Help us to remember to forgive, as we are forgiven. Amen."]], "216": [["dateVerse", "Wednesday, August 3", "Psalm 92:1–8", "Joshua 10:29–11:23", "Luke 13:18–30"], ["watchD", "He does what he wills with the host of heaven and the inhabitants of the earth. There is no one who can stay his hand or say to him, “What are you doing?” Daniel 4:35"], ["docT", "The kingdom of the world has become the kingdom of our Lord and of his Messiah, and he will reign forever and ever. Revelation 11:15"], ["prayer", "Dear Lord, Provider of our every need, help us to be grateful for all of your many gifts and remind us that we must also give back to you. Make us cheerful givers, Lord, generous with our gifts, sharing with those in need. Amen. "]], "217": [["dateVerse", "Thursday, August 4", "Psalm 92:9–15", "Joshua 12:1–13:7", "Luke 13:31–14:6"], ["watchD", "Seek the Lord while he may be found, call upon him while he is near. Isaiah 55:6"], ["docT", "See, now is the acceptable time; see, now is the day of salvation! 2 Corinthians 6:2"], ["prayer", "Dear Jesus, Friend to all, help us to mirror your ways. Lord, help us to understand that our actions, no matter how small, affect others. Jesus, we ask that you guide our ways and help us to follow your example to love others. Amen. "]], "218": [["dateVerse", "Friday, August 5", "Psalm 93", "Joshua 13:8–14:5", "Luke 14:7–24"], ["watchD", "The Lord gives strength to his people. Psalm 29:11 (NKJV)"], ["docT", "May the God of peace make you complete in everything good so that you may do his will. Hebrews 13:20–21"], ["prayer", "Holy Redeemer, we call to you in times of trouble and praise you in times of joy. Lord, help us to always be in your service, to stand fast to those in our lives. Lord, strengthen our congregations so that we may grow your kingdom on earth. Amen. "]], "219": [["dateVerse", "Saturday, August 6", "Psalm 94:1–11", "Joshua 14:6–15:19", "Luke 14:25–32"], ["watchD", "Steadfast love surrounds those who trust in the Lord. Psalm 32:10"], ["docT", "Ask and you will receive, so that your joy may be complete. John 16:24"], ["prayer", "Gracious Lord, you have given all for our sins. The world needs you; and we, your humble servants, are tasked with sharing your love and grace. Lord, help us not only to be grateful, but also to share your love with those we encounter. Amen. "]], "220": [["info", "Twelfth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Jesus says, “Do not be afraid, little \u2028flock, for it is your Father’s good pleasure to give you the kingdom.” Luke 12:32"], ["dateVerse", "Sunday, August 7", "Genesis 15:1–6", "Psalm 33:12–22", "Hebrews 11:1–3,8–16", "Luke 12:32–40"], ["watchD", "But where are your gods that you made for yourself? Let them come, if they can save you, in your time of trouble. Jeremiah 2:28"], ["docT", "You have one instructor, the Messiah. Matthew 23:10"], ["prayer", "O merciful Savior, thank you for your grace. Dear Lord, help us to live in joyful praise of all your mighty works. Help us to see your trustworthy hand at work in our lives, in our church, and in the world. Amen."]], "221": [["dateVerse", "Monday, August 8", "Psalm 94:12–23", "Joshua 15:20–63", "Luke 15:1–10"], ["watchD", "A king is not saved by his great army; a warrior is not delivered by his great strength. Psalm 33:16"], ["docT", "Now, that you have come to know God, or rather to be known by God, how can you turn back again to the weak and beggarly elemental spirits? Galatians 4:9"], ["prayer", "God, our Sustainer, help us to run the race you have set before us. Help us to live each day anew and look for new opportunities to share your truth with those in our lives who may not have heard the good news. Amen. "]], "222": [["dateVerse", "Tuesday, August 9", "Psalm 95", "Joshua 16,17", "Luke 15:11–32"], ["watchD", "Thus says the Lord, “How long will you refuse to humble yourself before me?” Exodus 10:3"], ["docT", "You say, “I am rich, I have prospered, and I need nothing.” You do not realize that you are wretched, pitiable, poor, blind, and naked. Revelation 3:17"], ["prayer", "Ruler of all creatures here below, let us see miracles in our common lives. You have provided food, shelter, warmth, health, friendship, and so much more. Help us to always remain humble in the sight of your glory. Amen. "]], "223": [["dateVerse", "Wednesday, August 10", "Psalm 96:1–9", "Joshua 18:1–19:9", "Luke 16:1–15"], ["watchD", "May all who seek you rejoice and be glad in you. Psalm 40:16"], ["docT", "Jesus said, “Zacchaeus, hurry and come down; for I must stay at your house today.” So he hurried down and was happy to welcome him. Luke 19:5–6"], ["prayer", "Welcoming Savior, you will never leave us or forsake us. Lord, help us to be loyal and faithful to those in our lives who are in need. Help us never to be separated from your love. Amen. "]], "224": [["dateVerse", "Thursday, August 11", "Psalm 96:10–13", "Joshua 19:10–39", "Luke 16:16–31"], ["watchD", "Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["docT", "When the Lord saw the widow, he had compassion for her and said to her, “Do not weep.” Then he came forward and touched the bier, and the bearers stood still. And he said, “Young man, I say to you, rise!” Luke 7:13–14"], ["prayer", "Loving Redeemer, you will never leave our side—we are never alone. You are our dear friend, Jesus. Lord, help us to be better friends to those who are suffering in our world. Amen. "]], "225": [["dateVerse", "Friday, August 12", "Psalm 97:1–6", "Joshua 19:40–21:8", "Luke 17:1–10"], ["watchD", "May the Lord our God incline our hearts to him, to walk in all his ways. 1 Kings 8:58<br/> <br/>Help me the slow of heart to move <br/>by some clear, winning word of love;<br/>teach me the wayward feet to stay,<br/>and guide them in the homeward way. (735)"], ["docT", "His divine power has given us everything needed for life and godliness. 2 Peter 1:3<br/> <br/>Not your merit brings God near,<br/>but God’s great compassion <br/>for the creature he fashioned. <br/>He will prove his faithfulness to you <br/>and in holy ways he will lead you. <br/>So to God give praise which is his due. (275*)"], ["prayer", "Kind Shepherd, you lead us to life-giving water, to paths of righteousness, and to everlasting life. Strengthen us so that we may bring others into the fold. Amen."], ["info", "* © 1994 by Brian Henkelmann"]], "226": [["dateVerse", "Saturday, August 13", "Psalm 97:7–12", "Joshua 21:9–45", "Luke 17:11–19"], ["specialVerse", "August Thirteenth Festival†", "Joshua 24:16–24", "Psalm 133", "1 John 4:1–13", "John 17:1–2,6–19"], ["watchD", "Who knows? God may relent and change his mind; he may turn from his fierce anger, so that we do not perish. Jonah 3:9"], ["docT", "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9"], ["prayer", "God of fire and flame, ignite in us a renewed spirit. Give us loud voices to sing your praise. Cleanse our hearts so that we may love deeply and forgive, as you have forgiven us. Amen."], ["info", "†At the conclusion of a Holy Communion service in the church at Berthelsdorf, Germany, on August 13, 1727, the residents of Herrnhut were united into the Renewed Brethren’s Church through the Spirit of God."]], "227": [["info", "Thirteenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Let us run with perseverance the race that is set before us, looking to Jesus the pioneer and perfecter of our faith. Hebrews 12:1–2"], ["dateVerse", "Sunday, August 14", "Jeremiah 23:23–29", "Psalm 82", "Hebrews 11:29–12:2", "Luke 12:49–56"], ["watchD", "All the earth worships you; they sing praises to you, sing praises to your name. Psalm 66:4"], ["docT", "The name of our Lord Jesus may be glorified in you. 2 Thessalonians 1:12"], ["prayer", "God, our Creator, mighty are your works. You breathed the universe to life, formed us in the womb, and have made a place for us at your right hand. Help us to delight in the knowledge that we are your children. Lord, help us to live in fellowship with one another, lifting each other up. Amen. "]], "228": [["dateVerse", "Monday, August 15", "Psalm 98", "Joshua 22", "Luke 17:20–25"], ["watchD", "The eyes of the Lord are in every place, keeping watch on the evil and the good. Proverbs 15:3"], ["docT", "The kingdom of heaven is like a net that was thrown into the sea and caught fish of every kind. Matthew 13:47"], ["prayer", "All-seeing Lord, you know all of our transgressions, and yet you still love us. God, forgive us our sins and draw us closer to you and give us strength. Guide us as we strive to love our neighbors, and do not let us yield to our weaknesses. Amen."]], "229": [["dateVerse", "Tuesday, August 16", "Psalm 99", "Joshua 23:1–24:13", "Luke 17:26–37"], ["watchD", "Then I myself will gather the remnant of my flock out of all the lands where I have driven them, and I will bring them back to their fold, and they shall be fruitful and multiply. Jeremiah 23:3"], ["docT", "Jesus said, “I have other sheep that do not belong to this fold. I must bring them also, and they will listen to my voice. So there will be one flock, one shepherd.” John 10:16"], ["prayer", "Loving Father, you are so good to us. You comfort us during times of loss, pain, and sickness. You freely give your grace even though we are so undeserving. Lord, help us to accept your love, and to share it with those in our lives. Amen. "]], "230": [["dateVerse", "Wednesday, August 17", "Psalm 100", "Joshua 24:14–Judges 1:16", "Luke 18:1–17"], ["watchD", "When the poor and needy seek water, and there is none, and their tongue is parched with thirst, I the Lord will answer them. Isaiah 41:17"], ["docT", "Let everyone who is thirsty come. Let anyone who wishes take the water of life as a gift. Revelation 22:17"], ["prayer", "Trusted Rock, faithful Savior, thank you for offering shelter to our weary souls. Thank you for healing our brokenness. You have called us by name. We hear your voice, and we will follow you. Amen. "]], "231": [["dateVerse", "Thursday, August 18", "Psalm 101", "Judges 1:17–2:23", "Luke 18:18–30"], ["watchD", "I will extol you, O Lord, among the nations, and sing praises to your name. Psalm 18:49"], ["docT", "Paul proclaimed the kingdom of God and taught about the Lord Jesus Christ—with all boldness and without hindrance! Acts 28:31 (NIV)"], ["prayer", "Light of the world, you are our beacon in the darkness. Lord, teach us to discern your will for our lives. Strengthen us to show others your truth. Guide us, Jesus, to love as you have loved. Amen. "]], "232": [["dateVerse", "Friday, August 19", "Psalm 102:1–11", "Judges 3", "Luke 18:31–43"], ["watchD", "Thus says the Lord, “Just as I have brought all this great disaster upon this people, so I will bring upon them all the good fortune that I now promise them.” Jeremiah 32:42"], ["docT", "Paul wrote: Our hope for you is unshaken; for we know that as you share in our sufferings, so also you share in our consolation. 2 Corinthians 1:7"], ["prayer", "Faithful Lord, we know you will not forsake us in times of trouble. We are crying. We are suffering. We are in need of your salvation. Let us remember to always seek you out. Come by here, Lord. Thanks be to God for his saving hand. Amen. "]], "233": [["dateVerse", "Saturday, August 20", "Psalm 102:12–22", "Judges 4", "Luke 19:1–10"], ["watchD", "Remember the wonderful works he has done, his miracles, and the judgments he has uttered. Psalm 105:5"], ["docT", "See what love the Father has given us, that we should be called children of God. 1 John 3:1"], ["prayer", "Holy Spirit, please come upon us—fill our lives with your peace. We are redeemed by your sacrifice. We are saved from our sins because of your love. God, help us to be all that you created us to be. Amen. "]], "234": [["info", "Fourteenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — The steadfast love of the Lord is from everlasting to everlasting on those who fear him. Psalm 103:17"], ["dateVerse", "Sunday, August 21†", "Isaiah 58:9b–14", "Psalm 103:1–8", "Hebrews 12:18–29", "Luke 13:10–17"], ["watchD", "How can a man be in the right before God? If one wished to dispute with him, he could not answer him once in a thousand times. Job 9:2–3 (NASB)"], ["docT", "By this we will know that we are from the truth and will reassure our hearts before him whenever our hearts condemn us; for God is greater than our hearts, and he knows everything. 1 John 3:19–20"], ["prayer", "Lord of sea and sky, hear our prayers. Forgive us as we stumble in our humanity. We turn away from you in our conceit. We suffer from our pride. Yet, with each heartbreak you are waiting for us. Thank you for never giving up on us. Amen. "], ["info", "†On this day in 1732, the first missionaries departed from Herrnhut bound for St. Thomas."]], "235": [["dateVerse", "Monday, August 22", "Psalm 102:23–28", "Judges 5", "Luke 19:11–27"], ["watchD", "Indeed, you are my lamp, O Lord, the Lord lightens my darkness. 2 Samuel 22:29"], ["docT", "Christ says, “I have come as light into the world, so that everyone who believes in me should not remain in the darkness.” John 12:46"], ["prayer", "Provider of wholeness, give our souls peace. Light our hearts’ flames yet again. You are the giver of all good and wonderful gifts. Let us never forget to use those blessings to glorify you. Amen. "]], "236": [["dateVerse", "Tuesday, August 23", "Psalm 103:1–5", "Judges 6", "Luke 19:28–44"], ["watchD", "Six days you shall labor and do all your work. But the seventh day is a sabbath to the Lord your God; you shall not do any work. Exodus 20:9–10"], ["docT", "The sabbath was made for humankind. Mark 2:27"], ["prayer", "Star of the morning, you have written on our hearts your divine salvation. You are the Lord of the ages; your love never ends. Your grace is perfectly eternal. Only you can grant us true rest. Let us be ever humbled by this amazing gift. Amen. "]], "237": [["dateVerse", "Wednesday, August 24", "Psalm 103:6–18", "Judges 7", "Luke 19:45–20:8"], ["watchD", "Sow with a view to righteousness, reap in accordance with kindness. Hosea 10:12 (NASB)"], ["docT", "Admonish the idlers, encourage the fainthearted, help the weak, be patient with all of them. See that none of you repays evil for evil, but always seek to do good to one another and to all. 1 Thessalonians 5:14–15"], ["prayer", "Merciful Redeemer, you always pick us up, no matter how far we fall. Jesus, you are worthy of our love and praises. Even though we continue to fail you, you never give up on us. Lord, help us to love others as deeply as you love us. Amen."]], "238": [["dateVerse", "Thursday, August 25", "Psalm 103:19–22", "Judges 8", "Luke 20:9–19"], ["watchD", "My lips will shout for joy when I sing praises to you; my soul also, which you have rescued. Psalm 71:23"], ["docT", "Rejoice that your names are written in heaven. Luke 10:20"], ["prayer", "Precious Lamb of God, let us never grow tired of singing your praises! You have set our feet upon your firm foundation. We are so blessed. Lord, open new ways to share your love to all those whom we touch, both near and far. In Jesus’ name, we pray. Amen. "]], "239": [["dateVerse", "Friday, August 26", "Psalm 104:1–9", "Judges 9:1–33", "Luke 20:20–26"], ["watchD", "Daniel was taken up out of the den, and no kind of harm was found on him, because he had trusted in his God. Daniel 6:23"], ["docT", "Do not abandon that confidence of yours; it brings a great reward. Hebrews 10:35"], ["prayer", "Constant Sustainer, your love is ever-present. It is always enough. Lord, guide us to live life from your fullness of grace, rather than from the emptiness the world offers. Alone, we are weak; together, we are strong. With you, nothing is impossible. Amen. "]], "240": [["dateVerse", "Saturday, August 27", "Psalm 104:10–18", "Judges 9:34–10:18", "Luke 20:27–40"], ["watchD", "Many of those who sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. Daniel 12:2"], ["docT", "God, through Jesus Christ, will judge the secret thoughts of all. Romans 2:16"], ["prayer", "Jesus, dear friend, you have provided a perfect example for us to follow. God, grant us strong hands, quick feet, and full hearts to carry your message to the ends of the earth. Amen. "]], "241": [["info", "Fifteenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Let mutual love continue. Hebrews 13:1"], ["dateVerse", "Sunday, August 28", "Proverbs 25:6–7", "Psalm 112", "Hebrews 13:1–8,15–16", "Luke 14:1,7–14"], ["watchD", "The Lord is my stronghold and my refuge, my Savior; you save me from violence. 2 Samuel 22:3"], ["docT", "We are afflicted in every way, but not crushed; perplexed, but not driven to despair; persecuted, but not forsaken; struck down, but not destroyed. 2 Corinthians 4:8–9"], ["prayer", "Brothers and sisters, abandon your fears and be joyful in the promise of the Lord! He has redeemed us, despite our unworthiness. This is such an amazing gift. God, help us to share this good news with the lost among us. Amen. "]], "242": [["dateVerse", "Monday, August 29", "Psalm 104:19–23", "Judges 11:1–27", "Luke 20:41–21:4"], ["watchD", "You shall not be partial to the poor or defer to the great. Leviticus 19:15"], ["docT", "Believers in our glorious Lord Jesus Christ must not show favoritism. James 2:1 (NIV)"], ["prayer", "O Great Provider, your love is a never-ending river. We pray that we are washed with your grace and that we never forget the blood you shed for us. As your children, teach us to walk in your ways. Amen. "]], "243": [["dateVerse", "Tuesday, August 30", "Psalm 104:24–30", "Judges 11:28–12:15", "Luke 21:5–28"], ["watchD", "Out of the ground the Lord God formed every animal of the field and every bird of the air, and brought them to the man. The man gave names to all. Genesis 2:19,20"], ["docT", "Are not five sparrows sold for two pennies? Yet not one of them is forgotten in God’s sight. Luke 12:6"], ["prayer", "Father, you have provided us with loving families. We are so grateful for these special people in our lives. Lord, please help us to reach out to those who are lonely and without family. Amen. "]], "244": [["dateVerse", "Wednesday, August 31", "Psalm 104:31–35", "Judges 13", "Luke 21:29–38"], ["watchD", "Out of the mouths of babes and infants you have founded a bulwark. Psalm 8:2"], ["docT", "Let the little children come to me; do not stop them; for it is to such as these that the kingdom of God belongs. Mark 10:14"], ["prayer", "Blessed Jesus, thank you for all the children in our lives. Give us strength to serve as models for them. Lord, present us with opportunities to teach them about your love and sacrifice. Amen. "]], "245": [["dateVerse", "Thursday, September 1", "Psalm 105:1–7", "Judges 14,15", "Luke 22:1–13"], ["watchD", "The Lord made us, and we are his; we are his people, and the sheep of his pasture. Psalm 100:3"], ["docT", "Once you were not a people, but now you are God’s people. 1 Peter 2:10"], ["prayer", "Good and gentle Shepherd, you claim us as your own. Even more, you call us by name. When we are rebellious and stray from the paths you’ve set before us, you seek us out and bring us back to the safety of the fold. Amen."]], "246": [["dateVerse", "Friday, September 2", "Psalm 105:8–15", "Judges 16,17", "Luke 22:14–23"], ["watchD", "Give generously to your needy brother and do so without a grudging heart. Deuteronomy 15:10 (NIV)"], ["docT", "If anyone gives even a cup of cold water to one of these little ones who is my disciple, truly I tell you, that person will certainly not lose their reward. Matthew 10:42 (NIV)"], ["prayer", "O Lord, give us compassion for the poor and powerless. Warm our cold hearts to reflect in them your love for all people. Teach us humility and forgive our feelings of self-importance. Remind us that all we have—even our next breath—comes from you. Amen."]], "247": [["dateVerse", "Saturday, September 3", "Psalm 105:16–22", "Judges 18", "Luke 22:24–38"], ["watchD", "You let people ride over our heads; we went through fire and through water; yet you have brought us out to a spacious place. Psalm 66:12"], ["docT", "Be alert at all times, praying that you may have the strength. Luke 21:36"], ["prayer", "O God, our Deliverer, rescue us from bondage that comes from our unwillingness to resist the world. Save us! Bring us out of the noisiness and clutter of our lives and into the quiet grace—the spacious place—of your peace. Amen."]], "248": [["info", "Sixteenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Choose life so that you and your descendants may live, loving the Lord your God, obeying him, and holding fast to him. Deuteronomy 30:19,20"], ["dateVerse", "Sunday, September 4", "Deuteronomy 30:15–20", "Psalm 1", "Philemon 1–21", "Luke 14:25–33"], ["watchD", "Our God is a God who saves; from the Sovereign Lord comes escape from death. Psalm 68:20 (NIV)"], ["docT", "That evening, at sunset, they brought to Jesus all who were sick or possessed with demons. Mark 1:32"], ["prayer", "Father, in our weakness, strengthen us. In our despair, comfort us. In our infirmity, heal us. Amen."]], "249": [["dateVerse", "Monday, September 5", "Psalm 105:23–36", "Judges 19", "Luke 22:39–51"], ["watchD", "Now there was a great wind, so strong that it was splitting mountains and breaking rocks in pieces before the Lord, but the Lord was not in the wind; and after the wind an earthquake, but the Lord was not in the earthquake; and after the earthquake a fire, but the Lord was not in the fire; and after the fire a sound of sheer silence. 1 Kings 19:11–12"], ["docT", "The Lord is the Spirit, and where the Spirit of the Lord is, there is freedom. 2 Corinthians 3:17"], ["prayer", "Spirit of the living God, fall afresh on us! Open our eyes to the needs of the poor; open our ears to the cries of the suffering; open our hearts to the pain of the lonely. On this day, God, make us blessings to your people. Amen."]], "250": [["dateVerse", "Tuesday, September 6", "Psalm 105:37–45", "Judges 20:1–31", "Luke 22:52–62"], ["watchD", "For a brief moment I abandoned you, but with great compassion I will gather you. Isaiah 54:7"], ["docT", "God, who is rich in mercy, out of the great love with which he loved us even when we were dead through our trespasses, made us alive together with Christ. Ephesians 2:4–5"], ["prayer", "Loving God, we are afflicted with the human condition: what we shouldn’t do, we do anyway; what we know is right, we neglect. The weight of our sin is suffocating. Yet, you still love us. We acknowledge that your love is unmerited; that we are unworthy; and that your grace is a gift. We accept this gift with gladness and praise! Amen."]], "251": [["dateVerse", "Wednesday, September 7", "Psalm 106:1–5", "Judges 20:32–21:25", "Luke 22:63–71"], ["watchD", "By his bruises we are healed. Isaiah 53:5"], ["docT", "Christ himself bore our sins in his body on the cross. 1 Peter 2:24"], ["prayer", "O Christ, you became vulnerable like us when you walked the lonely road to Calvary. Our sins became yours when you were raised upon the tree, and in your death we are redeemed. It is too awesome for us to understand, but may we persevere as we seek a deeper relationship with you. Amen."]], "252": [["dateVerse", "Thursday, September 8", "Psalm 106:6–12", "Ruth 1", "Luke 23:1–12"], ["watchD", "Proclaim, give praise, and say, “Save, O Lord, your people.” Jeremiah 31:7"], ["docT", "Jesus said to him, “Go home to your friends, and tell them how much the Lord has done for you, and what mercy he has shown you.” Mark 5:19"], ["prayer", "Precious Savior, your mercy is never-ending. Your blessings never cease. May our praises and testimonies to your goodness bring glory to your name and inspire in others a desire to know you, O giver of life. Amen."]], "253": [["dateVerse", "Friday, September 9", "Psalm 106:13–23", "Ruth 2,3", "Luke 23:13–31"], ["watchD", "When you pass through the waters, I will be with you; and through the rivers, they shall not overwhelm you; when you walk through fire you shall not be burned, and the flame shall not consume you. Isaiah 43:2"], ["docT", "Jesus woke up and rebuked the wind, and said to the sea, “Peace! Be still!” Then the wind ceased, and there was a dead calm. He said to them, “Why are you afraid?” Mark 4:39–40"], ["prayer", "Ever-present God, there is great comfort in knowing that when life is darkest, you are a light in the darkness with us. We forget that there is no detail of our lives that is too insignificant for you. May we be reminded that you care about all of our struggles; that what matters to us, matters to you. Amen."]], "254": [["dateVerse", "Saturday, September 10", "Psalm 106:24–31", "Ruth 4", "Luke 23:32–43"], ["watchD", "When deeds of iniquity overwhelm us, you forgive our transgressions. Psalm 65:3"], ["docT", "But the tax collector, standing far off, would not even look up to heaven, but was beating his breast and saying, “God, be merciful to me, a sinner!” Luke 18:13"], ["prayer", "Jesus, our righteous Judge, we know our sins and we are ashamed. Yet, you do not hold sin against us; rather, you accept our burdens as your own. Thank you for reaching into the pits of our sin and despair and for bringing us into your marvelous light. Amen."]], "255": [["info", "Seventeenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — The sacrifice acceptable to God is a broken spirit; a broken and contrite heart, O God, you will not despise. Psalm 51:17"], ["dateVerse", "Sunday, September 11", "Exodus 32:7–14", "Psalm 51:1–10", "1 Timothy 1:12–17", "Luke 15:1–10"], ["watchD", "You have been my help. Do not cast me off, do not forsake me, O God of my salvation! Psalm 27:9"], ["docT", "Jesus said, “This is the will of him who sent me, that I should lose nothing of all that he has given me.” John 6:39"], ["prayer", "Everlasting Father, we know that nothing can separate us from your love. As that love abides in us, may we abide in you so that we might bear fruit as your disciples. Amen."]], "256": [["dateVerse", "Monday, September 12", "Psalm 106:32–39", "1 Samuel 1:1–2:11", "Luke 23:44–56"], ["watchD", "I, the Lord, am the vineyard’s keeper; every moment I water it. I guard it night and day so that no one can harm it. Isaiah 27:3"], ["docT", "My Father is glorified by this, that you bear much fruit and become my disciples. John 15:8"], ["prayer", "Jesus, you call us to labor in your vineyard, the church. May we discern the tasks you have for us. Strengthen us for that work and use us in building your kingdom. In all things, may we glorify you. Amen."]], "257": [["dateVerse", "Tuesday, September 13", "Psalm 106:40–48", "1 Samuel 2:12–36", "Luke 24:1–12"], ["watchD", "Many are saying to me, “There is no help for you in God.” But you, O Lord, are a shield around me, my glory, and the one who lifts up my head. Psalm 3:2–3"], ["docT", "A leper came to Jesus begging him, and kneeling he said to him, “If you choose, you can make me clean.” Moved with pity, Jesus stretched out his hand and touched him, and said to him, “I do choose. Be made clean!” Mark 1:40–41"], ["prayer", "Healer, faithful Friend, have mercy upon us! You see us in all of our frailty; you know all of the ways that we are “unclean.” We acknowledge you as the Great Physician of our bodies and our souls. Hear our humble petition: Stretch out your hand and touch us! Amen."]], "258": [["dateVerse", "Wednesday, September 14", "Psalm 107:1–9", "1 Samuel 3,4", "Luke 24:13–27"], ["watchD", "But the Lord is the true God; he is the living God and the everlasting King. Jeremiah 10:10"], ["docT", "It is the King of kings and Lord of lords alone who has immortality and dwells in unapproachable light, whom no one has ever seen or can see; to him be honor and eternal dominion. 1 Timothy 6:15–16"], ["prayer", "Eternal King, we call you both Father and Friend; yet, you are beyond our imaginations in power and grandeur. We recognize you as the source of every blessing in our lives; nonetheless, we sometimes find ourselves saying, “I believe, but help me in my unbelief!” In our uncertainty, lead us to stronger faith. Remove our doubt and comfort us with your almighty hand. Amen."]], "259": [["dateVerse", "Thursday, September 15", "Psalm 107:10–16", "1 Samuel 5:1–7:1", "Luke 24:28–35"], ["watchD", "I will make an everlasting covenant with them, never to draw back from doing good to them. Jeremiah 32:40"], ["docT", "Having been justified by the grace of Jesus Christ, we might become heirs according to the hope of eternal life. Titus 3:7"], ["prayer", "Lamb of God, as you conquered sin and death, empower us to reject the temptations and culture of materialism that are rampant in our world. Thank you for your covenant of grace and the ultimate inheritance that awaits us. Amen."]], "260": [["info", "Ministers’ Covenant Day†"], ["dateVerse", "Friday, September 16", "Psalm 107:17–22", "1 Samuel 7:2–8:22", "Luke 24:36–53"], ["watchD", "They shall be my people and I will be their God, in faithfulness and in righteousness. Zechariah 8:8"], ["docT", "He is the head of the body, the church; he is the beginning, the firstborn from the dead. Colossians 1:18"], ["prayer", "Alpha and Omega, beginning and end, you have purchased us for yourself, as your church and as your bride. Help us, Lord, to live more righteously that we might become worthy of your favor and grace. Amen."], ["info", "†During a synodal conference in London, Jesus Christ was recognized as chief elder of the Brethren’s Church. The day is observed as a covenanting day for servants of the church."]], "261": [["dateVerse", "Saturday, September 17", "Psalm 107:23–32", "1 Samuel 9", "John 1:1–13"], ["watchD", "You who fear the Lord, trust in the Lord! \u2028Psalm 115:11"], ["docT", "Hope does not disappoint us, because God’s love has been poured into our hearts through the Holy Spirit that has been given to us. Romans 5:5"], ["prayer", "Eternal Father, we thank you for giving us your Holy Spirit: for the comfort it brings; for its guidance as we seek your truth; for its enlightenment as we read your word; for the changes in heart that it provokes. As we persevere in the course that you have set for us, we ask that you continue to pour out your Spirit that we might grow in our discipleship. Amen."]], "262": [["info", "Eighteenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — From the rising of the sun to its setting the name of the Lord is to be praised. Psalm 113:3"], ["dateVerse", "Sunday, September 18", "Amos 8:4–7", "Psalm 113", "1 Timothy 2:1–7", "Luke 16:1–13"], ["watchD", "The Lord said, “Do not be afraid, Abram. I am your shield, your very great reward.” Genesis 15:1 (NIV)"], ["docT", "Abraham, having patiently endured, obtained the promise. Hebrews 6:15"], ["prayer", "Sustainer of life, teach us to slow down; remind us that we can only live one day at a time. Teach us the value of walking a sure and steady course with you. Help us to draw nearer to you through the challenges we face and the struggles we endure. Amen."]], "263": [["dateVerse", "Monday, September 19", "Psalm 107:33–43", "1 Samuel 10", "John 1:14–28"], ["watchD", "My tongue shall tell of your righteousness and of your praise all day long. Psalm 35:28"], ["docT", "Anna worshiped with fasting and prayer night and day. At that moment she came, and began to praise God and to speak about the child to all who were looking for the redemption of Jerusalem. Luke 2:37–38"], ["prayer", "Blessed Redeemer, shore up our courage so that we can better share our faith. Give us confidence to tell your story. Provide the words to describe your grace. Increase our love as we live in your service. Amen."]], "264": [["dateVerse", "Tuesday, September 20", "Psalm 108:1–5", "1 Samuel 11,12", "John 1:29–42"], ["watchD", "You prepare a table before me in the presence of my enemies; you anoint my head with oil; my cup overflows. Psalm 23:5"], ["docT", "While Jesus was at Bethany in the house of Simon the leper, as he sat at the table, a woman came with an alabaster jar of very costly ointment of nard, and she broke open the jar and poured the ointment on his head. But some were there who said to one another in anger, “Why was the ointment wasted in this way?” But Jesus said, “Let her alone; why do you trouble her? She has performed a good service for me.” Mark 14:3–4,6"], ["prayer", "Loving Shepherd, you care for us in more ways than we can acknowledge; yet, our thanks is sometimes paltry. Lord, lead us to desire you more deeply, give to you more generously, and sacrifice more willingly. Amen."]], "265": [["dateVerse", "Wednesday, September 21", "Psalm 108:6–13", "1 Samuel 13", "John 1:43–51"], ["watchD", "When my spirit grows faint within me, it is you who watch over my way. Psalm 142:3 (NIV)"], ["docT", "Blessed be the God who consoles us in all our affliction, so that we may be able to console those who are in any affliction with the consolation with which we ourselves are consoled by God. 2 Corinthians 1:3–4"], ["prayer", "Omnipotent God, why do we wait so long to turn to you? Remind us that you are watching when we suffer physical weakness. You are aware of our spiritual struggles. You see our failures and know our disappointments and our sadness. But when we lean on your strong shoulders, you both console us and equip us to offer that same loving care to others. Amen."]], "266": [["dateVerse", "Thursday, September 22", "Psalm 109:1–7", "1 Samuel 14:1–40", "John 2:1–11"], ["watchD", "Am I my brother’s keeper? Genesis 4:9"], ["docT", "Let each of you look not to your own interests, but to the interests of others. Philippians 2:4"], ["prayer", "Heavenly Father, you call us to love our neighbors and to serve them. It is not always easy. Help us focus, Father, on our common ground rather than on the ways in which we are different. Remind us that we all are created in your image and that you made us to live in community. Amen."]], "267": [["dateVerse", "Friday, September 23", "Psalm 109:8–20", "1 Samuel 14:41–15:23", "John 2:12–25"], ["watchD", "If only you had paid attention to my commands, your peace would have been like a river, your well-being like the waves of the sea. \u2028Isaiah 48:18 (NIV)"], ["docT", "The kingdom of God is not food and drink but righteousness and peace and joy in the Holy Spirit. The one who thus serves Christ is acceptable to God and has human approval. Romans 14:17–18"], ["prayer", "Jesus, you have shown us the example of a suffering servant; yet, we admit to self-absorption. We are embarrassed by our fascination with the superficial and temporal. Guide us, Jesus, beyond our own needs and desires. Teach us that peace and joy come through service in your name and that our truest identities are found in you. Amen."]], "268": [["dateVerse", "Saturday, September 24", "Psalm 109:21–31", "1 Samuel 15:24–16:13", "John 3:1–15"], ["watchD", "Know then in your heart that as a parent disciplines a child so the Lord your God disciplines you. Deuteronomy 8:5"], ["docT", "Grow in the grace and knowledge of our Lord and Savior Jesus Christ. 2 Peter 3:18"], ["prayer", "Merciful God, it is never easy to give up control; we are rebellious and think that we know a better way. Lord, help us to learn that only when we put our trust in you, rather than in ourselves, can we grow in you and fulfill your will for our lives. Amen."]], "269": [["info", "Nineteenth Sunday after Pentecost"], ["watchO", "Watchword for the Week — There is great gain in godliness combined with contentment. 1 Timothy 6:6"], ["dateVerse", "Sunday, September 25", "Amos 6:1a,4–7", "Psalm 146", "1 Timothy 6:6–19", "Luke 16:19–31"], ["watchD", "I will cleanse them from all the guilt of their sin against me, and I will forgive. Jeremiah 33:8"], ["docT", "Our Savior Jesus Christ gave himself for us that he might redeem us from all iniquity and purify for himself a people of his own who are zealous for good deeds. Titus 2:13–14"], ["prayer", "Forgiving Savior, what solace we find in knowing that our scarlet sins are washed white as snow; in knowing that you not only forgive but that you also forget. The weight of our sin is great; yet, you have taken it from us with your own life so that we might live. We praise you and thank you for this greatest of all gifts! Amen."]], "270": [["dateVerse", "Monday, September 26", "Psalm 110", "1 Samuel 16:14–17:31", "John 3:16–26"], ["watchD", "All that the Lord has spoken we will do, and we will be obedient. Exodus 24:7"], ["docT", "Do not lag in zeal, be ardent in spirit, serve the Lord. Romans 12:11"], ["prayer", "Glorious Lord, thank you for opportunities to serve. Renew our strength that we might work energetically and with gladness. May our faithfulness be a testimony to your goodness and grace. Amen."]], "271": [["dateVerse", "Tuesday, September 27", "Psalm 111", "1 Samuel 17:32–58", "John 3:27–36"], ["watchD", "The Lord said, “My presence will go with you, and I will give you rest.” Exodus 33:14"], ["docT", "Since, then, we have such a hope, we act with great boldness. 2 Corinthians 3:12"], ["prayer", "Father, your word is consistent in proclaiming your abiding presence and faithfulness. We believe this but sometimes we are hesitant, tentative in our actions. On this day, may we feel your hand gently pushing us, moving us to greater confidence in letting our light shine as we serve you and our world. Amen."]], "272": [["dateVerse", "Wednesday, September 28", "Psalm 112", "1 Samuel 18:1–19:7", "John 4:1–26"], ["watchD", "His dominion is an everlasting dominion that will not pass away, and his kingdom is one that will never be destroyed. Daniel 7:14 (NIV)"], ["docT", "God was pleased to have all his fullness dwell in Christ, and through him to reconcile to himself all things, whether things on earth or things in heaven, by making peace through his blood, shed on the cross. Colossians 1:19–20 (NIV)"], ["prayer", "Sovereign God, you have shown us your face through the life of your Son. Through his sacrifice, you have reconciled us from sin and back into your favor. Thank you, Gracious Father, for your marvelous plan of hope and salvation. Amen."]], "273": [["dateVerse", "Thursday, September 29", "Psalm 113", "1 Samuel 19:8–20:17", "John 4:27–38"], ["watchD", "The Lord says, “Why do you spend your money for that which is not bread, and your labor for that which does not satisfy? Listen carefully to me, and eat what is good.” Isaiah 55:2"], ["docT", "Do not work for the food that perishes, but for the food that endures for eternal life, which the Son of Man will give you. John 6:27"], ["prayer", "Bread of life and living Water, we feed on your word and the life it reveals. Fill us, complete us, save us! Amen."]], "274": [["dateVerse", "Friday, September 30", "Psalm 114", "1 Samuel 20:18–21:9", "John 4:39–42"], ["watchD", "O Lord, do not rebuke me in your anger, or discipline me in your wrath. Psalm 6:1"], ["docT", "Who is to condemn? It is Christ Jesus, who died, yes, who was raised, who is at the right hand of God, who indeed intercedes for us. Romans 8:34"], ["prayer", "O Christ our Intercessor, have mercy on us! You see beyond our selfish and childish ways. With all of our faults and imperfections, you still love us. May we be as forgiving and merciful to others as you are to us. Amen."]], "275": [["dateVerse", "Saturday, October 1", "Psalm 115:1–8", "1 Samuel 21:10–22:23", "John 4:43–54"], ["watchD", "I hold my life in my hand continually, but I do not forget your law. Psalm 119:109"], ["docT", "Lord, to whom can we go? You have the words of eternal life. John 6:68"], ["prayer", "Christ, living Word made flesh, we profess that in your word we find truth, and your truth we will not forget. O Word of life eternal, only in you can we truly live. Come O Christ, come O Life, and fill our souls again! Amen."]], "276": [["info", "Twentieth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Commit your way to the Lord; trust in him, and he will act. Psalm 37:5"], ["dateVerse", "Sunday, October 2", "Habbakuk 1:1–4,2:1–4", "Psalm 37:1–9", "2 Timothy 1:1–14", "Luke 17:5–10"], ["watchD", "All the ends of the earth have seen the salvation of our God. Psalm 98:3 (NIV)"], ["docT", "Jesus said, “Is a lamp brought to be put under a basket or under a bed? Is it not to be set on a lampstand?” Mark 4:21 (NKJV)"], ["prayer", "Your salvation, O Lord, stretches as far as the east is to the west, and the north is to the south. There is no corner, depth, or height where you will not go to seek us out. Mighty God, to you be all glory forever. Amen."]], "277": [["dateVerse", "Monday, October 3", "Psalm 115:9–18", "1 Samuel 23", "John 5:1–15"], ["watchD", "Cast your burden on the Lord, and he will sustain you. Psalm 55:22"], ["docT", "Do not worry about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. Philippians 4:6"], ["prayer", "Sustainer, today we cling to the everlasting hope found in you. Whatever may come our way, we will boldly profess that we serve a God who provides exceedingly and abundantly, above all that we could ever hope for or imagine. Amen."]], "278": [["dateVerse", "Tuesday, October 4", "Psalm 116:1–7", "1 Samuel 24:1–25:17", "John 5:16–30"], ["watchD", "In God’s hand are the depths of the earth; the heights of the mountains are his also. Psalm 95:4"], ["docT", "The God who made the world and everything in it, he who is Lord of heaven and earth, does not live in shrines made by human hands. Acts 17:24"], ["prayer", "Creator, not made or dependent upon human hands, how blessed are we that you considered us more than the dust that we are? Father of the universe, how marvelous are the works of your hand; we are awestruck by the limitlessness of your love. Hallelujah! Amen."]], "279": [["dateVerse", "Wednesday, October 5", "Psalm 116:8–14", "1 Samuel 25:18–44", "John 5:31–47"], ["watchD", "If anyone secretly entices you—even if it is your brother, your father’s son or your mother’s son, or your own son or daughter, or the wife you embrace, or your most intimate friend—saying, “Let us go worship other gods,” you must not yield to or heed any such persons. Deuteronomy 13:6,8"], ["docT", "If anyone is detected in a transgression, you who have received the Spirit should restore such a one in a spirit of gentleness. Take care that you yourselves are not tempted. Galatians 6:1"], ["prayer", "You, O Lord, are the only living God, the only sovereign Lord. Rule our hearts, minds, and souls. In us, through us, wherever we may go, command our souls forevermore. Amen."]], "280": [["dateVerse", "Thursday, October 6", "Psalm 116:15–19", "1 Samuel 26,27", "John 6:1–15"], ["watchD", "All deeds are right in the sight of the doer, but the Lord weighs the heart. Proverbs 21:2"], ["docT", "“All things are lawful for me,” but not all things are beneficial. “All things are lawful for me,” but I will not be dominated by anything. 1 Corinthians 6:12"], ["prayer", "Hearken our ears, Elohim, to hear you calling us and to know and live your will—not the will of the world and not of our flesh. Search and purify our hearts, dear Emmanuel. You are the only living God, and we serve only you. Amen. "]], "281": [["dateVerse", "Friday, October 7", "Psalm 117", "1 Samuel 28,29", "John 6:16–24"], ["watchD", "After that whole generation had been gathered to their ancestors, another generation grew up, who knew neither the Lord nor what he had done for Israel. Judges 2:10 (NIV)"], ["docT", "Simeon prayed: “My eyes have seen your salvation, which you have prepared in the presence of all peoples, a light for revelation to the Gentiles and for glory to your people Israel.” Luke 2:30–32"], ["prayer", "Peel the scales from our eyes, remove the blockages from our ears and hearts, O Lord, so that we may receive you. Let not this day pass without us drawing nigh unto you, our Savior, Redeemer, and Sustainer. Amen."]], "282": [["dateVerse", "Saturday, October 8", "Psalm 118:1–9", "1 Samuel 30,31", "John 6:25–42"], ["watchD", "The unfolding of your words gives light; it imparts understanding to the simple. Psalm 119:130"], ["docT", "Whatever was written in former days was written for our instruction, so that by steadfastness and by the encouragement of the Scriptures we might have hope. Romans 15:4"], ["prayer", "Word of life, Word made flesh, today we declare that, indeed, you are a lamp unto our feet and a light unto our path. In you, living Word, is the blueprint for all aspects of life’s journey. Order our steps in your word today. Amen."]], "283": [["info", "Twenty-First Sunday after Pentecost"], ["watchO", "Watchword for the Week — If we have died with him, we will also live with him. 2 Timothy 2:11"], ["dateVerse", "Sunday, October 9", "2 Kings 5:1–3,7–15c", "Psalm 111", "2 Timothy 2:8–15", "Luke 17:11–19"], ["watchD", "The Lord said, “I do forgive, just as you have asked.” Numbers 14:20"], ["docT", "Just as the Lord has forgiven you, so you also must forgive. Colossians 3:13"], ["prayer", "Seventy times seven you said, Lord; yet, you forgive us our sins beyond this measure daily. The praise and thanksgiving we offer you cannot cover your depth of forgiveness. Thus, O Lord, let us go and do for others as you have done for us. Amen."]], "284": [["dateVerse", "Monday, October 10", "Psalm 118:10–14", "2 Samuel 1", "John 6:43–51"], ["watchD", "The Lord is righteous. He loves righteousness. Psalm 11:7 (NASB)"], ["docT", "Live as children of light—for the fruit of the light is found in all that is good and right and true. Ephesians 5:8–9"], ["prayer", "Good and Righteous God, lead us to walk, talk, and be within your righteous goodness. Let your light so shine in and through us as a testimony to who you are; the true and living God! Amen."]], "285": [["dateVerse", "Tuesday, October 11", "Psalm 118:15–21", "2 Samuel 2", "John 6:52–59"], ["watchD", "I will recount the gracious deeds of the Lord, the praiseworthy acts of the Lord, because of all that the Lord has done for us. Isaiah 63:7"], ["docT", "Indeed you have tasted that the Lord is good. 1 Peter 2:3"], ["prayer", "Alleluia, alleluia, the highest of praise be to you, Christ Jesus, King of kings and Lord of lords! Because of your blood shed and body broken for our sake, we have a foretaste of the goodness of your kingdom. Amen."]], "286": [["dateVerse", "Wednesday, October 12", "Psalm 118:22–29", "2 Samuel 3:1–34", "John 6:60–71"], ["watchD", "I myself will search for my sheep and look after them. Ezekiel 34:11 (NIV)"], ["docT", "As Jesus passed along the Sea of Galilee, he saw Simon and his brother Andrew casting a net into the sea—for they were fishermen. And Jesus said to them, “Follow me.” Mark 1:16–17"], ["prayer", "Christ, the Good Shepherd, tune our ears to discern your voice amongst so many wolves masquerading as you. Help us to hear your voice beckoning us to follow you, and grant us courage in faith to drop our nets and go wherever you lead. Amen."]], "287": [["dateVerse", "Thursday, October 13", "Psalm 119:1–8", "2 Samuel 3:35–5:16", "John 7:1–13"], ["watchD", "I am the Lord, that is my name; my glory I give to no other, nor my praise to idols. Isaiah 42:8"], ["docT", "Even though there may be so-called gods—for us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:5–6"], ["prayer", "We declare and decree that you, O Lord Jesus Christ, are the great I Am. You are the Alpha and the Omega, the beginning and the end. You are the Creator, the source and sustenance of life and the only God we praise! Amen."]], "288": [["dateVerse", "Friday, October 14", "Psalm 119:9–16", "2 Samuel 5:17–6:23", "John 7:14–24"], ["watchD", "My people have committed two evils: they have forsaken me, the fountain of living water, and dug out cisterns for themselves, cracked cisterns that can hold no water. Jeremiah 2:13"], ["docT", "The woman said to him, “Sir, you have no bucket, and the well is deep. Where do you get that living water?” John 4:11"], ["prayer", "Like the woman at the well, we seldom realize that our souls are utterly dry, deprived of your living water, so wallowed in the sins that squeeze your breath from our mortal beings, cisterns become normal. Purge us, Lord, and fill us with your living water! Amen."]], "289": [["dateVerse", "Saturday, October 15", "Psalm 119:17–24", "2 Samuel 7", "John 7:25–44"], ["watchD", "In your days I will speak the word and fulfill it, says the Lord God. Ezekiel 12:25"], ["docT", "Peter wrote: We did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we had been eyewitnesses of his majesty. 2 Peter 1:16"], ["prayer", "We realize that the time of your return draws near, O Lord. While there is still time, however, we pray that your Holy Spirit will prepare our hearts. We pray also that, as you lead, we will continue to bring your good news to all people. Amen."]], "290": [["info", "Twenty-Second Sunday after Pentecost"], ["watchO", "Watchword for the Week — Proclaim the message; be persistent whether the time is favorable or unfavorable; convince, rebuke, and encourage, with the utmost patience in teaching. 2 Timothy 4:2"], ["dateVerse", "Sunday, October 16", "Genesis 32:22–31", "Psalm 121", "2 Timothy 3:14–4:5", "Luke 18:1–8"], ["watchD", "Fools say in their hearts, “There is no God.” Psalm 14:1"], ["docT", "This is eternal life, that they may know you, the only true God, and Jesus Christ whom you have sent. John 17:3"], ["prayer", "Wise Jehovah, time and time again you remind us that even your foolishness is wiser than our wisdom. Though in our humanity we cannot fully comprehend all that you are and all that you do, when we gaze upon creation we know that you alone are God Almighty. Amen."]], "291": [["dateVerse", "Monday, October 17", "Psalm 119:25–32", "2 Samuel 8,9", "John 7:45–52"], ["watchD", "His greatness will reach to the ends of the earth. Micah 5:4 (NIV)"], ["docT", "Your kingdom come. Matthew 6:10"], ["prayer", "Father, let your holy will be done on earth as it is in heaven. May your will for our lives manifest so that in all that we do and say we bring glory to your name. Amen."]], "292": [["dateVerse", "Tuesday, October 18", "Psalm 119:33–40", "2 Samuel 10,11", "John 8:1–11"], ["watchD", "You are my witnesses, says the Lord. Isaiah 43:10"], ["docT", "We do not proclaim ourselves; we proclaim Jesus Christ as Lord. 2 Corinthians 4:5"], ["prayer", "Let your light in us shine before all people, so that they may see our good works and glorify you, the living God. You are worthy of all praise. Out of love, you gave your life for us. We will proclaim you to the world. Amen."]], "293": [["dateVerse", "Wednesday, October 19", "Psalm 119:41–48", "2 Samuel 12", "John 8:12–30"], ["watchD", "Your steadfast love, O Lord, endures forever. Do not forsake the work of your hands. Psalm 138:8"], ["docT", "For we are what he has made us, created in Christ Jesus for good works, which God prepared beforehand to be our way of life. Ephesians 2:10"], ["prayer", "Christ you are the Vine and we are the branches; apart from you we cannot bear good fruit. Source of goodness, help us to stay connected to you, bearing fruit that testifies to righteousness. Amen."]], "294": [["dateVerse", "Thursday, October 20", "Psalm 119:49–56", "2 Samuel 13:1–33", "John 8:31–41"], ["watchD", "Be silent before the Lord God! For the day of the Lord is at hand. Zephaniah 1:7"], ["docT", "Be serious and discipline yourselves for the sake of your prayers. Above all, maintain constant love for one another. 1 Peter 4:7–8"], ["prayer", "Let us take off our shoes in the presence of your holiness. Let us sit in silence and listen to your voice. Let us bask in your glory as we are being refilled to be your loving hands and feet until you return. Amen!"]], "295": [["dateVerse", "Friday, October 21", "Psalm 119:57–64", "2 Samuel 13:34–14:33", "John 8:42–59"], ["watchD", "The Lord says, “I will look with favor upon you and make you fruitful and multiply you; and I will maintain my covenant with you.” Leviticus 26:9"], ["docT", "You are God’s field, God’s building. 1 Corinthians 3:9"], ["prayer", "We are the clay and you are the Potter. We are the beauty of the works of your hand, fearfully and wonderfully made in your image. Continue to refine us to courageously share your good news with all the world. Amen."]], "296": [["dateVerse", "Saturday, October 22", "Psalm 119:65–72", "2 Samuel 15:1–29", "John 9:1–12"], ["watchD", "“From the rising of the sun to its setting my name is great among the nations,” says the Lord. Malachi 1:11"], ["docT", "Many will come from the east and the west, and will take their places at the feast with Abraham, Isaac, and Jacob in the kingdom of heaven. Matthew 8:11 (NIV)"], ["prayer", "Wonderful Counselor, the mighty God, the everlasting Father, the Prince of peace, O what a foretaste you have given us of your heavenly feast. ‘Til we shall recline at your great banquet table, continue to nourish our souls with your living bread and wine. Amen."]], "297": [["info", "Twenty-Third Sunday after Pentecost"], ["watchO", "Watchword for the Week — Jesus says, “All who exalt themselves will be humbled, but all who humble themselves will be exalted.” Luke 18:14"], ["dateVerse", "Sunday, October 23", "Jeremiah 14:7–10,19–22", "Psalm 84:1–7", "2 Timothy 4:6–8,16–18", "Luke 18:9–14"], ["watchD", "O that you would tear open the heavens and come down! Isaiah 64:1"], ["docT", "They will see “the Son of Man coming in clouds” with great power and glory. Mark 13:26"], ["prayer", "Holy of Holies are you, Lord. Though you are the Lord of all creation, you humbly assumed the lowliest of duties for our sake. We give you thanks for the ways you meet us each day; until we shall meet face-to-face. Amen."]], "298": [["dateVerse", "Monday, October 24", "Psalm 119:73–80", "2 Samuel 15:30–16:23", "John 9:13–34"], ["watchD", "I will both lie down and sleep in peace; for you alone, O Lord, make me lie down in safety. Psalm 4:8"], ["docT", "He is our peace. Ephesians 2:14"], ["prayer", "We are grateful for your peace which surpasses all understanding. Peace of Christ, comfort us amidst the storms of life; intercede on our behalf, grant us wisdom, and lead us in all your truth. Alleluia to the Source of peace. Amen."]], "299": [["dateVerse", "Tuesday, October 25", "Psalm 119:81–88", "2 Samuel 17", "John 9:35–41"], ["watchD", "See, the former things have come to pass, and new things I now declare; before they spring forth, I tell you of them. Isaiah 42:9"], ["docT", "The mystery from which true godliness springs is great: he appeared in the flesh, was vindicated by the Spirit, was seen by angels, was preached among the nations, was believed on in the world, was taken up in glory. 1 Timothy 3:16 (NIV)"], ["prayer", "Lord, we believe that you are excited to share your wonders with us, so that we, together, may marvel at your infinite power and the beauty of your hands. Help us to believe the unbelievable and to not be ashamed to be perceived as fools. Amen."]], "300": [["dateVerse", "Wednesday, October 26", "Psalm 119:89–96", "2 Samuel 18:1–30", "John 10:1–10"], ["watchD", "Thus says the Lord, “I remember the devotion of your youth, your love as a bride, how you followed me in the wilderness, in a land not sown.” Jeremiah 2:2"], ["docT", "Let us hold fast to the confession of our hope without wavering, for he who has promised is faithful. Hebrews 10:23"], ["prayer", "As the days and years edge on, help us, Lord, to not be weary and to not faint. Let our zeal for you never run dry. Daily renew us by the power of your Spirit. Let us by your power and strength finish the race. Amen."]], "301": [["dateVerse", "Thursday, October 27", "Psalm 119:97–104", "2 Samuel 18:31–19:30", "John 10:11–21"], ["watchD", "Do not devise evil in your hearts against one another. Zechariah 7:10"], ["docT", "The eye cannot say to the hand, “I have no need of you,” nor again the head to the feet, “I have no need of you.” On the contrary, the members of the body that seem to be weaker are indispensable. 1 Corinthians 12:21–22"], ["prayer", "We command our beings to submit to your authority, Lord Jesus. Where there is evil, blot it out and fill those spaces with your Holy Spirit. Fill us to be fruitful members of your body, and thereby equip others to be likewise. Amen. "]], "302": [["dateVerse", "Friday, October 28", "Psalm 119:105–112", "2 Samuel 19:31–20:26", "John 10:22–33"], ["watchD", "Seek the Lord and his strength; seek his presence continually. Psalm 105:4"], ["docT", "Lord, teach us to pray. Luke 11:1"], ["prayer", "Humbly we come before your throne of grace, O Lord, seeking all that you are, O God. For without you we are but dust. Silence now our hearts and minds in order that we might hear you even in marrow. Amen."]], "303": [["dateVerse", "Saturday, October 29", "Psalm 119:113–120", "2 Samuel 21", "John 10:34–42"], ["watchD", "Gideon said, “I will not rule over you; the Lord will rule over you.” Judges 8:23"], ["docT", "Jesus said, “You know that among the Gentiles those whom they recognize as their rulers lord it over them, and their great ones are tyrants over them. But it is not so among you; but whoever wishes to become great among you must be your servant.” Mark 10:42–43"], ["prayer", "We have one Lord, who is the only true and living God, in Jesus Christ. We rebuke anything that seeks to take the place of Christ in our lives. Jesus, you are the solid rock on which we stand; all other ground is sinking sand. Amen."]], "304": [["info", "Twenty-Fourth Sunday after Pentecost"], ["watchO", "Watchword for the Week — Jesus says, “For the Son of Man came to seek out and to save the lost.” Luke 19:10"], ["dateVerse", "Sunday, October 30", "Isaiah 1:10–18", "Psalm 32:1–7", "2 Thessalonians 1:1–4,11–12", "Luke 19:1–10"], ["watchD", "The hope of the righteous ends in gladness. Proverbs 10:28"], ["docT", "You also must be patient. Strengthen your hearts, for the coming of the Lord is near. James 5:8"], ["prayer", "With each waking day, great I Am, purify and guard our hearts. Clothe us in your armor from the crowns of our heads to the soles of our feet. Until you return, may we be unshaken, unmoved by every false wind. In Jesus’ name we pray. Amen."]], "305": [["info", "Reformation Day"], ["dateVerse", "Monday, October 31", "Psalm 119:121–128", "2 Samuel 22:1–25", "John 11:1–16"], ["watchD", "Shout aloud and sing for joy, people of Zion, for great is the Holy One of Israel among you. Isaiah 12:6 (NIV)"], ["docT", "God did not withhold his own Son, but gave him up for all of us, will he not with him also give us everything else? Romans 8:32"], ["prayer", "Hosanna, the love of God made flesh. Hosanna, God’s agape, highest of praise, be unto you. May your praise never cease from our lips. May we glorify you in our going and our coming, in our good times and bad. Alleluia! Amen."]], "306": [["info", "All Saints Day"], ["watchO", "Watchword for All Saints Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Tuesday, November 1", "Psalm 119:129–136", "2 Samuel 22:26–23:17", "John 11:17–30"], ["specialVerse", "All Saints Day", "Daniel 7:1–3,15–18", "Psalm 149", "Ephesians 1:11–23", "Luke 6:20–31"], ["watchD", "He stands at the right hand of the needy, to save them from those who would condemn them to death. Psalm 109:31"], ["docT", "Jesus is not ashamed to call them brothers and sisters. Hebrews 2:11"], ["prayer", "Loving God, we thank you for the saints in our lives, for those who have entered into your more immediate presence, and for those still with us. For all the saints we give you thanks, in Christ’s name. Amen."]], "307": [["dateVerse", "Wednesday, November 2", "Psalm 119:137–144", "2 Samuel 23:18–24:25", "John 11:31–44"], ["watchD", "By his knowledge my righteous servant will justify the many, and he will bear their iniquities. Isaiah 53:11 (NIV)"], ["docT", "The Son of Man came not to be served but to serve, and to give his life a ransom for many. Mark 10:45"], ["prayer", "Jesus, help us to have a spirit of service instead of one of being served. Guide us to help those who need you. Use us today as the hands and feet of your kingdom. Amen."]], "308": [["dateVerse", "Thursday, November 3", "Psalm 119:145–152", "1 Kings 1:1–27", "John 11:45–57"], ["watchD", "The Lord said to me, “You are my servant, Israel, in whom I will be glorified.” Isaiah 49:3"], ["docT", "God has not rejected his people whom he foreknew. Romans 11:2"], ["prayer", "God of love, thank you for not rejecting us; thank you for loving us as we are, for being who you are, and for saving us from our transgressions. In Jesus’ name we pray. Amen."]], "309": [["dateVerse", "Friday, November 4", "Psalm 119:153–160", "1 Kings 1:28–53", "John 12:1–11"], ["watchD", "You who seek God, let your hearts revive. Psalm 69:32"], ["docT", "Let us run with perseverance the race that is set before us, looking to Jesus the pioneer and perfecter of our faith. Hebrews 12:1–2 "], ["prayer", "Most holy God, keep us vigilant in seeking you. Give us the strength and faith to trust wholly in you and to keep our eyes fixed upon you as we run the race that is perfect in your will. All glory is yours, O Father. In Jesus’ name we pray. Amen.  "]], "310": [["dateVerse", "Saturday, November 5", "Psalm 119:161–168", "1 Kings 2:1–38", "John 12:12–19"], ["watchD", "God says, “O that my people would listen to me.” Psalm 81:13"], ["docT", "Continue securely established and steadfast in the faith, without shifting from the hope promised by the gospel that you heard. Colossians 1:23"], ["prayer", "Gracious Lord, as we go about this day we pray that you will be with us and help us to tell your story of glory in all that we do and say. In Jesus’ name we pray. Amen."]], "311": [["info", "Twenty-Fifth Sunday after Pentecost"], ["watchO", "Watchword for the Week — For I know that my Redeemer lives, and that at the last he will stand upon the earth. Job 19:25"], ["dateVerse", "Sunday, November 6", "Job 19:23–27a", "Psalm 17:1–9", "2 Thessalonians 2:1–5,13–17", "Luke 20:27–38"], ["watchD", "For God will bring every deed into judgment, including every secret thing, whether good or evil. Ecclesiastes 12:14"], ["docT", "When the Son of Man comes, will he find faith on earth? Luke 18:8"], ["prayer", "Father, in all of our transgressions you show mercy; you know each of us as we are. We prepare for you until you return. Amen."]], "312": [["dateVerse", "Monday, November 7", "Psalm 119:169–176", "1 Kings 2:39–3:28", "John 12:20–36"], ["watchD", "I am the Lord; I act with steadfast love, justice, and righteousness in the earth. Jeremiah 9:24"], ["docT", "Let everyone who calls on the name of the Lord turn away from wickedness. 2 Timothy 2:19"], ["prayer", "Great I Am, as we enter into this day we pray that you will keep us true in word, thought, and deed. Be with us and let us forever be reflections of your love. In Jesus’ name we pray. Amen. "]], "313": [["dateVerse", "Tuesday, November 8", "Psalm 120", "1 Kings 4:1–28", "John 12:37–50"], ["watchD", "I heard the voice of the Lord saying, “Whom shall I send, and who will go for us?” And I said, “Here am I; send me!” Isaiah 6:8"], ["docT", "To each one the manifestation of the Spirit is given for the common good. 1 Corinthians 12:7 (NIV)"], ["prayer", "Father, pour out your Spirit upon us so that we may be of you. Make our hearts holy, and send us to be your hands in this world. In your Spirit we pray. Amen."]], "314": [["dateVerse", "Wednesday, November 9", "Psalm 121", "1 Kings 4:29–5:18", "John 13:1–17"], ["watchD", "When your judgments are in the earth, the inhabitants of the world learn righteousness. Isaiah 26:9"], ["docT", "John wrote: I saw heaven opened, and there was a white horse! Its rider is called Faithful and True, and in righteousness he judges and makes war. Revelation 19:11"], ["prayer", "Lord, as we await your coming in sure and certain hope, keep us ever focused in faith and love until you return from above. In your name we pray. Amen."]], "315": [["dateVerse", "Thursday, November 10", "Psalm 122", "1 Kings 6", "John 13:18–30"], ["watchD", "God, I think of you on my bed, and meditate on you in the watches of the night. Psalm 63:6"], ["docT", "O the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how inscrutable his ways! Romans 11:33–34"], ["prayer", "Father, our trust and rest lie in you. We look to you for guidance in what you would have us do. Be our guide, O Lord. Amen."]], "316": [["dateVerse", "Friday, November 11", "Psalm 123", "1 Kings 7:1–33", "John 13:31–38"], ["watchD", "I delight in the way of your decrees as much as in all riches. Psalm 119:14"], ["docT", "The kingdom of heaven is like a merchant in search of fine pearls; on finding one pearl of great value, he went and sold all that he had and bought it. Matthew 13:45–46"], ["prayer", "Lord, help us to know that your kingdom is worth more than all the riches of the earth. Let the material world around us not dissuade us from the ultimate treasure of your glory. Amen. "]], "317": [["dateVerse", "Saturday, November 12", "Psalm 124", "1 Kings 7:34–8:16", "John 14:1–14"], ["watchD", "In the midst of the congregation I will praise you. Psalm 22:22"], ["docT", "May the God of steadfastness and encouragement grant you to live in harmony with one another, in accordance with Christ Jesus, so that together you may with one voice glorify the God and Father of our Lord Jesus Christ. Romans 15:5–6"], ["prayer", "Father, we will praise you, O Lord among the nations; we will sing unto you among the heavens. Glorious, everlasting are you, our God! Amen."]], "318": [["info", "Twenty-Sixth Sunday after Pentecost\u2028Chief Elder Festival"], ["watchO", "Watchword for the Week — Brothers and sisters, do not be weary in doing what is right. 2 Thessalonians 3:13"], ["dateVerse", "Sunday, November 13", "Malachi 4:1–2a", "Psalm 98", "2 Thessalonians 3:6–13", "Luke 21:5–19"], ["specialVerse", "Chief Elder Festival†", "Ezekiel 34:11–16,23–24", "Psalm 8", "Hebrews 4:14–16", "John 10:1–10"], ["watchD", "The Lord said, “I will defend this city to save it, for my own sake.” 2 Kings 19:34"], ["docT", "God’s firm foundation stands, bearing this inscription: “The Lord knows those who are his.” 2 Timothy 2:19"], ["prayer", "Dearest Chief Elder, all praise, honor, and glory are yours. Lord, you are our master as well as our friend. Thank you for guiding us through all that has been and all that is yet to come. In your name we pray. Amen."], ["info", "†On November 13, 1741, announcement was made to the congregations of the Brethren’s Church of the Chief Eldership of Jesus Christ."]], "319": [["dateVerse", "Monday, November 14", "Psalm 125", "1 Kings 8:17–53", "John 14:15–24"], ["watchD", "This is what the Lord said, “Through those who are near me I will show myself holy, and before all the people I will be glorified.” Leviticus 10:3"], ["docT", "You know the message God sent to the people of Israel, preaching peace by Jesus Christ—he is Lord of all. Acts 10:36"], ["prayer", "Lord God, you are the Lord of all; help us to keep your name holy and to glorify you. Help us to preach peace to all those around us. Amen."]], "320": [["dateVerse", "Tuesday, November 15", "Psalm 126", "1 Kings 8:54–9:19", "John 14:25–15:8"], ["watchD", "I shall not be put to shame, having my eyes fixed on all your commandments. Psalm 119:6"], ["docT", "The disciples were urging Jesus, “Rabbi, eat something.” But he said to them, “I have food to eat that you do not know about.” So the disciples said to one another, “Surely no one has brought him something to eat?” Jesus said to them, “My food is to do the will of him who sent me and to complete his work.” John 4:31–34"], ["prayer", "God, our Father, help us to know and do your will. May all that we do this day be pleasing in your sight. Lord, bless us and keep us all in your loving care. Amen. "]], "321": [["dateVerse", "Wednesday, November 16", "Psalm 127", "1 Kings 9:20–10:29", "John 15:9–17"], ["watchD", "Let all those rejoice who put their trust in you. Psalm 5:11 (NKJV)"], ["docT", "Although you have not seen Jesus Christ, you love him; and even though you do not see him now, you believe in him and rejoice with an indescribable and glorious joy. 1 Peter 1:8"], ["prayer", "Our Lord Jesus, though we may not see you face-to-face, help us to show your presence to our neighbors, friends, family, and to all whom we meet. Let us be your hands and feet in the life of someone who needs you today. In Jesus’ name we pray. Amen. "]], "322": [["dateVerse", "Thursday, November 17", "Psalm 128", "1 Kings 11:1–25", "John 15:18–16:4"], ["watchD", "Behold, to the Lord your God belong heaven and the highest heavens, the earth and all that is in it. Deuteronomy 10:14 (NASB)"], ["docT", "Ever since the creation of the world his eternal power and divine nature, invisible though they are, have been understood and seen through the things he has made. Romans 1:20"], ["prayer", "Lord, you can be seen in all of your creation. Help us to recognize you in all that we see and to hold your creation close to our hearts.  Amen."]], "323": [["dateVerse", "Friday, November 18", "Psalm 129", "1 Kings 11:26–12:24", "John 16:5–16"], ["watchD", "O Lord, I am oppressed; be my security! \u2028Isaiah 38:14"], ["docT", "The Spirit helps us in our weakness; for we do not know how to pray as we ought, but that very Spirit intercedes with sighs too deep for words. Romans 8:26"], ["prayer", "Though things in our lives may sometimes be uncertain, help us to keep our hearts and minds focused on you, Holy Spirit. Be our guide this day as we face whatever comes our way. In Jesus’ name we pray. Amen."]], "324": [["dateVerse", "Saturday, November 19", "Psalm 130", "1 Kings 12:25–13:22", "John 16:17–33"], ["watchD", "When they say to you, “Consult the mediums and the spiritists,” should not a people consult their God? Isaiah 8:19 (NASB)"], ["docT", "Whoever is united with the Lord is one with him in spirit. 1 Corinthians 6:17 (NIV)"], ["prayer", "Lord, we are united with you when we put our full faith in you. Let us not seek guidance from the world around us, but trust you in all that we do. Amen. "]], "325": [["info", "Reign of Christ (Christ the King Sunday)"], ["watchO", "Watchword for the Week — Be still, and know that I am God! I am exalted among the nations, I am exalted in the earth. Psalm 46:10"], ["dateVerse", "Sunday, November 20", "Jeremiah 23:1–6", "Psalm 46", "Colossians 1:11–20", "Luke 23:33–43"], ["watchD", "Uphold me according to your promise, that I may live, and let me not be put to shame in my hope. Psalm 119:116"], ["docT", "May the God of peace himself sanctify you entirely; and may your spirit and soul and body be kept sound and blameless at the coming of our Lord Jesus Christ. 1 Thessalonians 5:23"], ["prayer", "Heavenly King of kings, help us to be still and know that you are the reigning King of our lives. Bless us this day, O Lord, we pray and forever keep us in your love. Amen.  "]], "326": [["dateVerse", "Monday, November 21", "Psalm 131", "1 Kings 13:23–14:20", "John 17:1–19"], ["watchD", "Great are the works of the Lord; they are pondered by all who delight in them. Psalm 111:2 (NIV)"], ["docT", "Consider the lilies, how they grow: they neither toil nor spin; yet I tell you, even Solomon in all his glory was not clothed like one of these. Luke 12:27"], ["prayer", "Heavenly Father, your works are great! You constantly show us that you are with us in all that we do. Help us to stop worrying and to put our hopes and fears in your hands, O God. Amen. "]], "327": [["dateVerse", "Tuesday, November 22", "Psalm 132", "1 Kings 14:21–15:8", "John 17:20–26"], ["watchD", "As the mountains surround Jerusalem, so the Lord surrounds his people, from this time on and forevermore. Psalm 125:2"], ["docT", "John wrote: I heard a loud voice from the throne saying, “See, the home of God is among mortals. He will dwell with them; they will be his peoples.” Revelation 21:3"], ["prayer", "Lord, we know that we are yours and yours alone. Help us to reflect the love that you have given to us so that others may join your fold. In Jesus’ name we pray. Amen. "]], "328": [["dateVerse", "Wednesday, November 23", "Psalm 133", "1 Kings 15:9–16:14", "John 18:1–11"], ["watchD", "Noah did all that God commanded him. Genesis 6:22"], ["docT", "By faith Noah, being warned by God about things not yet seen, in reverence prepared an ark for the salvation of his household. Hebrews 11:7 (NASB)"], ["prayer", "Lord God, faith is our most powerful gift. Just as Abraham, Noah, Sarah, and Moses put their full faith in you, let us find the strength to put our full faith in you with all that we do. Amen. "]], "329": [["dateVerse", "Thursday, November 24", "Psalm 134", "1 Kings 16:15–17:24", "John 18:12–24"], ["watchD", "I know that my Redeemer lives. Job 19:25"], ["docT", "Paul wrote: The saying is sure and worthy of full acceptance, that Christ Jesus came into the world to save sinners—of whom I am the foremost. 1 Timothy 1:15"], ["prayer", "Dearest Savior, thank you for coming into the world, living among us, and knowing us inside and out; thank you for being our Savior, conquering for us, and allowing us to follow you. Amen."]], "330": [["dateVerse", "Friday, November 25", "Psalm 135:1–12", "1 Kings 18", "John 18:25–40"], ["watchD", "The human mind plans the way, but the Lord directs the steps. Proverbs 16:9"], ["docT", "You ought to say, “If the Lord wishes, we will live and do this or that.” James 4:15"], ["prayer", "Lord, guide our feet so that we will be in your will and do the goodness of your Spirit. Be our sure feet in this life so that we may rejoice with you in the next.  In Jesus’ name we pray. Amen. "]], "331": [["dateVerse", "Saturday, November 26", "Psalm 135:13–21", "1 Kings 19", "John 19:1–11"], ["watchD", "The righteous are like trees planted by streams of water, which yield their fruit in its season, and their leaves do not wither. Psalm 1:3"], ["docT", "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. Galatians 5:22–23"], ["prayer", "God of love, joy, and peace, abide with us this day in all that we do and say. Take from us the things that worry us most and let us delight in you through all of what this day may bring. In Jesus’ name we pray. Amen."]], "332": [["info", "First Sunday of Advent"], ["watchO", "Watchword for the Week — Come, let us walk in the light of the Lord! Isaiah 2:5"], ["dateVerse", "Sunday, November 27", "Isaiah 2:1–5", "Psalm 122", "Romans 13:11–14", "Matthew 24:36–44"], ["watchD", "My word shall not return to me empty, but it shall accomplish that which I purpose, and succeed in the thing for which I sent it. Isaiah 55:11"], ["docT", "The disciples went out and proclaimed the good news everywhere, while the Lord worked with them and confirmed the message by the signs that accompanied it. Mark 16:20"], ["prayer", "Lord, as we go forth today may we spread your word in all that we say and do. May the power of your message not fall upon deaf ears; may we all know that you are God. Amen. "]], "333": [["dateVerse", "Monday, November 28", "Psalm 136", "1 Kings 20:1–21", "John 19:12–24"], ["watchD", "Happy are those who fear the Lord, who greatly delight in his commandments. Psalm 112:1"], ["docT", "Continue in what you have learned and firmly believed, knowing from whom you learned it, and how from childhood you have known the sacred writings that are able to instruct you for salvation through faith in Christ Jesus. 2 Timothy 3:14–15"], ["prayer", "Source of all wisdom and truth, teach us to sow words of love and peace instead of hate and war in this world that we call home. Help us to love our neighbors as ourselves as we seek to do your will. Amen."]], "334": [["dateVerse", "Tuesday, November 29", "Psalm 137", "1 Kings 20:22–21:16", "John 19:25–37"], ["watchD", "I will manifest my holiness among you in the sight of the nations. You shall know that I am the Lord, when I bring you into the land of Israel, the country that I swore to give to your ancestors. Ezekiel 20:41–42"], ["docT", "The gifts and the calling of God are irrevocable. Romans 11:29"], ["prayer", "Your gifts to us are plentiful, dear Lord. Help us to use them to praise you and to show the nations that you are Lord of our lives. Amen. "]], "335": [["dateVerse", "Wednesday, November 30", "Psalm 138:1–5", "1 Kings 21:17–22:28", "John 19:38–20:9"], ["watchD", "I will not let you go, unless you bless me. Genesis 32:26"], ["docT", "Devote yourselves to prayer, keeping alert in it with thanksgiving. Colossians 4:2"], ["prayer", "Lord God, help us to never shy away from conversing with you. Prayer is our way to talk with you. May the conversation never end. Amen. "]], "336": [["dateVerse", "Thursday, December 1", "Psalm 138:6–8", "1 Kings 22:29–53", "John 20:10–23"], ["watchD", "Keep hold of instruction; do not let go; guard her, for she is your life. Proverbs 4:13"], ["docT", "The aim of such instruction is love that comes from a pure heart, a good conscience, and sincere faith. 1 Timothy 1:5"], ["prayer", "O wondrous source of all knowledge and truth, instill in us a love and yearning for all that is of you. Amen. "]], "337": [["dateVerse", "Friday, December 2", "Psalm 139:1–6", "2 Kings 1:1–2:18", "John 20:24–31"], ["watchD", "I lie down and sleep; I wake again, for the Lord sustains me. Psalm 3:5"], ["docT", "Peace to all of you who are in Christ. 1 Peter 5:14"], ["prayer", "Prince of peace, whether waking or sleeping, we know that you are with us, sustaining us with your perfect peace. Amen. "]], "338": [["dateVerse", "Saturday, December 3", "Psalm 139:7–12", "2 Kings 2:19–3:27", "John 21:1–14"], ["watchD", "Truly God is good to the upright, to those who are pure in heart. Psalm 73:1"], ["docT", "Simeon was looking forward to the consolation of Israel. Luke 2:25"], ["prayer", "O, God, guide our faith. Show us ways of gratitude and teach us to give to others with pure hearts. Hear our songs of praise. Let us rejoice from our hearts in this most blessed Advent season. Amen."]], "339": [["info", "Second Sunday of Advent"], ["watchO", "Watchword for the Week — Repent, for the kingdom of heaven has come near. Matthew 3:2"], ["dateVerse", "Sunday, December 4", "Isaiah 11:1–10", "Psalm 72", "Romans 15:4–13", "Matthew 3:1–12"], ["watchD", "The Lord lift up his countenance upon you, and give you peace. Numbers 6:26"], ["docT", "May the God of hope fill you with all joy and peace in believing. Romans 15:13"], ["prayer", "Loving God, you are the source of our joy and peace. We believe because of your gift of Jesus Christ and your gift of faith through the Holy Spirit. Hallelujah! Amen."]], "340": [["dateVerse", "Monday, December 5", "Psalm 139:13–16", "2 Kings 4:1–37", "John 21:15–25"], ["watchD", "Be glad and rejoice in the Lord your God. Joel 2:23"], ["docT", "Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them. He has raised up a mighty savior for us in the house of his servant David. Luke 1:68–69"], ["prayer", "Lord God, we rejoice that you sent your son Jesus to redeem our souls. Let us be glad that in this season of Advent you remain present with us, guiding us daily and preparing us for your second coming. Amen."]], "341": [["dateVerse", "Tuesday, December 6", "Psalm 139:17–24", "2 Kings 4:38–5:14", "Acts 1:1–14"], ["watchD", "Elijah said, “How long will you go limping with two different opinions? If the Lord is God, follow him; but if Baal, then follow him.” 1 Kings 18:21"], ["docT", "Jesus said, “No one sews a piece of unshrunk cloth on an old cloak; otherwise, the patch pulls away from it, the new from the old, and a worse tear is made.” Mark 2:21"], ["prayer", "Father, when you sent your Son, you sent a new way of life which offers us a life of redemption and salvation. May we live each day in a way that shows that we are redeemed, saved, and loved by you. Amen."]], "342": [["dateVerse", "Wednesday, December 7", "Psalm 140:1–5", "2 Kings 5:15–6:23", "Acts 1:15–26"], ["watchD", "Because of the Lord’s great love we are not consumed. Lamentations 3:22 (NIV)"], ["docT", "The grace of our Lord overflowed for me with the faith and love that are in Christ Jesus. 1 Timothy 1:14"], ["prayer", "Almighty Father, as we remember the sacrifices that you have made for us, we are thankful for the ultimate sacrifice of your son, Jesus Christ, the Lamb of God. We thank you for the redemption that was paid for by his blood. Amen."]], "343": [["dateVerse", "Thursday, December 8", "Psalm 140:6–13", "2 Kings 6:24–7:20", "Acts 2:1–13"], ["watchD", "Joshua fell on his face to the earth and worshiped, and he said to him, “What do you command your servant, my Lord?” Joshua 5:14"], ["docT", "Blessed are those who hear the word of God and obey it! Luke 11:28"], ["prayer", "Christ, we await your leading. You are a voice of courage to those who speak but are not heard. Help us to hear their pleas and to do what you would have us do to ease their distress. Amen. "]], "344": [["dateVerse", "Friday, December 9", "Psalm 141:1–4", "2 Kings 8", "Acts 2:14–28"], ["watchD", "Balaam replied, “Although Balak were to give me his house full of silver and gold, I could not go beyond the command of the Lord my God.” Numbers 22:18"], ["docT", "Do not be overcome by evil, but overcome evil with good. Romans 12:21"], ["prayer", "God of mercy and compassion, overflow our lives with your loving presence and wash away all that would keep us from you. Our worship, love, and service we gladly give in return. Amen."]], "345": [["dateVerse", "Saturday, December 10", "Psalm 141:5–10", "2 Kings 9", "Acts 2:29–47"], ["watchD", "The days are surely coming, says the Lord, when I will raise up for David a righteous Branch, and he shall reign as king and deal wisely, and shall execute justice and righteousness in the land. Jeremiah 23:5"], ["docT", "Those who went ahead and those who followed were shouting, “Hosanna! Blessed is the one who comes in the name of the Lord! Blessed is the coming kingdom of our ancestor David! Hosanna in the highest heaven!” Mark 11:9–10"], ["prayer", "Divine Creator, hear our hosannas for your incarnation amongst your creation who shows us perfect grace and love. Leave us not in our feeble and imperfect efforts to follow your will, but lead us toward divine justice, love, and grace. Amen."]], "346": [["info", "Third Sunday of Advent"], ["watchO", "Watchword for the Week — Be strong, do not fear! Here is your God. Isaiah 35:4"], ["dateVerse", "Sunday, December 11", "Isaiah 35:1–10", "Psalm 146:5–10", "James 5:7–10", "Matthew 11:2–11"], ["watchD", "I will gather the exiles. I will give them praise and honor in every land where they have suffered shame. Zephaniah 3:19 (NIV)"], ["docT", "Jesus saw a great crowd; and he had compassion for them, because they were like sheep without a shepherd. Mark 6:34"], ["prayer", "Shepherd of our souls, we all are exiles in some way; we long for home. We are connected to others through the love we have with you and we ask that you help us to share that love in our daily interactions. Amen. "]], "347": [["dateVerse", "Monday, December 12", "Psalm 142", "2 Kings 10", "Acts 3:1–10"], ["watchD", "Speak out for those who cannot speak, for the rights of all the destitute. Proverbs 31:8"], ["docT", "Remember the prisoners as if chained with them—those who are mistreated—since you yourselves are in the body also. Hebrews 13:3 (NKJV)"], ["prayer", "Father, as we walk again the road to Bethlehem, let us remember those who lifted us up on our faith journeys and the trials that revealed your grace, the key to freedom from the prison of sin and death. Amen."]], "348": [["dateVerse", "Tuesday, December 13", "Psalm 143:1–6", "2 Kings 11", "Acts 3:11–26"], ["watchD", "Show me your glory, I pray. Exodus 33:18"], ["docT", "Philip said to him, “Lord, show us the Father, and we will be satisfied.” Jesus said to him, “Have I been with you all this time, Philip, and you still do not know me?” John 14:8–9"], ["prayer", "In the dark and barren depths of our souls, we search for the one source of comfort that can heal and restore. Reveal your glory to us, O God; the light of your love in Christ is our greatest desire. Amen."]], "349": [["dateVerse", "Wednesday, December 14", "Psalm 143:7–12", "2 Kings 12,13", "Acts 4:1–12"], ["watchD", "The God of heaven is the one who will give us success, and we his servants are going to start building. Nehemiah 2:20"], ["docT", "We are God’s fellow workers. 1 Corinthians 3:9 (NKJV)"], ["prayer", "Omnipotent God, through your mighty works you created us, your workers. In all that we busily do to prepare for your coming this Advent season, remind us that our work is for your good and perfect will. Amen."]], "350": [["dateVerse", "Thursday, December 15", "Psalm 144:1–4", "2 Kings 14", "Acts 4:13–22"], ["watchD", "Fathers make known to children your faithfulness. Isaiah 38:19"], ["docT", "Every scribe who has been trained for the kingdom of heaven is like the master of a household who brings out of his treasure what is new and what is old. Matthew 13:52"], ["prayer", "Gracious God, we give thanks for the wisdom of your word that fills our minds and breathes life into our hearts. Lead us to know your way, so that our lives shine with the light of your love and presence. Amen."]], "351": [["dateVerse", "Friday, December 16", "Psalm 144:5–8", "2 Kings 15", "Acts 4:23–37"], ["watchD", "Have I any pleasure in the death of the wicked, says the Lord God, and not rather that they should turn from their ways and live? Ezekiel 18:23"], ["docT", "Do you not realize that God’s kindness is meant to lead you to repentance? Romans 2:4"], ["prayer", "Loving Savior, we confess that we are a sinful people. We know that it is only through your loving kindness that we can come to you, ask your forgiveness, and receive your pardoning grace. Amen."]], "352": [["dateVerse", "Saturday, December 17", "Psalm 144:9–15", "2 Kings 16:1–17:6", "Acts 5:1–11"], ["watchD", "I love the Lord, because he has heard my voice and my supplications. Psalm 116:1"], ["docT", "The angel said to him, “Do not be afraid, Zechariah, for your prayer has been heard. Your wife Elizabeth will bear you a son, and you will name him John.” Luke 1:13"], ["prayer", "Gracious God, there is much in our world to make us afraid. We give thanks that your Holy Spirit intercedes for us; we know you never forsake us. We lift our praise to you as your love overcomes all that we fear. Amen."]], "353": [["info", "Fourth Sunday of Advent"], ["watchO", "Watchword for the Week — Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["dateVerse", "Sunday, December 18", "Isaiah 7:10–16", "Psalm 80:1–7,10–14", "Romans 1:1–7", "Matthew 1:18–25"], ["watchD", "Who is like the Lord our God, who is seated on high, who looks far down on the heavens and the earth? He raises the poor from the dust. Psalm 113:5–7"], ["docT", "Paul wrote: Though Christ was crucified in weakness, yet he lives by the power of God. For we also are weak in him, but we shall live with him by the power of God toward you. \u20282 Corinthians 13:4 (NKJV)"], ["prayer", "Forgiving God, remind us that our preparations to receive and celebrate the birth of your Son, no matter how creative or extravagant, are for naught if not moved by and infused with your power. Amen."]], "354": [["dateVerse", "Monday, December 19", "Psalm 145:1–7", "2 Kings 17:7–41", "Acts 5:12–16"], ["watchD", "Light dawns for the righteous, and joy for the upright in heart. Psalm 97:11"], ["docT", "When they saw the star, they rejoiced with exceedingly great joy. Matthew 2:10 (NKJV)"], ["prayer", "Glorious God, lead us to receive Christ Jesus, who upon himself bears all our sins. Then, with hearts and desire more pure, the light of your presence will be our guide, our comfort, and our joy. Amen."]], "355": [["dateVerse", "Tuesday, December 20", "Psalm 145:8–16", "2 Kings 18", "Acts 5:17–40"], ["watchD", "God does great things beyond understanding, and marvelous things without number. Job 9:10"], ["docT", "From his fullness we have all received, grace upon grace. John 1:16"], ["prayer", "Creator, too often we are blind to the wonders of this world. We are your people of faith. Help us to see your wonder in the faces of everyone we meet. Amen. "]], "356": [["dateVerse", "Wednesday, December 21", "Psalm 145:17–21", "2 Kings 19:1–28", "Acts 5:41–6:7"], ["watchD", "Woe to those who acquit the guilty for a bribe, but deny justice to the innocent. Isaiah 5:22,23 (NIV)"], ["docT", "With the judgment you make you will be judged, and the measure you give will be the measure you get. Matthew 7:2"], ["prayer", "You, O God, are the judge of all things. Thank you for not holding us to the law, but for giving us grace through Jesus Christ, our salvation, our hope fulfilled. Amen."]], "357": [["dateVerse", "Thursday, December 22", "Psalm 146:1–5", "2 Kings 19:29–37", "Acts 6:8–7:3"], ["watchD", "Not by might, nor by power, but by my spirit, says the Lord of hosts. Zechariah 4:6"], ["docT", "By faith the walls of Jericho fell. Hebrews 11:30"], ["prayer", "Father, it can be troubling to see anger, strife, and dissension around us. You created this beautiful world for love of your children so that we may love one another. With our faith and your grace, all things can be healed. Amen."]], "358": [["dateVerse", "Friday, December 23", "Psalm 146:6–10", "2 Kings 20:1–21", "Acts 7:4–16"], ["watchD", "All the ends of the earth shall turn to the Lord. Psalm 22:27"], ["docT", "The true light, which enlightens everyone, was coming into the world. John 1:9"], ["prayer", "Light of the world, we pause to give you thanks for showing us the image of God through your presence. You lighten our dark world and enrich our lives through the fruits of the Holy Spirit. Amen."]], "359": [["info", "Christmas Eve"], ["dateVerse", "Saturday, December 24", "Psalm 147:1–6", "2 Kings 21:1–22:10", "Acts 7:17–29"], ["watchD", "I kept my faith, even when I said, “I am greatly afflicted.” Psalm 116:10"], ["docT", "If the Son makes you free, you will be free indeed. John 8:36"], ["prayer", "Father, you use life’s challenges to strengthen our faith. May we live our faith in ways that show the world the love that you showed to us through the gift of your Son. No other gift will ever be as precious. Amen."]], "360": [["info", "Nativity of the Lord (Christmas Day)"], ["watchO", "Watchword for Christmas Day — The law was given through Moses; grace and truth came through Jesus Christ. John 1:17"], ["dateVerse", "Sunday, December 25", "Isaiah 52:7–10", "Psalm 98", "Hebrews 1:1–4,(5–12)", "John 1:1–14"], ["watchD", "The bows of the mighty are broken, but the feeble gird on strength. 1 Samuel 2:4"], ["docT", "Mary said, “He has brought down the powerful from their thrones, and lifted up the lowly; he has filled the hungry with good things, and sent the rich away empty.” Luke 1:52–53"], ["prayer", "Creator of all that shall be, we’re blessed by your incarnation. Separated from you, alone and in darkness, we languished until you came, gave us good things, and lifted us up. Comfort us. Set our feet upon the path toward your kingdom. Amen."]], "361": [["dateVerse", "Monday, December 26", "Psalm 147:7–14", "2 Kings 22:11–23:20", "Acts 7:30–43"], ["watchD", "The Lord opens the eyes of the blind. Psalm 146:8"], ["docT", "The eyes of your heart may be enlightened in order that you may know the hope to which he has called you. Ephesians 1:18 (NIV)"], ["prayer", "O great Physician of our hearts, our hope is built on your blood and righteousness. Thank you for opening our eyes through the birth of our Savior so that we may see your truth. Amen."]], "362": [["dateVerse", "Tuesday, December 27", "Psalm 147:15–20", "2 Kings 23:21–24:20", "Acts 7:44–60"], ["watchD", "Turn, O Lord, save my life; deliver me for the sake of your steadfast love. Psalm 6:4"], ["docT", "Jesus turned, and seeing her he said, “Take heart, daughter; your faith has made you well.” And instantly the woman was made well. Matthew 9:22"], ["prayer", "In faith we journey with uncertain steps to greet our Savior and Lord. Jesus is born into our world and meets us wherever we are found. We give thanks that God’s love in Christ heals and saves us. Amen."]], "363": [["dateVerse", "Wednesday, December 28", "Psalm 148:1–6", "2 Kings 25", "Acts 8:1–8"], ["watchD", "The Lord said to Jeremiah, “Now I have put my words in your mouth.” Jeremiah 1:9"], ["docT", "From the cloud there came a voice, “This is my Son, the Beloved; listen to him!” Mark 9:7"], ["prayer", "Dear Lord, daily we struggle and strive to make the words from our thoughts and mouths to be words that are acceptable in your sight. Please keep your hand on our mouths so that we may speak your words. Amen."]], "364": [["dateVerse", "Thursday, December 29", "Psalm 148:7–14", "1 Chronicles 1:1–37", "Acts 8:9–17"], ["watchD", "Do not be afraid, for I am with you to deliver you, says the Lord. Jeremiah 1:8"], ["docT", "The Son of Man came to seek out and to save the lost. Luke 19:10"], ["prayer", "Glorious God, you sent your precious Son to deliver and save us. Your gift of grace enables us to live in your light day by day. Thank you for your blessings and love. Amen."]], "365": [["dateVerse", "Friday, December 30", "Psalm 149", "1 Chronicles 1:38–2:17", "Acts 8:18–25"], ["watchD", "More majestic than the thunders of mighty waters, more majestic than the waves of the sea, majestic on high is the Lord! Psalm 93:4"], ["docT", "Jesus Christ says, “In the world you face persecution. But take courage; I have conquered the world!” John 16:33"], ["prayer", "Majestic living Water, you have washed us in your saving grace; blessed is your name. Amen."]], "366": [["dateVerse", "Saturday, December 31", "Psalm 150", "1 Chronicles 2:18–55", "Acts 8:26–40"], ["watchD", "How very good and pleasant it is when kindred live together in unity! For there the Lord ordained his blessing, life forevermore. Psalm 133:1,3"], ["docT", "Agree with one another, live in peace; and the God of love and peace will be with you. The grace of the Lord Jesus Christ, the love of God, and the communion of the Holy Spirit be with all of you. 2 Corinthians 13:11,13"], ["prayer", "Almighty Father, we give you thanks for the blessing of another year. We ask for the Spirit to be in us as we start the new year. Thank you for your love, grace, and mercy. Amen."]]}