{"1": [["dateVerse", "Tuesday, January 1", "Psalm 1", "1 Chronicles 3", "Acts 9:1–9"], ["watchD", "You shall not pervert the justice due to your poor in their lawsuits. Exodus 23:6"], ["docT", "There was a rich man who was dressed in purple and fine linen and who feasted sumptuously every day. And at his gate lay a poor man named Lazarus. Luke 16:19-20"], ["prayer", "Dear Lord, on this the first day of the new year, may we focus on our neighbors, our friends, and our family, and never overlook each others’ struggles. May this be the year of joy and peace. Amen."]], "2": [["dateVerse", "Wednesday, January 2", "Psalm 2", "1 Chronicles 4:1–23", "Acts 9:10–22"], ["watchD", "Joseph said to his brothers, “Do not quarrel along the way.” Genesis 45:24"], ["docT", "Bear with one another and, if anyone has a complaint against another, forgive each other. Colossians 3:13"], ["prayer", "Holy Savior, it is difficult at times to forgive each other. Please be with us during these times to spread your grace and understanding to each other. Amen."]], "3": [["dateVerse", "Thursday, January 3", "Psalm 3", "1 Chronicles 4:24–43", "Acts 9:23–35"], ["watchD", "He guards the lives of his faithful; he rescues them from the hand of the wicked. Psalm 97:10"], ["docT", "The God of all grace, who has called you to his eternal glory in Christ, will himself restore, support, strengthen, and establish you. 1 Peter 5:10"], ["prayer", "God of grace, when you call to us, please give us ears to hear and minds to be faithful, and not fear the unknown, for you are always with us. Amen."]], "4": [["dateVerse", "Friday, January 4", "Psalm 4", "1 Chronicles 5:1–22", "Acts 9:36–10:8"], ["watchD", "You have looked for much, and, lo, it came to little; and when you brought it home, I blew it away. Why? says the Lord of hosts. Because my house lies in ruins, while all of you hurry off to your own houses. Haggai 1:9"], ["docT", "Do not lag in zeal, be ardent in spirit, serve the Lord. Romans 12:11"], ["prayer", "Holy God, whatever you command of us, let our whole heart be joyful, ready, and willing to do your work to your glory. Let us go forth this day and shine your light to others. Amen."]], "5": [["dateVerse", "Saturday, January 5", "Psalm 5", "1 Chronicles 5:23–6:30", "Acts 10:9–23a"], ["watchD", "Before me every knee will bow; by me every tongue will swear. They will say of me, ‘In the Lord alone are deliverance and strength.’ Isaiah 45:23-24 NIV"], ["docT", " “I am the Alpha and the Omega,” says the Lord God, who is and who was and who is to come, the Almighty. Revelation 1:8"], ["prayer", "Almighty God, you truly are the one and only who can forgive us and love us unconditionally. We pray that we will always praise your name to everyone we meet. Give us strength for the day. Amen."]], "6": [["info", "Epiphany of the Lord"], ["watchO", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["dateVerse", "Sunday, January 6", "Isaiah 60:1-6", "Psalm 72:1-7,10-14", "Ephesians 3:1-12", "Matthew 2:1-12"], ["watchD", "“O that my people would listen to me.” Psalm 81:13"], ["docT", "The grace of God has appeared, bringing salvation to all, training us to renounce impiety and worldly passions, and in the present age to live lives that are self-controlled, upright, and godly. Titus 2:11-12"], ["prayer", "O Guardian of our very being, we strive to hear you, though our thoughts go astray. Please help us to have the self-control to listen when you call. Amen."]], "7": [["dateVerse", "Monday, January 7", "Psalm 6", "1 Chronicles 6:31–81", "Acts 10:23b–33"], ["watchD", "See, I will refine and test my people. Jeremiah 9:7 NIV"], ["docT", "Blessed is anyone who endures temptation. Such a one has stood the test and will receive the crown of life that the Lord has promised to those who love him. James 1:12"], ["prayer", "Father, hear us when we call out to you. You are the source of grace and life, and we ask that your spirit dwell in us today and every day. Amen."]], "8": [["dateVerse", "Tuesday, January 8", "Psalm 7:1–9", "1 Chronicles 7", "Acts 10:34–43"], ["watchD", "Do not let those who wait for you be put to shame; let them be ashamed who are wantonly treacherous. Psalm 25:3"], ["docT", "Paul writes: We were afflicted in every way—disputes without and fears within. But God, who consoles the downcast, consoled us. 2 Corinthians 7:5-6"], ["prayer", "In the days of fearing the unknown, it is you, Lord, who consoles and holds us to show us everything will be all right. Help us to know you are always here. Amen."]], "9": [["dateVerse", "Wednesday, January 9", "Psalm 7:10–17", "1 Chronicles 8", "Acts 10:44–11:10"], ["watchD", "David prayed, “Because of your promise, and according to your own heart, you have wrought all this greatness.” 2 Samuel 7:21"], ["docT", "This is how God showed his love among us: He sent his one and only Son into the world that we might live through him. 1 John 4:9 NIV"], ["prayer", "Loving God, thank you for sending your son into the world to shine his love upon us. May we show your loving kindness to others. Amen."]], "10": [["dateVerse", "Thursday, January 10", "Psalm 8", "1 Chronicles 9:1–34", "Acts 11:11–24"], ["watchD", "The hand of our God was upon us, and he delivered us. Ezra 8:31"], ["docT", "Jesus says, “My sheep hear my voice. I know them, and they follow me. I give them eternal life, and they will never perish. No one will snatch them out of my hand.” John 10:27-28"], ["prayer", "Gracious Shepherd, guide your flock in the way we should go, keeping our eyes always fixed on you. In your name we pray. Amen."]], "11": [["dateVerse", "Friday, January 11", "Psalm 9:1–10", "1 Chronicles 9:35–11:3", "Acts 11:25–12:5"], ["watchD", "You have put gladness in my heart more than when their grain and wine abound. Psalm 4:7"], ["docT", "As for those who in the present age are rich, command them not to be haughty, or to set their hopes on the uncertainty of riches, but rather on God who richly provides us with everything for our enjoyment. 1 Timothy 6:17"], ["prayer", "O Commander of our souls, please put gladness in our hearts to make us rich with your knowledge. Amen."]], "12": [["dateVerse", "Saturday, January 12", "Psalm 9:11–20", "1 Chronicles 11:4–47", "Acts 12:6–19"], ["watchD", "Although these nations do give heed to soothsayers and diviners, as for you, the Lord your God does not permit you to do so. Deuteronomy 18:14"], ["docT", "We have not ceased praying for you and asking that you may be filled with the knowledge of God’s will in all spiritual wisdom and understanding, so that you may lead lives worthy of the Lord, fully pleasing to him, as you bear fruit in every good work and as you grow in the knowledge of God. Colossians 1:9-10"], ["prayer", "We pray daily to you, Lord. Please hear us as we ask for knowledge and the will to always do what is pleasing to you. Amen."]], "13": [["info", "First Sunday after the Epiphany"], ["watchO", "Watchword for the week — God says, “Do not fear, for I have redeemed you; I have called you by name, you are mine.” Isaiah 43:1"], ["dateVerse", "Sunday, January 13", "Isaiah 43:1-7", "Psalm 29", "Acts 8:14-17", "Luke 3:15-17,21-22"], ["watchD", "In overflowing wrath for a moment I hid my face from you, but with everlasting love I will have compassion on you, says the Lord, your Redeemer. Isaiah 54:8"], ["docT", "Do you not realize that God’s kindness is meant to lead you to repentance? Romans 2:4"], ["prayer", "Kindly Lord, have compassion on us, teaching us to love you as you love us. In Jesus’ name we pray. Amen."]], "14": [["dateVerse", "Monday, January 14", "Psalm 10:1–11", "1 Chronicles 12", "Acts 12:20–13:7"], ["watchD", "They shall be my people and I will be their God, for they shall return to me with their whole heart. Jeremiah 24:7"], ["docT", "You know the message God sent to the people of Israel, announcing the good news of peace through Jesus Christ, who is Lord of all. Acts 10:36 NIV"], ["prayer", "Our hearts are always longing for your message, Lord. Give us good news in times of trial. In Jesus’ name we pray. Amen."]], "15": [["dateVerse", "Tuesday, January 15", "Psalm 10:12–18", "1 Chronicles 13:1–14:7", "Acts 13:8–20a"], ["watchD", "I will tell of your name to my brothers and sisters. Psalm 22:22"], ["docT", "The women left the tomb quickly with fear and great joy, and ran to tell his disciples. Matthew 28:8"], ["prayer", "Son of our Creator, we are excited to know you are not in the grave but at the right hand of the Father, watching over the mighty kingdom. May you keep us safe in everything we do. In your holy name we pray. Amen."]], "16": [["dateVerse", "Wednesday, January 16", "Psalm 11", "1 Chronicles 14:8–15:29", "Acts 13:20b–33"], ["watchD", "If anyone secretly entices you—even if it is your brother, your father’s son or your mother’s son, or your own son or daughter, or the wife you embrace, or your most intimate friend—saying, “Let us go worship other gods,” you must not yield to or heed any such persons. Deuteronomy 13:6,8"], ["docT", "For freedom Christ has set us free. Galatians 5:1"], ["prayer", "The only god to worship is you, our Redeemer. Please keep us strong when we are tempted by sin. Amen."]], "17": [["dateVerse", "Thursday, January 17", "Psalm 12", "1 Chronicles 16:1–36", "Acts 13:34–47"], ["watchD", "Joshua fell on his face to the earth and worshiped, and he said to him, “What do you command your servant, my Lord?” Joshua 5:14"], ["docT", "Blessed are your eyes, for they see, and your ears, for they hear. Matthew 13:16"], ["prayer", "Heavenly Father, we are your humble servants longing to help those in need. Guide us, so we may see and hear what you have for us to do. Amen."]], "18": [["dateVerse", "Friday, January 18", "Psalm 13", "1 Chronicles 16:37–17:27", "Acts 13:48–14:7"], ["watchD", "In my distress I called upon the Lord; to my God I cried for help. He heard my voice. Psalm 18:6"], ["docT", "Jesus touched their eyes and said, “According to your faith let it be done to you.” And their eyes were opened. Matthew 9:29-30"], ["prayer", "O Spirit, help us to see and find peace in our everyday lives. You are our sustainer! In Jesus’ name we pray. Amen."]], "19": [["dateVerse", "Saturday, January 19", "Psalm 14", "1 Chronicles 18", "Acts 14:8–20"], ["watchD", "The Lord of hosts has planned, and who will annul it? His hand is stretched out, and who will turn it back? Isaiah 14:27"], ["docT", "If God is for us, who is against us? Romans 8:31"], ["prayer", "O God, you have always been, and will always be, for us. Take our hands and keep us with you always. Amen."]], "20": [["info", "Second Sunday after the Epiphany"], ["watchO", "Watchword for the week — Now there are varieties of gifts, but the same Spirit; and there are varieties of services, but the same Lord. 1 Corinthians 12:4–5"], ["dateVerse", "Sunday, January 20", "Isaiah 62:1-5", "Psalm 36:5-10", "1 Corinthians 12:1-11", "John 2:1-11"], ["watchD", "You search out my path and my lying down, and are acquainted with all my ways. Psalm 139:3"], ["docT", "Are not two sparrows sold for a penny? Yet not one of them will fall to the ground apart from your Father. Matthew 10:29"], ["prayer", "O Guardian of our very being, you know our comings and goings. We pray you are with us always. Amen."]], "21": [["dateVerse", "Monday, January 21", "Psalm 15", "1 Chronicles 19,20", "Acts 14:21–15:5"], ["watchD", "The Lord of hosts is with us; the God of Jacob is our refuge. Psalm 46:7"], ["docT", "The Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3"], ["prayer", "O God, you are truly the one to keep us away from sin. Guard us today and always. Amen."]], "22": [["dateVerse", "Tuesday, January 22", "Psalm 16:1–6", "1 Chronicles 21:1–26", "Acts 15:6–18"], ["watchD", "When you return to the Lord your God, then the Lord your God will restore you from captivity, and have compassion on you. Deuteronomy 30:2,3 NASB"], ["docT", "Draw near to God, and he will draw near to you. Cleanse your hands, you sinners, and purify your hearts, you double-minded. James 4:8"], ["prayer", "Holy compassionate One, who restores our souls—please hear our prayers, forgive us, and keep us in your care. Amen."]], "23": [["dateVerse", "Wednesday, January 23", "Psalm 16:7–11", "1 Chronicles 21:27–22:19", "Acts 15:19–31"], ["watchD", "I will make a covenant of peace with them; it shall be an everlasting covenant with them. Ezekiel 37:26"], ["docT", "Christ Jesus came and proclaimed peace to you who were far off and peace to those who were near. Ephesians 2:17"], ["prayer", "Christ Jesus, you bring your proclamation of peace to all the nations. We pray they listen to your voice and abide in you. Amen."]], "24": [["dateVerse", "Thursday, January 24", "Psalm 17:1–7", "1 Chronicles 23", "Acts 15:32–16:3"], ["watchD", "With weeping they shall come, and with consolations I will lead them back, I will let them walk by brooks of water, in a straight path in which they shall not stumble; for I have become a father to Israel. Jeremiah 31:9"], ["docT", "The Son of Man came to seek out and to save the lost. Luke 19:10"], ["prayer", "Holy Spirit, you save the lost and dry the tears of many. Lead us through our days to become closer to you. In Jesus’ name we pray. Amen."]], "25": [["dateVerse", "Friday, January 25", "Psalm 17:8–15", "1 Chronicles 24", "Acts 16:4–15"], ["watchD", "O Lord, how manifold are your works! In wisdom you have made them all; the earth is full of your creatures. Psalm 104:24"], ["docT", "Jesus said, “Consider the lilies of the field, how they grow; they neither toil nor spin, yet I tell you, even Solomon in all his glory was not clothed like one of these.” Matthew 6:28-29"], ["prayer", "Creator Lord, everything you made has been made to your glory. The earth is made new throughout the changing seasons. Our utmost praises to you! Amen."]], "26": [["dateVerse", "Saturday, January 26", "Psalm 18:1–6", "1 Chronicles 25", "Acts 16:16–29"], ["watchD", "The days are surely coming, says the Lord, when the city shall be rebuilt for the Lord. Jeremiah 31:38"], ["docT", "The glory and honor of the nations will be brought into the city. Revelation 21:26 NIV"], ["prayer", "Holy Comforter, we pray for guidance to always be your faithful servants as we await the coming of the Lord. Amen."]], "27": [["info", "Third Sunday after the Epiphany"], ["watchO", "Watchword for the week — Let the words of my mouth and the meditation of my heart be acceptable to you, O Lord, my rock and my redeemer. Psalm 19:14"], ["dateVerse", "Sunday, January 27", "Nehemiah 8:1-3, 5-6, 8-10", "Psalm 19", "1 Corinthians 12:12-31a", "Luke 4:14-21"], ["watchD", "Uphold me according to your promise, that I may live, and let me not be put to shame in my hope. Psalm 119:116"], ["docT", "Christ said, “Look, I have set before you an open door, which no one is able to shut. I know that you have but little power, and yet you have kept my word and have not denied my name.” Revelation 3:8"], ["prayer", "Lord, with your love and sacrifice, you have opened the door which no one can shut. We await the day when we enter into your holy kingdom! Amen. "]], "28": [["dateVerse", "Monday, January 28", "Psalm 18:7–15", "1 Chronicles 26", "Acts 16:30–17:3"], ["watchD", "There are glad songs of victory in the tents of the righteous: “The right hand of the Lord is exalted; the right hand of the Lord does valiantly.” Psalm 118:15,16"], ["docT", "Rejoice in the Lord always; again I will say, Rejoice. Philippians 4:4"], ["prayer", "Loving God, we rejoice everyday by praying and singing to your glory. Help us seek you everyday and remain faithful in our praise. Amen."]], "29": [["dateVerse", "Tuesday, January 29", "Psalm 18:16–24", "1 Chronicles 27", "Acts 17:4–15"], ["watchD", "You who are the hope of Israel, its Savior in times of distress, why are you like a stranger in the land, like a traveler who stays only a night? Jeremiah 14:8 NIV"], ["docT", "Now I know only in part; then I will know fully, even as I have been fully known. 1 Corinthians 13:12"], ["prayer", "Savior, show us your ways and lighten our load as we continue to walk to your glorious light. In Jesus’ name we pray. Amen."]], "30": [["dateVerse", "Wednesday, January 30", "Psalm 18:25–29", "1 Chronicles 28,29", "Acts 17:16–28"], ["watchD", "The Lord has been mindful of us; he will bless us. Psalm 115:12"], ["docT", "Rejoice that your names are written in heaven. Luke 10:20"], ["prayer", "Lord, bless us as we live everyday to do the deeds you have set before us—for heaven has our names and is waiting for us. Amen."]], "31": [["dateVerse", "Thursday, January 31", "Psalm 18:30–36", "2 Chronicles 1,2", "Acts 17:29–18:7"], ["watchD", "Rash words are like sword thrusts, but the tongue of the wise brings healing. Proverbs 12:18"], ["docT", "Look at ships: though they are so large that it takes strong winds to drive them, yet they are guided by a very small rudder wherever the will of the pilot directs. So also the tongue is a small member, yet it boasts of great exploits. James 3:4-5"], ["prayer", "Loving Teacher, help us to pray before we speak harsh words that we cannot take back, ever-reminding us that words hurt, and we are sometimes slow to heal. Give us strength to forgive those whose words are like swords to our hearts. We look to you for your continuous love. In Jesus’ name we pray. Amen."]], "32": [["dateVerse", "Friday, February 1", "Psalm 18:37–45", "2 Chronicles 3:1–5:1", "Acts 18:8–21"], ["watchD", "Give ear to my words, O Lord; give heed to my sighing. Listen to the sound of my cry, for to you I pray. Psalm 5:1-2"], ["docT", "I believe; help my unbelief! Mark 9:24"], ["prayer", "O Lord, we trust you as the God of creation and our redeemer. Our hearts thirst for your ever-presence in our lives. Come, we pray, into our hearts and fill us anew with your spirit to enlighten our faith. In Jesus’ name we pray. Amen."]], "33": [["dateVerse", "Saturday, February 2", "Psalm 18:46–50", "2 Chronicles 5:2–6:23", "Acts 18:22–19:5"], ["watchD", "You have turned my mourning into dancing; you have taken off my sackcloth and clothed me with joy. Psalm 30:11"], ["docT", "Then one of them, when he saw that he was healed, turned back, praising God with a loud voice. Luke 17:15"], ["prayer", "Lord, with thanksgiving, praise, and worship, we approach your throne of grace, appreciating all the blessings we receive day after day. You and you alone, are the one who can make us whole in body, soul, and spirit. We adore you. In Jesus’ name we pray. Amen."]], "34": [["info", "Fourth Sunday after the Epiphany"], ["watchO", "Watchword for the week — For now we see in a mirror, dimly, but then we will see face to face. 1 Corinthians 13:12"], ["dateVerse", "Sunday, February 3", "Jeremiah 1:4-10", "Psalm 71:1-6", "1 Corinthians 13:1-13", "Luke 4:21-30"], ["watchD", "The days are surely coming, says the Lord, when I will make a new covenant with the house of Israel and the house of Judah. Jeremiah 31:31"], ["docT", "You have come to Jesus, the mediator of a new covenant. Hebrews 12:22,24"], ["prayer", "Christ our mediator, you went to the cross forgiving us and paid the price for our sin. We ask you, by the Spirit, to bring us into a renewed spiritual relationship, binding us into a new covenant with God. In your holy name we pray. Amen."]], "35": [["dateVerse", "Monday, February 4", "Psalm 19:1–6", "2 Chronicles 6:24–7:22", "Acts 19:6–20"], ["watchD", "The law of the Lord is perfect, reviving the soul. Psalm 19:7 "], ["docT", "In Christ are hidden all the treasures of wisdom and knowledge. Colossians 2:3"], ["prayer", "Christ, we come to you seeking the treasure of your wisdom and knowledge. Fill us with your truth, so that we may be your faithful followers. We ask this in your holy name. Amen."]], "36": [["dateVerse", "Tuesday, February 5", "Psalm 19:7–14", "2 Chronicles 8:1–9:12", "Acts 19:21–31"], ["watchD", "The Lord is a stronghold for the oppressed, a stronghold in times of trouble. Psalm 9:9"], ["docT", "And will not God grant justice to his chosen ones who cry to him day and night? Will he delay long in helping them? Luke 18:7"], ["prayer", "Omnipotent God, you alone are our refuge and strength. In our time of temptation, we come to you in the assurance of your power to overcome our weakness. We seek to be faithful ambassadors. In the name of Jesus we pray. Amen. "]], "37": [["dateVerse", "Wednesday, February 6", "Psalm 20", "2 Chronicles 9:13–10:19", "Acts 19:32–20:3"], ["watchD", "O land, land, land, hear the word of the Lord! Jeremiah 22:29"], ["docT", "So then let us not fall asleep as others do, but let us keep awake and be sober. 1 Thessalonians 5:6"], ["prayer", "Illuminate our heart with your truth, O God. The darkness of the world is filled with temptation that puts a skin over our eyes. Please open our eyes to the truth, so that we may ask you to help us focus on your word and approach life with love. In Jesus’ name we pray. Amen."]], "38": [["dateVerse", "Thursday, February 7", "Psalm 21", "2 Chronicles 11:1–12:12", "Acts 20:4–16"], ["watchD", "The righteous are like trees planted by streams of water, which yield their fruit in its season, and their leaves do not wither. Psalm 1:3"], ["docT", "Jesus said, “My Father is glorified by this, that you bear much fruit and become my disciples.” John 15:8"], ["prayer", "God, we were called to be disciples when we committed our lives to Jesus Christ. Empower us through the Holy Spirit to accept this challenge, so that we may graciously serve for your glory. We ask this in the name of Jesus. Amen."]], "39": [["dateVerse", "Friday, February 8", "Psalm 22:1–8", "2 Chronicles 12:13–13:22", "Acts 20:17–31"], ["watchD", "Lord, forgive the iniquity of this people according to the greatness of your steadfast love. Numbers 14:19"], ["docT", "And forgive us our debts, as we forgive our debtors. Matthew 6:12 NKJV"], ["prayer", "Forgiving God, we have good intentions every day to follow and serve you, but confronted by daily temptations, we seem to become slack in our commitment. We ask for forgiveness and for your presence to stay firm in our commitment. Help us through the presence of the Holy Spirit! Amen."]], "40": [["dateVerse", "Saturday, February 9", "Psalm 22:9–21", "2 Chronicles 14,15", "Acts 20:32–21:4"], ["watchD", "You have given me the shield of your salvation, and your right hand has supported me. Psalm 18:35"], ["docT", "Be strong in the Lord and in the strength of his power. Ephesians 6:10"], ["prayer", "Understanding Jesus, you have lived in the flesh, and you experienced the difficulties of life on earth. Give us encouragement and empower us, by the Holy Spirit, to follow in your footsteps daily. Thank you for being with us in all things. In your name we pray. Amen. "]], "41": [["info", "Fifth Sunday after the Epiphany"], ["watchO", "Watchword for the week —The Lord will fulfill his purpose for me; your steadfast love, O Lord, endures forever. Psalm 138:8"], ["dateVerse", "Sunday, February 10", "Isaiah 6:1-8(9-13)", "Psalm 138", "1 Corinthians 15:1-11", "Luke 5:1-11"], ["watchD", "Make haste to help me, O Lord, my salvation. Psalm 38:22"], ["docT", "Jesus was in the stern, asleep on the cushion; and they woke him up and said to him, “Teacher, do you not care that we are perishing?” Mark 4:38"], ["prayer", "Father, Son, and Holy Spirit, we ask for your mighty presence to direct and guide us this holy day, to keep us safe in your loving and forgiving arms. In Jesus’ name we pray. Amen."]], "42": [["dateVerse", "Monday, February 11", "Psalm 22:22–28", "2 Chronicles 16,17", "Acts 21:5–16"], ["watchD", "In your presence there is fullness of joy; in your right hand are pleasures forevermore. Psalm 16:11"], ["docT", "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. Galatians 5:22-23"], ["prayer", "Holy Spirit—you are the ever-present power that stimulates us to be productive disciples with the positive message about the fruit of the Spirit. Fill us with your power so that we may be found faithful in our mission, and experience the joy of serving you. In Jesus’ name we pray. Amen."]], "43": [["dateVerse", "Tuesday, February 12", "Psalm 22:29–31", "2 Chronicles 18", "Acts 21:17–30"], ["watchD", "The Lord our God is merciful and forgiving. Daniel 9:9 NIV"], ["docT", "Be merciful, just as your Father is merciful. Luke 6:36"], ["prayer", "God of mercy and love, there is no one greater than you. You have forgiven our sins and remember them no more. We ask that you inspire us to forgive those who have wronged us. Fill our hearts with your love, and encourage us not to be easily offended. In Jesus’ name we pray. Amen."]], "44": [["dateVerse", "Wednesday, February 13", "Psalm 23", "2 Chronicles 19:1–20:19", "Acts 21:31–22:2"], ["watchD", "You, O Lord, are our father; our Redeemer from of old is your name. Isaiah 63:16"], ["docT", "Jesus said, “Pray then in this way: Our Father in heaven, hallowed be your name.” Matthew 6:9"], ["prayer", "Creator God, you made us special in your image; a reflection of your glory. Through the ages, you protected and judged your people. Continue to be our guide and protector from this day forth. We offer this prayer in the name of Jesus. Amen."]], "45": [["dateVerse", "Thursday, February 14", "Psalm 24", "2 Chronicles 20:20–21:17", "Acts 22:3–16"], ["watchD", "Remember the former things of old; for I am God, and there is no other; I am God, and there is no one like me. Isaiah 46:9"], ["docT", "Let us look to Jesus the pioneer and perfecter of our faith. Hebrews 12:2"], ["prayer", "Lord Jesus, on this Valentine’s Day, our hearts turn to love. We humbly approach you as the love of all loves for guidance to help us love even the unlovable. We know love is all powerful, so strengthen us in your love. In the name of Jesus. Amen."]], "46": [["dateVerse", "Friday, February 15", "Psalm 25:1–7", "2 Chronicles 21:18–23:21", "Acts 22:17–29"], ["watchD", "A new heart I will give you, and a new spirit I will put within you. Ezekiel 36:26"], ["docT", "And having been set free from sin, you became slaves of righteousness. Romans 6:18 NKJV"], ["prayer", "God of redemption, freedom from sin inspires us to further adore and serve you. You have given us the coat of righteousness. In appreciation for your great love and mercy, we come to serve you through all the days of our lives. Accept us as your faithful servants. We pray in Jesus’ name. Amen. "]], "47": [["dateVerse", "Saturday, February 16", "Psalm 25:8–22", "2 Chronicles 24:1–25:4", "Acts 22:30–23:11"], ["watchD", "Praise the Lord, all you nations! Extol him, all you peoples! Psalm 117:1"], ["docT", "There is one God and Father of all, who is above all and through all and in all. Ephesians 4:6"], ["prayer", "Creative God, we know you are the one true God. We are grateful to know that we are a part of your creation and your loving care given so generously. We praise you and thank you for bringing us into your Kingdom. In Jesus’ name we pray. Amen."]], "48": [["info", "Sixth Sunday after the Epiphany"], ["watchO", "Watchword for the week — Blessed are those who trust in the Lord, whose trust is the Lord. Jeremiah 17:7"], ["dateVerse", "Sunday, February 17", "Jeremiah 17:5-10", "Psalm 1", "1 Corinthians 15:12-20", "Luke 6:17-26"], ["watchD", "Bless our God, O peoples, let the sound of his praise be heard, who has kept us among the living, and has not let our feet slip. Psalm 66:8-9"], ["docT", "We, who were the first to set our hope on Christ, might live for the praise of his glory. Ephesians 1:12"], ["prayer", "Giver of life, many of us will come to worship today to sing songs of joy as an expression of our hearts. As we praise you, our hearts will be blessed, overflowing with your love that was given by your son on the cross. In Jesus’ name we rejoice. Amen."]], "49": [["dateVerse", "Monday, February 18", "Psalm 26", "2 Chronicles 25:5–26:15", "Acts 23:12–24"], ["watchD", "God wounds, but he binds up; he strikes, but his hands heal. Job 5:18"], ["docT", "Humble yourselves therefore under the mighty hand of God, so that he may exalt you in due time. Cast all your anxiety on him, because he cares for you. 1 Peter 5:6-7"], ["prayer", "God of compassion, we come humbly before you, asking your assistance in comforting us in grief, healing us in pain, encouraging us in sorrow, and loving us through the strains of life. In Jesus’ name we pray. Amen."]], "50": [["dateVerse", "Tuesday, February 19", "Psalm 27:1–6", "2 Chronicles 26:16–28:8", "Acts 23:25–24:3"], ["watchD", "My soul languishes for your salvation; I hope in your word. Psalm 119:81"], ["docT", "Jesus said, “If you continue in my word, you are truly my disciples.” John 8:31"], ["prayer", "God of hope, we have the assurance of your promise of salvation and eternal life affirmed in Christ. As we read your word daily, give us understanding that we may grasp the truth revealed through your scriptures. In Jesus’ name we pray. Amen."]], "51": [["dateVerse", "Wednesday, February 20", "Psalm 27:7–14", "2 Chronicles 28:9–29:19", "Acts 24:4–16"], ["watchD", "I stretch out my hands to you; my soul thirsts for you like a parched land. Psalm 143:6"], ["docT", "Jesus said, “Come to me, all you that are weary and are carrying heavy burdens, and I will give you rest.” Matthew 11:28"], ["prayer", "We come to you, Lord, for the storms of life are raging, and we know you, only you, can anchor our souls on the solid rock of Jesus. Help us to trust and believe as we experience the struggles in life. We ask this in the precious name of Jesus. Amen."]], "52": [["dateVerse", "Thursday, February 21", "Psalm 28", "2 Chronicles 29:20–30:27", "Acts 24:17–27"], ["watchD", "But who can detect their errors? Clear me from hidden faults. Psalm 19:12"], ["docT", "Jesus said, “Anyone who comes to me I will never drive away.” John 6:37"], ["prayer", "Omniscient God, you know all things. Since we cannot hide anything, forgive us our faults and shape us into active, faithful servants. We also know that you will forgive and will always keep us close to you. Help us to stay by your side. In Jesus’ name. Amen."]], "53": [["dateVerse", "Friday, February 22", "Psalm 29", "2 Chronicles 31", "Acts 25:1–15"], ["watchD", "No inhabitant will say, “I am sick”; the people who live there will be forgiven their iniquity. Isaiah 33:24"], ["docT", "Through our Lord Jesus Christ we have obtained access to this grace in which we stand. Romans 5:1-2"], ["prayer", "Redeeming Lord, you gave your all so that we might be forgiven. We have no other savior but Jesus. Our hope is built on Christ, and we turn our lives anew to you. Strengthen and bless us for your sake, O Christ. Amen."]], "54": [["dateVerse", "Saturday, February 23", "Psalm 30:1–5", "2 Chronicles 32", "Acts 25:16–26:1"], ["watchD", "“Behold, the days are coming,” says the Lord, “When the plowman shall overtake the reaper, and the treader of grapes him who sows seed; the mountains shall drip with sweet wine, and all the hills shall flow with it. I will bring back the captives of My people Israel; they shall build the waste cities and inhabit them; they shall plant vineyards and drink wine from them; they shall also make gardens and eat fruit from them.” Amos 9:13-14 NKJV"], ["docT", "The angel showed me on either side of the river is the tree of life with its twelve kinds of fruit, producing its fruit each month; and the leaves of the tree are for the healing of the nations. Revelation 22:1, 2"], ["prayer", "Giving Lord, thank you for the bounteous life we receive from your gracious hand. Bless and guide us on to the promised land. In Jesus’ name we pray. Amen."]], "55": [["info", "Seventh Sunday after the Epiphany"], ["watchO", "Watchword for the week — Jesus said, “Be merciful, just as your Father is merciful.” Luke 6:36"], ["dateVerse", "Sunday, February 24", "Genesis 45:3-11,15", "Psalm 37:1-11,39-40", "1 Corinthians 15:35-38,42-50", "Luke 6:27-38"], ["watchD", "I will sing of your steadfast love, O Lord forever; with my mouth I will proclaim your faithfulness to all generations. Psalm 89:1"], ["docT", "From his fullness we have all received, grace upon grace. John 1:16"], ["prayer", "Forgiving God, you took sinners who were spiritually bankrupt and made them whole. By your mercy given through Christ, direct us in a way to exemplify mercy to those with whom we are in contact—today and always. This we pray in the name of Jesus. Amen."]], "56": [["dateVerse", "Monday, February 25", "Psalm 30:6–12", "2 Chronicles 33:1–34:7", "Acts 26:2–14"], ["watchD", "“In those days, at that time,” declares the Lord, “search will be made for Israel’s guilt, but there will be none, and for the sins of Judah, but none will be found, for I will forgive. Jeremiah 50:20 NIV"], ["docT", "We even boast in God through our Lord Jesus Christ, through whom we have now received reconciliation. Romans 5:11"], ["prayer", "Loving God, our hearts overflow with gratitude and adoration. We know our sins are forgiven and we can lean on your everlasting arms, trusting in your care. This keeps us always rejoicing in our hearts. Thank you. In Jesus’ name we pray. Amen. "]], "57": [["dateVerse", "Tuesday, February 26", "Psalm 31:1–5", "2 Chronicles 34:8–33", "Acts 26:15–27"], ["watchD", "The alien who resides with you shall be to you as the citizen among you. Leviticus 19:34"], ["docT", "Beloved, you do faithfully whatever you do for the friends, even though they are strangers to you; they have testified to your love before the church. You will do well to send them on in a manner worthy of God. 3 John 5-6"], ["prayer", "Omnipresent God, you have cleansed the hearts of all who call upon you. You then called and received us into your heavenly church. Send us forth to help join all your children into one accord. We ask this in the name of Jesus. Amen."]], "58": [["dateVerse", "Wednesday, February 27", "Psalm 31:6–9", "2 Chronicles 35", "Acts 26:28–27:8"], ["watchD", "I will seek the lost, and I will bring back the strayed, and I will bind up the injured, and I will strengthen the weak. Ezekiel 34:16"], ["docT", "Jesus said, “What do you think? If a shepherd has a hundred sheep, and one of them has gone astray, does he not leave the ninety-nine on the mountains and go in search of the one that went astray?” Matthew 18:12"], ["prayer", "Shepherd of the sheep, we find comfort and assurance as we continue in your fold. Give us courage and incentive to share your glorious love and mercy as faithful followers. In Jesus’ name we pray. Amen."]], "59": [["dateVerse", "Thursday, February 28", "Psalm 31:10–20", "2 Chronicles 36", "Acts 27:9–20"], ["watchD", "All people are grass, their constancy is like the flower of the field. The grass withers, the flower fades; but the word of our God will stand forever. Isaiah 40:6,8"], ["docT", "Jesus said, “Heaven and earth will pass away, but my words will not pass away.” Matthew 24:35"], ["prayer", "Holy God, you have given us your word to enlighten, to teach, to equip us for living our lives according to your will, and to sustain us in this world. Shower the Holy Spirit upon us to enable us to live the truth revealed in your word. In the name of the Father, the Son, and the Holy Spirit. Amen."]], "60": [["info", "March 1, 1457:"], ["info", "Beginning of the Unity of the Brethren in Bohemia"], ["dateVerse", "Friday, March 1", "Psalm 31:21–24", "Ezra 1,2", "Acts 27:21–38"], ["watchD", "The Lord makes a way in the sea, a path in the mighty waters. Isaiah 43:16"], ["docT", "Don’t be afraid of your enemies; always be courageous. Philippians 1:28 GNT"], ["prayer", "God of courage, we pray that you free us from the grip of fear. You make a way for us even when we cannot see it. Help us to live in your peace and find comfort in your guidance. Amen."]], "61": [["dateVerse", "Saturday, March 2", "Psalm 32", "Ezra 3", "Acts 27:39–28:6"], ["watchD", "One does not live by bread alone, but by every word that comes from the mouth of the Lord. Deuteronomy 8:3"], ["docT", "Jesus said: “The words that I have spoken to you are spirit and life.” John 6:63"], ["prayer", "God our provider, help us to seek the true nourishment that only comes from you. Center us on your ever-present word that brings life, wholeness, and peace. In Jesus’ name we pray. Amen."]], "62": [["info", "Last Sunday after the Epiphany"], ["watchO", "Watchword for the week — And when they looked up, they saw no one except Jesus alone. Matthew 17:8"], ["dateVerse", "Sunday, March 3", "Exodus 34:29-35", "Psalm 99", "2 Corinthians 3:12-4:2", "Luke 9:28-36,(37-43)"], ["watchD", "He stands at the right hand of the needy, to save them from those who would condemn them to death. Psalm 109:31"], ["docT", "When they kept on questioning Jesus, he straightened up and said to them, “Let anyone among you who is without sin be the first to throw a stone at her.” John 8:7"], ["prayer", "God of forgiveness, you call us to forgive others the way you have forgiven us. Free us from our judgment and condemnation of others. Let us be instruments of your reconciliation to those in need. Amen."]], "63": [["dateVerse", "Monday, March 4", "Psalm 33:1–5", "Ezra 4", "Acts 28:7–16"], ["watchD", "Who is like the Lord our God, who is seated on high, who looks far down on the heavens and the earth? He raises the poor from the dust. Psalm 113:5-7"], ["docT", "Jesus Christ, though he was in the form of God, did not regard equality with God as something to be exploited, but emptied himself, taking the form of a slave, being born in human likeness. Philippians 2:6-7"], ["prayer", "God, thank you for coming to us in the flesh. Through Christ, you gave up heaven to come to us in love. We pray that we may love others the way you have loved us. Thank you for dwelling among us now. Amen."]], "64": [["dateVerse", "Tuesday, March 5", "Psalm 33:6–11", "Ezra 5:1–6:12", "Acts 28:17–31"], ["watchD", "The path of the righteous is like the light of dawn, which shines brighter and brighter until full day. Proverbs 4:18"], ["docT", "Jesus said, “Whoever follows me will never walk in darkness but will have the light of life.” John 8:12"], ["prayer", "God, you are the light of the world that cast out all darkness. We pray that our lives be lighthouses that send forth your hope into the world, so that others may be drawn into your redeeming love. Amen."]], "65": [["dateVerse", "Wednesday, March 6", "Psalm 33:12–22", "Ezra 6:13–7:28", "Romans 1:1–12"], ["specialVerse", "Ash Wednesday", "Joel 2:1-2,12-17", "Psalm 51:1-17", "2 Corinthians 5:20b-6:10", "Matthew 6:1-6,16-21"], ["watchD", "Let your face shine upon your servant; save me in your steadfast love. Psalm 31:16"], ["docT", "My soul magnifies the Lord, and my spirit rejoices in God my Savior, for he has looked with favor on the lowliness of his servant. Luke 1:46-48"], ["prayer", "Loving and steadfast God, today we remember that from dust we came, and to dust we shall return. Let our fragile lives remind us to embrace everyday as precious. We pray that our spirits will rest in you, and that our lives will magnify your grace. In Jesus’ name we pray. Amen."]], "66": [["dateVerse", "Thursday, March 7", "Psalm 34:1–7", "Ezra 8:1–20", "Romans 1:13–25"], ["watchD", "The Lord is a refuge for his people, a stronghold for the people of Israel. Joel 3:16"], ["docT", "We who have found safety with him are greatly encouraged to hold firmly to the hope placed before us. We have this hope as an anchor for our lives. Hebrews 6:18-19 GNT"], ["prayer", "God of hope, we take refuge in your compassion. Help us to never value our safety more than our devotion to you. Give us the strength to fight the injustices of this world, and to free those who are oppressed. In your trustworthy name. Amen."]], "67": [["dateVerse", "Friday, March 8", "Psalm 34:8–18", "Ezra 8:21–10:6", "Romans 1:26–2:4"], ["watchD", "I am the Lord, that is my name; my glory I give to no other, nor my praise to idols. Isaiah 42:8"], ["docT", "For us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:6"], ["prayer", "Creator and sustainer God, let us never forget your name. Free us from the idols of wealth, greed, and comfort. Help us to put your will above all others. In Jesus’ name we pray. Amen."]], "68": [["dateVerse", "Saturday, March 9", "Psalm 34:19–22", "Ezra 10:7–44", "Romans 2:5–16"], ["watchD", "Just as I have watched over them to pluck up and break down, so I will watch over them to build and to plant, says the Lord. Jeremiah 31:28"], ["docT", "God has destined us not for wrath but for obtaining salvation through our Lord Jesus Christ. 1 Thessalonians 5:9"], ["prayer", "God of salvation, you came to us in our time of need. Thank you for the gift of redemption and for saving us from ourselves. Help us to build your kingdom here on earth, and allow your love to flourish in our world. Amen."]], "69": [["info", "First Sunday in Lent"], ["watchO", "Watchword for the week — No one who believes in Christ will be put to shame. Romans 10:11"], ["dateVerse", "Sunday, March 10", "Deuteronomy 26:1-11", "Psalm 91:1-2,9-16", "Romans 10:8b-13", "Luke 4:1-13"], ["watchD", "When I kept silent about my sin, my body wasted away. For day and night your hand was heavy upon me. Then I acknowledged my sin to you. Psalm 32:3,4,5 NASB"], ["docT", "Jesus said, “There is joy in the presence of the angels of God over one sinner who repents.” Luke 15:10"], ["prayer", "God of forgiveness, we confess to you all the ways we have fallen short of your desire for our lives. God, we lift up to you the ways we have failed ourselves, our loved ones, and you. Give us the strength and endurance to turn from our failures and return to you. In Jesus’ name we pray. Amen."]], "70": [["dateVerse", "Monday, March 11", "Psalm 35:1–10", "Nehemiah 1:1–2:10", "Romans 2:17–3:2"], ["watchD", "Then Jacob woke from his sleep and said, “Surely the Lord is in this place—and I did not know it!” Genesis 28:16"], ["docT", "See, now is the acceptable time; see, now is the day of salvation! 2 Corinthians 6:2"], ["prayer", "God, you come to us in our times of great need. Thank you for meeting us in our struggles and heartaches. Help us to remember that your day of salvation is with us now. In your gracious name we pray. Amen."]], "71": [["dateVerse", "Tuesday, March 12", "Psalm 35:11–18", "Nehemiah 2:11–3:32", "Romans 3:3–18"], ["watchD", "You shall not covet your neighbor’s wife. Deuteronomy 5:21 NIV"], ["docT", "Love does no wrong to a neighbor. Romans 13:10"], ["prayer", "God of our neighborhood, empower us to be ambassadors for your love in our local communities. Do not allow greed to invalidate our witness to you. Turn our sidewalks into sanctuaries of your hope and reconciliation. Amen."]], "72": [["dateVerse", "Wednesday, March 13", "Psalm 35:19–28", "Nehemiah 4", "Romans 3:19–31"], ["watchD", "My heart shall rejoice in your salvation. Psalm 13:5"], ["docT", "Are any among you suffering? They should pray. Are any cheerful? They should sing songs of praise. James 5:13"], ["prayer", "God, may we praise you, both in times of joy and sadness. May we lift our hands in worship to you when we cry and when we laugh, because your salvation is steadfast. In Jesus’ name we pray. Amen. "]], "73": [["dateVerse", "Thursday, March 14", "Psalm 36", "Nehemiah 5:1–6:14", "Romans 4:1–12"], ["watchD", "I am a companion of all who fear you, of those who keep your precepts. Psalm 119:63"], ["docT", "Let the word of Christ dwell in you richly; teach and admonish one another in all wisdom. Colossians 3:16"], ["prayer", "God of wisdom, help us to center our communities of faith around your word and your teaching. Give our leaders discernment on how to guide us all into greater awareness of your presence. Amen."]], "74": [["dateVerse", "Friday, March 15", "Psalm 37:1–6", "Nehemiah 6:15–7:73a", "Romans 4:13–25"], ["watchD", "Act with justice and righteousness, and deliver from the hand of the oppressor anyone who has been robbed. And do no wrong or violence to the alien, the orphan, and the widow. Jeremiah 22:3"], ["docT", "Live as children of light—for the fruit of the light is found in all that is good and right and true. Ephesians 5:8-9"], ["prayer", "God of justice, you seek the welfare and prosperity of all of the earth. Help us to produce the good fruit that fights oppression, seeks justice, and proclaims truth. Amen."]], "75": [["dateVerse", "Saturday, March 16", "Psalm 37:7–15", "Nehemiah 7:73b–8:18", "Romans 5:1–11"], ["watchD", "The Lord is righteous, He loves righteousness. Psalm 11:7 NASB"], ["docT", "You shall be perfect, just as your Father in heaven is perfect. Matthew 5:48 NKJV"], ["prayer", "Righteous God, you are our source of strength. Help us to walk in the way of Jesus. Guide us in the way of Christ. In your holy name we pray. Amen."]], "76": [["info", "Second Sunday in Lent"], ["watchO", "Watchword for the week — The Lord is my light and my salvation; whom shall I fear? Psalm 27:1"], ["dateVerse", "Sunday, March 17", "Genesis 15:1-12,17-18", "Psalm 27", "Philippians 3:17-4:1", "Luke 13:31-35"], ["watchD", "Fathers make known to children your faithfulness. Isaiah 38:19"], ["docT", "Jesus said, “Let the little children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.” Matthew 19:14 NIV"], ["prayer", "Abba God, you call us your beloved children; let us never lose our childlike faith. Help us to show the next generation your loving-kindness. In Jesus’ name we pray. Amen."]], "77": [["dateVerse", "Monday, March 18", "Psalm 37:16–22", "Nehemiah 9:1–10:27", "Romans 5:12–6:4"], ["watchD", "Woe to those who make unjust laws, to deprive the poor of their rights and withhold justice from the oppressed. Isaiah 10:1,2 NIV"], ["docT", "Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God—what is good and acceptable and perfect. Romans 12:2"], ["prayer", "God, give us the strength to seek justice in our world. May we be advocates for the poor and oppressed. Do not let us give in to the greed of this world. Transform us to transform this world. In Jesus’ name we pray. Amen."]], "78": [["dateVerse", "Tuesday, March 19", "Psalm 37:23–26", "Nehemiah 10:28–11:36", "Romans 6:5–16"], ["watchD", "Then all flesh shall know that I am the Lord your Savior, and your Redeemer. Isaiah 49:26"], ["docT", "The kingdom of heaven may be compared to a king who gave a wedding banquet for his son. His slaves went out into the streets and gathered all whom they found, both good and bad; so the wedding hall was filled with guests. Matthew 22:2,10"], ["prayer", "God of our redemption, you give good things to all your children. Thank you for being the God of abundance. Let us live into your abundance. In Jesus’ name we pray. Amen."]], "79": [["dateVerse", "Wednesday, March 20", "Psalm 37:27–33", "Nehemiah 12:1–43", "Romans 6:17–7:6"], ["watchD", "All that the Lord has spoken we will do, and we will be obedient. Exodus 24:7"], ["docT", "Jesus said, “Whoever does the will of my Father in heaven is my brother and sister and mother.” Matthew 12:50"], ["prayer", "God, help us to be obedient to your law of love. Let us live as members of your beloved family, and follow the way of Jesus. Amen."]], "80": [["dateVerse", "Thursday, March 21", "Psalm 37:34–40", "Nehemiah 12:44–13:14", "Romans 7:7–20"], ["watchD", "The Lord lifts up those who are bowed down. Psalm 146:8"], ["docT", "For this reason, brothers and sisters, during all our distress and persecution we have been encouraged about you through your faith. For we now live, if you continue to stand firm in the Lord. 1 Thessalonians 3:7-8"], ["prayer", "God of the lowly, you find us in our time of greatest need. Give us the strength to stand for your justice and proclaim your righteousness. In Jesus’ name we pray. Amen."]], "81": [["dateVerse", "Friday, March 22", "Psalm 38:1–8", "Nehemiah 13:15–31", "Romans 7:21–8:8"], ["watchD", "Let your work be manifest to your servants, and your glorious power to their children. Psalm 90:16"], ["docT", "Look at the birds of the air; they neither sow nor reap nor gather into barns, and yet your heavenly Father feeds them. Are you not of more value than they? Matthew 6:26"], ["prayer", "God, you give us all that we need. Help us to rely on you every day and not give in to the temptation of greed. In your generous name we pray. Amen."]], "82": [["dateVerse", "Saturday, March 23", "Psalm 38:9–16", "Esther 1", "Romans 8:9–19"], ["watchD", "You guide me with your counsel, and afterwards you will receive me with honor. Psalm 73:24"], ["docT", "Paul wrote: I have fought the good fight, I have finished the race, I have kept the faith. From now on there is reserved for me the crown of righteousness, which the Lord, the righteous judge, will give me on that day. 2 Timothy 4:7-8"], ["prayer", "God of faithfulness, you travel with us until the end. Give us the endurance to seek you every step of our lives, and follow the path you have set before us. In Jesus’ name we pray. Amen."]], "83": [["info", "Third Sunday in Lent"], ["watchO", "Watchword for the week — Seek the Lord while he may be found, call upon him while he is near. Isaiah 55:6"], ["dateVerse", "Sunday, March 24", "Isaiah 55:1-9", "Psalm 63:1-8", "1 Corinthians 10:1-13", "Luke 13:1-9"], ["watchD", "O Lord, I am oppressed; be my security! Isaiah 38:14"], ["docT", "When Jesus entered Peter’s house, he saw his mother-in-law lying in bed with a fever; he touched her hand, and the fever left her, and she got up and began to serve him. Matthew 8:14-15"], ["prayer", "God of healing and comfort, allow us to find our rest in you. Ease our anxieties and seek us out when we are lonely. In the name of Christ Jesus. Amen."]], "84": [["dateVerse", "Monday, March 25", "Psalm 38:17–22", "Esther 2:1–18", "Romans 8:20–33"], ["watchD", "Your people say, “The way of the Lord is not just,” when it is their own way that is not just. Ezekiel 33:17"], ["docT", "Jesus said, “If you love me, you will keep my commandments.” John 14:15"], ["prayer", "God of love, your way is true. Do not let us follow the ways that lead to destruction, but let us keep our eyes on you. In Jesus’ name we pray. Amen."]], "85": [["dateVerse", "Tuesday, March 26", "Psalm 39:1–6", "Esther 2:19–3:15", "Romans 8:34–9:7"], ["watchD", "Do not remember the sins of my youth or my transgressions; according to your steadfast love remember me, for your goodness’ sake, O Lord! Psalm 25:7"], ["docT", "God, who is rich in mercy, out of the great love with which he loved us even when we were dead through our trespasses, made us alive together with Christ—by grace you have been saved. Ephesians 2:4-5"], ["prayer", "God of forgiveness, you do not remember the error of our ways, but invite us to the path of new life. Allow us to follow the way of Jesus that leads to love. Amen."]], "86": [["dateVerse", "Wednesday, March 27", "Psalm 39:7–13", "Esther 4,5", "Romans 9:8–21"], ["watchD", "O greatly beloved, fear not! Peace be to you; be strong, yes, be strong! Daniel 10:19 NKJV"], ["docT", "Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled, and do not let them be afraid. John 14:27"], ["prayer", "God of peace, your way is not like the way of the world. Do not let fear control us, but let us stand strong in your loving kindness. Amen."]], "87": [["dateVerse", "Thursday, March 28", "Psalm 40:1–8", "Esther 6,7", "Romans 9:22–33"], ["watchD", "Do not put the Lord your God to the test. Deuteronomy 6:16"], ["docT", "Your will be done, on earth as it is in heaven. Matthew 6:10"], ["prayer", "God of steadfast love, your way is secure and your path leads to abundant life. Let us not question our love for you and your people. In Jesus’ name we pray. Amen."]], "88": [["dateVerse", "Friday, March 29", "Psalm 40:9–17", "Esther 8:1–9:17", "Romans 10:1–13"], ["watchD", "He shall stand and feed his flock in the strength of the Lord. Micah 5:4"], ["docT", "All the peoples of the earth will see the Son of Man coming on the clouds of heaven, with power and great glory. Matthew 24:30 NIV"], ["prayer", "God of provision, you sustain us daily. Let us never turn from you; let us seek you until the end of days. Amen."]], "89": [["dateVerse", "Saturday, March 30", "Psalm 41", "Esther 9:18–10:3", "Romans 10:14–11:6"], ["watchD", "You shall not follow a majority in wrongdoing. Exodus 23:2"], ["docT", "Keep on loving one another as brothers and sisters. Hebrews 13:1 NIV"], ["prayer", "God, let us not follow the ways of the world that lead to disunity, but rather lead us to the way of Jesus. May we learn to love one another as ourselves, and care for the least of those among us. In your name we humbly pray. Amen."]], "90": [["info", "Fourth Sunday in Lent"], ["watchO", "Watchword for the week — If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["dateVerse", "Sunday, March 31", "Joshua 5:9-12", "Psalm 32", "2 Corinthians 5:16-21", "Luke 15:1-3,11b-32"], ["watchD", "Whoever loves money never has enough; whoever loves wealth is never satisfied with their income. Ecclesiastes 5:10 NIV"], ["docT", "Make purses for yourselves that do not wear out, an unfailing treasure in heaven, where no thief comes near and no moth destroys. For where your treasure is, there your heart will be also. Luke 12:33-34"], ["prayer", "God, you are enough. Let us not seek after money or wealth that will never satisfy; instead let us focus on your treasures of faith, hope, and love that will never be destroyed. Amen. "]], "91": [["dateVerse", "Monday, April 1", "Psalm 42", "Job 1,2", "Romans 11:7–18"], ["watchD", "O Lord, you will hear the desire of the meek; you will strengthen their heart. Psalm 10:17"], ["docT", "May the God of hope fill you with all joy and peace in believing, so that you may abound in hope by the power of the Holy Spirit. Romans 15:13"], ["prayer", "Dear God, help us to trust in the power of your Holy Spirit, which is our comfort, our ever-present joy, and our source of peace. Open our hearts, Lord Jesus. Your Holy Spirit is ever-present. Amen."]], "92": [["dateVerse", "Tuesday, April 2", "Psalm 43", "Job 3,4", "Romans 11:19–32"], ["watchD", "When the Israelites cried out to the Lord, the Lord raised up a deliverer, who delivered them. Judges 3:9"], ["docT", "Jesus Christ is the faithful witness, the firstborn of the dead, and the ruler of the kings of the earth. To him who loves us and freed us from our sins by his blood, to him be glory and dominion forever and ever. Revelation 1:5-6"], ["prayer", "Dear Lord, when the Israelites cried out, you delivered them from their suffering. You even sent your son that all may be delivered. Thank you for being ever-faithful to those who cry, “Lord, Lord!” Amen."]], "93": [["dateVerse", "Wednesday, April 3", "Psalm 44:1–8", "Job 5,6", "Romans 11:33–12:8"], ["watchD", "Who is like you, O Lord, among the gods? Who is like you, majestic in holiness, awesome in splendor, doing wonders? Exodus 15:11"], ["docT", "We know also that the Son of God has come and has given us understanding, so that we may know him who is true. Little children, keep yourselves from idols. 1 John 5:20,21"], ["prayer", "Heavenly, almighty God, you are the one and only God—majestic and mighty—mighty enough to send your son in humble flesh, so that we never need to gaze upon idols but simply bask in your glory. In Jesus’ name we pray. Amen."]], "94": [["dateVerse", "Thursday, April 4", "Psalm 44:9–16", "Job 7", "Romans 12:9–21"], ["watchD", "They say, “Our bones are dried up, and our hope is lost; we are cut off completely.” Therefore prophesy, and say to them, “Thus says the Lord God: I am going to open your graves, and bring you up from your graves, O my people.” Ezekiel 37:11-12"], ["docT", "Jesus said, “Very truly, I tell you, the hour is coming, and is now here, when the dead will hear the voice of the Son of God, and those who hear will live.” John 5:25"], ["prayer", "Dear God, even dead bones rise from the grave to hear your voice. Open our ears now, even as we are in the flesh, so that we may hear your sweet voice, O Jesus, our savior. Amen. "]], "95": [["dateVerse", "Friday, April 5", "Psalm 44:17–26", "Job 8", "Romans 13"], ["watchD", "I will not let you go, unless you bless me. Genesis 32:26"], ["docT", "Then suddenly a woman who had been suffering from hemorrhages for twelve years came up behind him and touched the fringe of his cloak, for she said to herself, “If I only touch his cloak, I will be made well.” Jesus turned, and seeing her he said, “Take heart, daughter; your faith has made you well.” And instantly the woman was made well. Matthew 9:20-22"], ["prayer", "Dear Jesus, show us the hem of your garment. We will place our fingers upon it, trusting your infinite power to heal. In your name we pray. Amen."]], "96": [["dateVerse", "Saturday, April 6", "Psalm 45:1–9", "Job 9", "Romans 14:1–12"], ["watchD", "I know that you can do all things, and that no purpose of yours can be thwarted. Job 42:2"], ["docT", "The centurion answered, “Lord, I am not worthy to have you come under my roof; but only speak the word, and my servant will be healed.” Matthew 8:8"], ["prayer", "The power and the glory are yours, dear Lord. Heal us even when we hide from you. In Jesus’ name we pray. Amen."]], "97": [["info", "Fifth Sunday in Lent"], ["watchO", "Watchword for the week — Forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal for the prize of the heavenly call of God in Christ Jesus. Philippians 3:13,14"], ["dateVerse", "Sunday, April 7", "Isaiah 43:16-21", "Psalm 126", "Philippians 3:4b-14", "John 12:1-8"], ["watchD", "My heart and my flesh sing for joy to the living God. Psalm 84:2"], ["docT", "Jesus said, “Abide in my love. I have said these things to you so that my joy may be in you, and that your joy may be complete.” John 15:9,11"], ["prayer", "Dear God, you are the song of songs and the joy of joys. Draw us into your perfect harmony, so that we may dwell with you in joy forever. In Jesus’ name we pray. Amen."]], "98": [["dateVerse", "Monday, April 8", "Psalm 45:10–17", "Job 10", "Romans 14:13–15:2"], ["watchD", "My soul waits for the Lord more than those who watch for the morning. Psalm 130:6"], ["docT", "Beloved, build yourselves up on your most holy faith; pray in the Holy Spirit; keep yourselves in the love of God; look forward to the mercy of our Lord Jesus Christ. Jude 20-21"], ["prayer", "Dear Lord, we eagerly await the warmth and light of the sun each morning. We do not doubt that the sun will rise. Help us to grow in faith that you are ever-present, bringing perfect light and warmth. In Jesus’ name we pray. Amen."]], "99": [["dateVerse", "Tuesday, April 9", "Psalm 46", "Job 11:1–12:12", "Romans 15:3–16"], ["watchD", "Thus says the Lord: I will encamp at my house as a guard. Zechariah 9:8"], ["docT", "Jesus said to Peter, “The gates of Hades will not prevail against my church.” Matthew 16:18"], ["prayer", "Lord, if you are our guard, who can prevail against us? Help us to remember in each moment that we are within your all-encompassing protection. In Jesus’ name we pray. Amen."]], "100": [["dateVerse", "Wednesday, April 10", "Psalm 47", "Job 12:13–13:19", "Romans 15:17–29"], ["watchD", "It was my hands that stretched out the heavens, and I commanded all their host. Isaiah 45:12"], ["docT", "In Christ all things in heaven and on earth were created, things visible and invisible, whether thrones or dominions or rulers or powers—all things have been created through him and for him. Colossians 1:16"], ["prayer", "Dear God, our universe is created by you. As your children and heirs, there is no thought we can have, no place we can go, and no action we can take that will separate us from you. You are all! In Jesus’ name we pray. Amen. "]], "101": [["dateVerse", "Thursday, April 11", "Psalm 48", "Job 13:20–14:22", "Romans 15:30–16:7"], ["watchD", "Good and upright is the Lord; therefore he instructs sinners in the way. Psalm 25:8"], ["docT", "Peter came and said to Jesus, “Lord, if another member of the church sins against me, how often should I forgive? As many as seven times?” Jesus said to him, “Not seven times, but, I tell you, seventy-seven times.” Matthew 18:21-22"], ["prayer", "Gracious God, search our hearts for those places that have become hard as rocks. It is up to us to pull back the curtain of our own fear. You will do the rest. Forgiveness is for all. In Jesus’ name we pray. Amen."]], "102": [["dateVerse", "Friday, April 12", "Psalm 49:1–12", "Job 15,16", "Romans 16:8–20"], ["watchD", "God, from the depths of the earth you will bring me up again. You will increase my honor, and comfort me once again. Psalm 71:20-21"], ["docT", "So it is not the will of your Father in heaven that one of these little ones should be lost. Matthew 18:14"], ["prayer", "Dear God, thank you for rescuing us, even from the darkest places possible. Never let us forget that we too are the little ones that you will not lose; even me, Lord, even me. In Jesus’ name we pray. Amen."]], "103": [["dateVerse", "Saturday, April 13", "Psalm 49:13–20", "Job 17,18", "Romans 16:21–1", "Corinthians 1:1–9"], ["watchD", "A soft answer turns away wrath, but a harsh word stirs up anger. Proverbs 15:1"], ["docT", "Blessed are the peacemakers, for they will be called children of God. Matthew 5:9"], ["prayer", "Dear God, we are frail and prone to angry words. Teach us as your children to follow the perfect life of your son, Jesus Christ, our Lord. It is in his name that we pray. Amen."]], "104": [["info", "Palm Sunday"], ["watchO", "Watchword for the week — Let those who fear the Lord say, “His steadfast love endures forever.” Psalm 118:14"], ["dateVerse", "Sunday, April 14", "Isaiah 50:4-9a", "Psalm 118:1-2,19-29", "Philippians 2:5-11", "Luke 19:28-40"], ["watchD", "Look down from your holy habitation, from heaven, and bless your people Israel. Deuteronomy 26:15"], ["docT", "He has helped his servant Israel, in remembrance of his mercy. Luke 1:54"], ["prayer", "Lord, we wait for a noble king. You arrive on a donkey. When we contemplate your humble birth in a stable, we should not be surprised. We should simply lay down our palm branches and shout, “Hosanna, blessed is he!” In Jesus’ name we pray. Amen."]], "105": [["dateVerse", "Monday, April 15", "Psalm 50:1–6", "Job 19", "1 Corinthians 1:10–20"], ["watchD", "Will you not revive us again, so that your people may rejoice in you? Psalm 85:6"], ["docT", "Jesus said, “You now have sorrow; but I will see you again and your heart will rejoice, and your joy no one will take from you.” John 16:22 NKJV"], ["prayer", "Dear Lord, without fail you walk to the cross, and we watch with sinking hearts. We are appalled. Yet your message never changes: we will be together in paradise and we will rejoice. Forgive us when we forget. In Jesus’ name we pray. Amen."]], "106": [["dateVerse", "Tuesday, April 16", "Psalm 50:7–15", "Job 20", "1 Corinthians 1:21–2:2"], ["watchD", "God, you know my folly; the wrongs I have done are not hidden from you. Psalm 69:5"], ["docT", "Rescue us from the evil one. Matthew 6:13"], ["prayer", "Our Father who dwells in heaven, your name is hallowed. How foolish we are to think we can hide from you. Help us to trust your words. You have promised that your kingdom has come. It is so. In Jesus’ name we pray. Amen."]], "107": [["dateVerse", "Wednesday, April 17", "Psalm 50:16–23", "Job 21", "1 Corinthians 2:3–16"], ["watchD", "One who rules over people justly, ruling in the fear of God, is like the light of morning, like the sun rising. 2 Samuel 23:3-4"], ["docT", "You are the light of the world. A city built on a hill cannot be hid. Matthew 5:14"], ["prayer", "This week, we are particularly mindful that you, God of humility and God of true power, are the ruler of our hearts, minds, and souls. Lead us as we follow you in life and in death. In Jesus’ name we pray. Amen."]], "108": [["info", "Maundy Thursday "], ["watchO", "Watchword for Maundy Thursday — He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4"], ["dateVerse", "Thursday, April 18", "Psalm 51:1–6", "Job 22,23", "1 Corinthians 3:1–11"], ["watchD", "Mortals look on the outward appearance, but the Lord looks on the heart. 1 Samuel 16:7"], ["docT", "The Lord turned and looked at Peter. Then Peter remembered the word of the Lord, how he had said to him, “Before the cock crows today, you will deny me three times.” And he went out and wept bitterly. Luke 22:61-62"], ["prayer", "Lord, you see the whole of us. Polish our inmost hearts so that we shine with your love and claim you as our Lord. We pray in your most holy name. Amen. "]], "109": [["info", "Good Friday"], ["watchO", "Watchword for Good Friday — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["dateVerse", "Friday, April 19", "Psalm 51:7–12", "Job 24", "1 Corinthians 3:12–23"], ["watchD", "God has made me fruitful in the land of my misfortunes. Genesis 41:52"], ["docT", "One of the criminals who were hanged there, said, “Jesus, remember me when you come into your kingdom.” Jesus replied, “Truly I tell you, today you will be with me in Paradise.” Luke 23:42-43"], ["prayer", "Lord Jesus, even when things look hopeless, you remember us, promising paradise this day. Deepest thanks to you our dying Lord. In your name we pray. Amen."]], "110": [["info", "Great Sabbath"], ["dateVerse", "Saturday, April 20", "Psalm 51:13–19", "Job 25–27", "1 Corinthians 4:1–15"], ["watchD", "Hear, O Israel: The Lord is our God, the Lord alone. Deuteronomy 6:4"], ["docT", "And this is eternal life, that they may know you, the only true God, and Jesus Christ whom you have sent. John 17:3"], ["prayer", "God, as we peer into the empty tomb with heavy hearts, help us to remember that all is gained, not lost. Behind the scene, a great miracle transpired, and all is truly well. In Jesus’ name we pray. Amen."]], "111": [["info", "Easter"], ["watchO", "Watchword for the week — Why do you look for the living among the dead? Jesus is not here, but has risen. Luke 24:5"], ["dateVerse", "Sunday, April 21", "Acts 10:34-43", "Psalm 118:1-2,14-24", "1 Corinthians 15:19-26", "Luke 24:1-12"], ["watchD", "Woe to those who quarrel with their Maker, those who are nothing but potsherds among the potsherds on the ground. Does the clay say to the potter, ‘What are you making?’ Isaiah 45:9 NIV"], ["docT", "If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["prayer", "Lord, there was a stable, a star, miracles, a healer, wisdom beyond measure, hosannas, palm branches, “Crucify him!”, a cross, sharp nails, your agony, and our terror. Yet when we see an empty tomb, we know all has been made new. The Lord is risen indeed! Thanks be to God. Amen."]], "112": [["dateVerse", "Monday, April 22", "Psalm 52", "Job 28", "1 Corinthians 4:16–5:8"], ["watchD", "In days to come nation shall not lift up sword against nation, neither shall they learn war any more. Isaiah 2:2,4"], ["docT", "Jesus said to them again, “Peace be with you. As the Father has sent me, so I send you.” John 20:21"], ["prayer", "Sweet Jesus, you walked to the cross to leave us with a message of peace. Guide us in the ways of peacemaking in our homes, schools, jobs, nations, and our world. Amen. "]], "113": [["dateVerse", "Tuesday, April 23", "Psalm 53", "Job 29", "1 Corinthians 5:9–6:8"], ["watchD", "Indeed the Lord will vindicate his people and have compassion on his servants. Deuteronomy 32:36"], ["docT", "Jesus says, “I tell you, God will quickly grant justice to his chosen ones. And yet, when the Son of Man comes, will he find faith on earth?” Luke 18:8"], ["prayer", "Dear Lord, soften our hearts and strengthen our resolve. There is never a day—or a moment—when compassion is not needed. Our faith in you will lead us in the ways of peace. Amen. "]], "114": [["dateVerse", "Wednesday, April 24", "Psalm 54", "Job 30", "1 Corinthians 6:9–20"], ["watchD", "My eyes are fixed on you, O Sovereign Lord; in you I take refuge—do not give me over to death. Psalm 141:8 NIV"], ["docT", "Jesus showed them his hands and his side. Then the disciples rejoiced when they saw the Lord. John 20:20 "], ["prayer", "Dear Lord, let us never forget the nails and your broken body. May we cast our eyes heavenward and rejoice as those who saw your wounds, yet also saw you rise up to glory. In Jesus’ name we pray. Amen."]], "115": [["dateVerse", "Thursday, April 25", "Psalm 55:1–8", "Job 31", "1 Corinthians 7:1–16"], ["watchD", "Satisfy us early with Your mercy, that we may rejoice and be glad all our days! Psalm 90:14 NKJV"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly places. Ephesians 1:3"], ["prayer", "Hallelujah, hallelujah, hallelujah! Blessed be the Lord God of Israel who is our lamb, and who has conquered. Let us follow Him. Hallelujah!"]], "116": [["dateVerse", "Friday, April 26", "Psalm 55:9–15", "Job 32,33", "1 Corinthians 7:17–24"], ["watchD", "The Lord says, “Why do you spend your money for that which is not bread, and your labor for that which does not satisfy? Listen carefully to me, and eat what is good.” Isaiah 55:2"], ["docT", "Do not work for the food that perishes, but for the food that endures for eternal life, which the Son of Man will give you. For it is on him that God the Father has set his seal. John 6:27"], ["prayer", "Dear God, when we consider Jesus, we see one who nourishes us, leads us, and fits us for service in your name. We will never be hungry when we follow him. In Jesus’ name we pray. Amen."]], "117": [["dateVerse", "Saturday, April 27", "Psalm 55:16–19", "Job 34:1–28", "1 Corinthians 7:25–40"], ["watchD", "We might humble ourselves before our God and ask him for a safe journey. Ezra 8:21 NIV"], ["docT", "Jesus said, “I am the way, and the truth, and the life. No one comes to the Father except through me.” John 14:6"], ["prayer", "Heavenly God, we are humbled by our own great need. Fortunately, we know the one who leads us safely home in all circumstances, both now and forever. In his holy name we pray. Amen."]], "118": [["info", "Second Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Peace be with you. As the Father has sent me, so I send you.” John 20:21"], ["dateVerse", "Sunday, April 28", "Acts 5:27-32", "Psalm 150", "Revelation 1:4-8", "John 20:19-31"], ["watchD", "See now that I, even I, am he; there is no god beside me. I kill and I make alive; I wound and I heal; and no one can deliver from my hand. Deuteronomy 32:39"], ["docT", "Jesus said, “I tell you, it is easier for a camel to go through the eye of a needle than for someone who is rich to enter the kingdom of God.” When the disciples heard this, they were greatly astounded and said, “Then who can be saved?” But Jesus looked at them and said, “For mortals it is impossible, but for God all things are possible.” Matthew 19:24-26"], ["prayer", "Heavenly One, there can only be one god. It is you. Help us to shed the baggage of our pride and independent ways, so that holding no hand but yours, we might slip effortlessly through the eye of that needle. In Jesus’ name we pray. Amen."]], "119": [["dateVerse", "Monday, April 29", "Psalm 55:20–23", "Job 34:29–35:16", "1 Corinthians 8"], ["watchD", "For God will bring every deed into judgment, including every secret thing, whether good or evil. Ecclesiastes 12:14"], ["docT", "Blessed are the pure in heart, for they will see God. Matthew 5:8"], ["prayer", "Dear God, remind us in every moment that we can keep no secrets from you. As we bathe in the crystal-clear water of your pure love, we are safe. In Jesus’ name we pray. Amen. "]], "120": [["dateVerse", "Tuesday, April 30", "Psalm 56:1–8", "Job 36:1–26", "1 Corinthians 9:1–12a"], ["watchD", "You shall not cheat one another, but you shall fear your God. Leviticus 25:17"], ["docT", "Jesus said, “For I have set you an example, that you also should do as I have done to you.” John 13:15"], ["prayer", "Dear God, how foolish we are to think we can take a shortcut to salvation by cheating ourselves or one another. Jesus set the example of complete honesty. This is our true and only way. Guide us in Jesus’ name. Amen."]], "121": [["dateVerse", "Wednesday, May 1", "Psalm 56:9–13", "Job 36:27–37:24", "1 Corinthians 9:12b–27"], ["watchD", "There is nothing better than that all should enjoy their work, for that is their lot. Ecclesiastes 3:22"], ["docT", "Give joyful thanks to the Father, who has qualified you to share in the inheritance of his holy people in the kingdom of light. Colossians 1:12 NIV"], ["prayer", "Creator God, thank you for granting us the privilege of working with you, to help establish your reign on earth. May we boldly claim the tasks you have chosen for us. In Jesus’ name we pray. Amen. "]], "122": [["dateVerse", "Thursday, May 2", "Psalm 57:1–6", "Job 38", "1 Corinthians 10:1–10"], ["watchD", "You shall rise up before the grayheaded and honor the aged. Leviticus 19:32 NASB"], ["docT", "Do nothing from selfish ambition or conceit, but in humility regard others as better than yourselves. Philippians 2:3"], ["prayer", "Loving Lord, help us to see your presence in every person. Help us to honor each one, and show your compassion to all. We pray in your name. Amen."]], "123": [["dateVerse", "Friday, May 3", "Psalm 57:7–11", "Job 39", "1 Corinthians 10:11–22"], ["watchD", "I will manifest my holiness among you in the sight of the nations. You shall know that I am the Lord, when I bring you into the land of Israel, the country that I swore to give to your ancestors. Ezekiel 20:41-42"], ["docT", "I am with you always, to the end of the age. Matthew 28:20"], ["prayer", "Lord, we trust in your abiding presence—especially when we are distressed by frightening events in our world. Mighty God, we rely on you when our own strength fails. Your loving children pray. Amen."]], "124": [["dateVerse", "Saturday, May 4", "Psalm 58", "Job 40", "1 Corinthians 10:23–11:2"], ["watchD", "With God we shall do valiantly. Psalm 60:12"], ["docT", "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him. Colossians 3:17"], ["prayer", "Holy One, we look to our savior, Jesus Christ, as our model for courage. When we face difficult challenges in following his footsteps, we can only rely on your strength. Thank you, Lord. Amen."]], "125": [["info", "Third Sunday of Easter"], ["watchO", "Watchword for the week — Worthy is the Lamb that was slain to receive power and wealth and wisdom and might and honor and glory and blessing! Revelation 5:12"], ["dateVerse", "Sunday, May 5", "Acts 9:1-6,(7-20)", "Psalm 30", "Revelation 5:11-14", "John 21:1-19"], ["watchD", "The Lord used to speak to Moses face to face, as one speaks to a friend. Exodus 33:11"], ["docT", "The disciples said to each other, “Were not our hearts burning within us while he was talking to us on the road, while he was opening the scriptures to us?” Luke 24:32"], ["prayer", "Lord, our lives are often crowded with conflicting priorities. Help us to be still, quiet our minds, and listen for the gentle whisper of your voice. We pray in the name of Jesus. Amen."]], "126": [["dateVerse", "Monday, May 6", "Psalm 59:1–9", "Job 41", "1 Corinthians 11:3–16"], ["watchD", "Come, and let us join ourselves to the Lord in a perpetual covenant that shall not be forgotten. Jeremiah 50:5 KJV"], ["docT", "Lord, to whom can we go? You have the words of eternal life. John 6:68"], ["prayer", "God, through the many conflicts we face in our lives, we recognize that your promises are sure. Help us to fulfill our end of the bargain with you as we seek to follow you. In Jesus’ name we pray. Amen."]], "127": [["dateVerse", "Tuesday, May 7", "Psalm 59:10–17", "Job 42", "1 Corinthians 11:17–30"], ["watchD", "David found strength in the Lord his God. 1 Samuel 30:6 NIV"], ["docT", "I always thank my God as I remember you in my prayers. I pray that your partnership with us in the faith may be effective in deepening your understanding of every good thing we share for the sake of Christ. Philemon 4,6 NIV"], ["prayer", "God of history, your people have given us examples of strength and courage. We rely on your guidance to help us through whatever trouble we may face in our own lives. We pray with thankful hearts. Amen."]], "128": [["dateVerse", "Wednesday, May 8", "Psalm 60", "Proverbs 1:1–2:8", "1 Corinthians 11:31–12:11"], ["watchD", "You saw how the Lord your God carried you, just as one carries a child, all the way that you traveled. Deuteronomy 1:31"], ["docT", "So we have known and believe the love that God has for us. 1 John 4:16"], ["prayer", "Compassionate God, your presence enfolds us and comforts us. We thank you for your loving embrace as we feel your arms around us. In Jesus’ name we pray. Amen."]], "129": [["dateVerse", "Thursday, May 9", "Psalm 61", "Proverbs 2:9–3:20", "1 Corinthians 12:12–26"], ["watchD", "I said, ‘I will guard my ways that I may not sin with my tongue.’ Psalm 39:1"], ["docT", "Let everyone be quick to listen, slow to speak, slow to anger. James 1:19"], ["prayer", "Lord, we know how hastily spoken words can wound the spirit of one of your children. May we pause and listen, so that our only words will be those you want your people to hear. In Jesus’ name we pray. Amen."]], "130": [["dateVerse", "Friday, May 10", "Psalm 62", "Proverbs 3:21–4:27", "1 Corinthians 12:27–13:7"], ["watchD", "The Lord will send his angel before you. Genesis 24:7"], ["docT", "The angel said to the women, “Do not be afraid; I know that you are looking for Jesus who was crucified. Then go quickly and tell his disciples, ‘He has been raised from the dead, and indeed he is going ahead of you to Galilee; there you will see him.’” Matthew 28:5,7"], ["prayer", "Great Shepherd, we trust that you will not lead us astray. Give us the courage today to follow wherever your path leads us. In your holy name we pray. Amen."]], "131": [["dateVerse", "Saturday, May 11", "Psalm 63", "Proverbs 5", "1 Corinthians 13:8–14:5"], ["watchD", "The Lord lift up his countenance upon you, and give you peace. Numbers 6:26"], ["docT", "And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus. Philippians 4:7"], ["prayer", "Lord, we are overwhelmed by the richness of your blessings. May your peace be evident in each of our lives as we share the gift of your blessing with others. We pray in Jesus’ name. Amen."]], "132": [["info", "Fourth Sunday of Easter"], ["watchO", "Watchword for the week — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Sunday, May 12", "Acts 9:36-43", "Psalm 23", "Revelation 7:9-17", "John 10:22-30"], ["watchD", "The Lord is good, a stronghold in the day of trouble; and He knows those who trust in Him. Nahum 1:7 NKJV"], ["docT", "We are afflicted in every way, but not crushed; perplexed, but not driven to despair. 2 Corinthians 4:8"], ["prayer", "Lord, it is so hard to look beyond those times of fear, pain, and sorrow. Your word reminds us that you love us; you are our protector. Please strengthen our faith in troubled times. In Jesus’ name. Amen."]], "133": [["dateVerse", "Monday, May 13", "Psalm 64", "Proverbs 6", "1 Corinthians 14:6–19"], ["watchD", "“From the rising of the sun to its setting my name is great among the nations,” says the Lord. Malachi 1:11"], ["docT", "And every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. Philippians 2:11"], ["prayer", "Holy One, when we speak the name of Jesus, let us also convey his love and his greatness by the way we live our lives. We pray in Jesus’ name. Amen."]], "134": [["dateVerse", "Tuesday, May 14", "Psalm 65:1–8", "Proverbs 7", "1 Corinthians 14:20–35"], ["watchD", "Boaz said to Ruth, “May you have a full reward from the Lord, under whose wings you have come for refuge!” Ruth 2:12"], ["docT", "I commend to you our sister Phoebe, a deacon of the church at Cenchreae, so that you may welcome her in the Lord as is fitting for the saints, and help her in whatever she may require from you. Romans 16:1-2"], ["prayer", "Forgiving God, it’s easy for us to say we believe, and easy to quote our favorite parts of the Bible. May our lives and actions reflect the life of your son, Jesus. Amen."]], "135": [["dateVerse", "Wednesday, May 15", "Psalm 65:9–13", "Proverbs 8:1–9:6", "1 Corinthians 14:36–15:2"], ["watchD", "Our transgressions indeed are with us, and we know our iniquities: transgressing, and denying the Lord. Isaiah 59:12-13"], ["docT", "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9"], ["prayer", "Lord, we thank you for your patience. Too often, we have trouble living the way you want us to live. Forgive us, and help us to learn how to live according to your will. In Jesus’ name we pray. Amen."]], "136": [["dateVerse", "Thursday, May 16", "Psalm 66:1–7", "Proverbs 9:7–10:32", "1 Corinthians 15:3–16"], ["watchD", "The Lord is wonderful in counsel and excellent in guidance. Isaiah 28:29 NKJV"], ["docT", "Jesus said to them, “Have you never read in the scriptures: ‘The stone that the builders rejected has become the cornerstone?’” Matthew 21:42"], ["prayer", "Eternal God, whatever happens in this confusing world we live in, we hold onto your son, Jesus, as our foundation and cornerstone. We trust that, in him, we will not fail. We pray in his holy name. Amen."]], "137": [["dateVerse", "Friday, May 17", "Psalm 66:8–15", "Proverbs 11", "1 Corinthians 15:17–28"], ["watchD", "The Lord will command his angels concerning you to guard you in all your ways. On their hands they will bear you up, so that you will not dash your foot against a stone. Psalm 91:11-12"], ["docT", "Are not all angels spirits in the divine service, sent to serve for the sake of those who are to inherit salvation? Hebrews 1:14"], ["prayer", "Powerful God, you often help us through danger or trouble in ways we don’t expect. Help us to see your hand in all the small miracles we experience every day. Amen."]], "138": [["dateVerse", "Saturday, May 18", "Psalm 66:16–20", "Proverbs 12", "1 Corinthians 15:29–41"], ["watchD", "After that whole generation had been gathered to their ancestors, another generation grew up who knew neither the Lord nor what he had done for Israel. Judges 2:10 NIV"], ["docT", "Remember Jesus Christ, raised from the dead. 2 Timothy 2:8"], ["prayer", "God of history, God of eternity, forgive us when we forget the way you have always worked in the lives of your people. Help us to trust you as you continue to guide and protect us. Amen. "]], "139": [["info", "Fifth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “I am the Alpha and the Omega, the beginning and the end. To the thirsty I will give water as a gift from the spring of the water of life.” Revelation 21:6 "], ["dateVerse", "Sunday, May 19", "Acts 11:1-18", "Psalm 148", "Revelation 21:1-6", "John 13:31-35"], ["watchD", "Does God not see my ways, and number all my steps? Job 31:4"], ["docT", "Before him no creature is hidden, but all are naked and laid bare to the eyes of God, the one to whom we must render an account. Hebrews 4:13"], ["prayer", "Lord, every day, every moment of our lives, is a gift from you. Please make us conscientious stewards of the time you have given us. In Jesus’ name we pray. Amen."]], "140": [["dateVerse", "Monday, May 20", "Psalm 67", "Proverbs 13", "1 Corinthians 15:42–58"], ["watchD", "The Lord is your praise; he is your God. Deuteronomy 10:21"], ["docT", "Jesus Christ said, “I am the Alpha and the Omega, the first and the last, the beginning and the end.” Revelation 22:13"], ["prayer", "God, you are our first, our last, and everything in-between. Even when we are busy and distracted, please help us to be aware of your loving presence. In Jesus’ name we pray. Amen."]], "141": [["dateVerse", "Tuesday, May 21", "Psalm 68:1–6", "Proverbs 14", "1 Corinthians 16:1–11"], ["watchD", "Into your hand I commit my spirit; you have redeemed me, O Lord, faithful God. Psalm 31:5"], ["docT", "The law of the Spirit of life in Christ Jesus has set you free from the law of sin and of death. Romans 8:2"], ["prayer", "Holy Spirit, whenever we are frustrated or frightened, please enable us to turn control over to you. Thank you for enfolding us, sustaining us, and setting us free. Amen."]], "142": [["dateVerse", "Wednesday, May 22", "Psalm 68:7–18", "Proverbs 15", "1 Corinthians 16:12–24"], ["watchD", "This is the Lord for whom we have waited; let us be glad and rejoice in his salvation. Isaiah 25:9"], ["docT", "Praise be to the Lord, the God of Israel, because he has come to his people and redeemed them. Luke 1:68 NIV"], ["prayer", "Lord Jesus, thank you for banishing our sin by your sacrifice. While we wait for the completion of your kingdom, may our lives demonstrate your love to our neighbors. We pray in your holy name. Amen."]], "143": [["dateVerse", "Thursday, May 23", "Psalm 68:19–27", "Proverbs 16", "2 Corinthians 1:1–11"], ["watchD", "Your words became to me a joy and the delight of my heart; for I am called by your name, O Lord, God of hosts. Jeremiah 15:16"], ["docT", "Blessed are those who hear the word of God and obey it! Luke 11:28"], ["prayer", "Gracious Lord, it is such a marvelous privilege to be called your sons and daughters. Thank you for the blessing of your guidance. May our joy be evident in everything we say and do! Amen."]], "144": [["dateVerse", "Friday, May 24", "Psalm 68:28–35", "Proverbs 17", "2 Corinthians 1:12–22"], ["watchD", "God is not a human being, that he should lie, or a mortal, that he should change his mind. Numbers 23:19"], ["docT", "He sustains all things by his powerful word. Hebrews 1:3"], ["prayer", "Lord, we have already seen your promises fulfilled, and we trust in your continued presence—even when we can’t see the immediate outcome of your plans for our lives. Thank you for your guiding hand. Amen. "]], "145": [["dateVerse", "Saturday, May 25", "Psalm 69:1–12", "Proverbs 18", "2 Corinthians 1:23–2:13"], ["watchD", "Sing aloud to God our strength. Psalm 81:1"], ["docT", "I will pray with the spirit, but I will pray with the mind also; I will sing praise with the spirit, but I will sing praise with the mind also. 1 Corinthians 14:15"], ["prayer", "Holy One, we thank you for the gift of music—the songs that speak to our hearts and minds when words alone fail us. May we hear you speaking through words and harmonies. In Jesus’ name. Amen."]], "146": [["info", "Sixth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Peace I leave with you; my peace I give to you.” John 14:27"], ["dateVerse", "Sunday, May 26", "Acts 16:9-15", "Psalm 67", "Revelation 21:10,22-22:5", "John 14:23-29"], ["watchD", "I love the Lord, because he has heard my voice and my supplications. Psalm 116:1"], ["docT", "Whenever you pray, go into your room and shut the door and pray to your Father who is in secret; and your Father who sees in secret will reward you. Matthew 6:6"], ["prayer", "Lord, often we don’t know how to pray, but we trust that you are aware of our needs even before we are. Thank you for listening and responding in the way that is right for each of us. Amen."]], "147": [["dateVerse", "Monday, May 27", "Psalm 69:13–21", "Proverbs 19", "2 Corinthians 2:14–3:11"], ["watchD", "I will extol you among the nations, and sing praises to your name. Psalm 18:49"], ["docT", "We cannot keep from speaking about what we have seen and heard. Acts 4:20"], ["prayer", "Lord, your message of love and peace is so wonderful that we can’t keep it to ourselves. Please help us proclaim your wonderful truth in our words and in our lives. We pray in your holy name. Amen. "]], "148": [["dateVerse", "Tuesday, May 28", "Psalm 69:22–29", "Proverbs 20", "2 Corinthians 3:12–4:6"], ["watchD", "O come, let us sing to the Lord; let us make a joyful noise to the rock of our salvation! Psalm 95:1"], ["docT", "Day by day continuing with one mind in the temple, and breaking bread from house to house, they were taking their meals together with gladness and sincerity of heart, praising God and having favor with all the people. Acts 2:46-47 NASB"], ["prayer", "Lord, when we gather for worship, we are aware that your Holy Spirit is with us, giving us strength to accomplish what we cannot do on our own. As we work together, we thank you for your power. Amen."]], "149": [["dateVerse", "Wednesday, May 29", "Psalm 69:30–36", "Proverbs 21", "2 Corinthians 4:7–18"], ["watchD", "The counsel of the Lord stands forever. Psalm 33:11"], ["docT", "Paul said, “And now I commend you to God and to the message of his grace, a message that is able to build you up and to give you the inheritance among all who are sanctified.” Acts 20:32"], ["prayer", "God, we thank you that we have inherited the blessing of faith passed to us through the centuries. In this new era, please show us how to give our wonderful legacy to coming generations. In Jesus’ name we pray. Amen."]], "150": [["info", "Ascension Day"], ["watchO", "Watchword for Ascension Day — Christ said, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32"], ["dateVerse", "Thursday, May 30", "Psalm 70", "Proverbs 22", "2 Corinthians 5:1–15"], ["specialVerse", "Ascension of the Lord", "Acts 1:1-11", "Psalm 47", "Ephesians 1:15-23", "Luke 24:44-53"], ["watchD", "You will not abandon me to the realm of the dead. Psalm 16:10 NIV"], ["docT", "Consequently Jesus is able for all time to save those who approach God through him, since he always lives to make intercession for them. Hebrews 7:25"], ["prayer", "Loving God, you have walked with your people through countless generations. Even when we make mistakes, you remain faithful. Thank you for your promise that you will never leave or forsake us. Amen."]], "151": [["dateVerse", "Friday, May 31", "Psalm 71:1–8", "Proverbs 23", "2 Corinthians 5:16–6:2"], ["watchD", "Even when I am old and gray, do not forsake me, my God, till I declare your power to the next generation, your mighty acts to all who are to come. Psalm 71:18 NIV"], ["docT", "So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 2 Corinthians 4:16"], ["prayer", "Lord, we have accepted the challenge of keeping your good news alive for coming generations. Grant us the wisdom to hear our children’s questions, to honor them, and to meet them where they are. In Jesus’ name we pray. Amen."]], "152": [["dateVerse", "Saturday, June 1", "Psalm 71:9–18a", "Proverbs 24", "2 Corinthians 6:3–18"], ["watchD", "Great are the works of the Lord, studied by all who delight in them. Psalm 111:2"], ["docT", "The God of our Lord Jesus Christ, the glorious Father, may give you the Spirit of wisdom and revelation, so that you may know him better. Ephesians 1:17 NIV"], ["prayer", "Dear Lord, we praise you for your love and mercy, and we thank you for your marvelous work to sustain us and the world in which we live. Equip us with the burning desire to know you, so that we may share your love with a searching world. In Jesus’ name we pray. Amen."]], "153": [["info", "Ascension of the Lord"], ["info", "Seventh Sunday of Easter"], ["watchO", "Watchword for the week — Rejoice in the Lord, O you righteous, and give thanks to his holy name! Psalm 97:12"], ["dateVerse", "Sunday, June 2", "Acts 16:16-34", "Psalm 97", "Revelation 22:12-14,16-17,20-21", "John 17:20-26"], ["watchD", "The Lord made us, and we are his; we are his people, and the sheep of his pasture. Psalm 100:3"], ["docT", "You did not choose me but I chose you. And I appointed you to go and bear fruit. John 15:16"], ["prayer", "How special we are to you, O Lord! When the demands of daily living press in upon us and we feel overwhelmed, whisper to our spirits that we are in your care and under your guidance. Show us the way to live to be true to our association with you. Amen."]], "154": [["dateVerse", "Monday, June 3", "Psalm 71:18b–24", "Proverbs 25", "2 Corinthians 7:1–13a"], ["watchD", "Restore us to yourself, O Lord, that we may be restored; renew our days as of old. Lamentations 5:21"], ["docT", "Jesus said, “I will ask the Father, and he will give you another Advocate, to be with you forever. This is the Spirit of truth.” John 14:16-17"], ["prayer", "Mighty Advocate, as we have been recipients of your restorative work, give us eyes to see situations where persons live with injustice in our world. Give us courage to act as advocates for those who have no voice. Amen."]], "155": [["dateVerse", "Tuesday, June 4", "Psalm 72:1–11", "Proverbs 26", "2 Corinthians 7:13b–8:9"], ["watchD", "The Lord will fight for you, and you have only to keep still. Exodus 14:14"], ["docT", "In all these things we are more than conquerors through him who loved us. Romans 8:37"], ["prayer", "Divine Comforter, we cry, “Victory in Jesus!” Help us to hold on to this word of hope, especially in those moments when we are tempted to forget that you will make a way when there seems to be no open door. Amen."]], "156": [["dateVerse", "Wednesday, June 5", "Psalm 72:12–20", "Proverbs 27", "2 Corinthians 8:10–21"], ["watchD", "In quietness and in trust shall be your strength. Isaiah 30:15"], ["docT", "And can any of you by worrying add a single hour to your span of life? Matthew 6:27"], ["prayer", "Dear Jesus, show us the blessedness in stepping aside to renew and recreate our lives according to your will. You set the example for us when you left the crowds to rest. May we find our respite in you each day. Amen."]], "157": [["dateVerse", "Thursday, June 6", "Psalm 73:1–12", "Proverbs 28", "2 Corinthians 8:22–9:9"], ["watchD", "Truly, the fear of the Lord, that is wisdom; and to depart from evil is understanding. Job 28:28"], ["docT", "It is to peace that God has called you. 1 Corinthians 7:15"], ["prayer", "Merciful Lord, forgive us for willfully or blindly participating in evil actions that add to the misery and pain of others. Help us to weigh our actions, so that we can be your channel of peace in our communities. In Jesus’ name we pray. Amen."]], "158": [["dateVerse", "Friday, June 7", "Psalm 73:13–20", "Proverbs 29", "2 Corinthians 9:10–10:6"], ["watchD", "Only be careful, and watch yourselves closely so that you do not forget the things your eyes have seen. Deuteronomy 4:9 NIV"], ["docT", "Hold fast to what you have, so that no one may seize your crown. Revelation 3:11"], ["prayer", "Dear Lord, it is in remembering your intervention in our lives that we are humbled by your love; and it is in seeing as you see that we become mindful of how we can share your love with our neighbors. Teach us that we may become good models of our savior, Jesus Christ. Amen."]], "159": [["dateVerse", "Saturday, June 8", "Psalm 73:21–28", "Proverbs 30", "2 Corinthians 10:7–18"], ["watchD", "The Lord your God is gracious and merciful, and will not turn away his face from you, if you return to him. 2 Chronicles 30:9"], ["docT", "Repent therefore, and turn to God so that your sins may be wiped out, so that times of refreshing may come from the presence of the Lord. Acts 3:19-20"], ["prayer", "As we wash our bodies to start each day, help us, O God, to turn to you for a spiritual cleansing. It is through submitting to your work in us that we refrain from stumbling along life’s pathways. Save us from the constant stain of sin. Amen."]], "160": [["info", "Day of Pentecost"], ["watchO", "Watchword for the week — For all who are led by the Spirit of God are children of God. Romans 8:14"], ["dateVerse", "Sunday, June 9", "Acts 2:1-21", "Psalm 104:24-34,35b", "Romans 8:14-17", "John 14:8-17,(25-27)"], ["watchD", "Correct me, O Lord, but in just measure; not in your anger, or you will bring me to nothing. Jeremiah 10:24"], ["docT", "And when the Advocate comes, he will prove the world wrong about sin and righteousness and judgment. John 16:8"], ["prayer", "Release us, O Holy Spirit, from our bondage to superficial, earthly treasures. Raise us to new heights as we unclutter our lives, and fill us with gratitude for your mercy and love. Amen."]], "161": [["dateVerse", "Monday, June 10", "Psalm 74:1–9", "Proverbs 31", "2 Corinthians 11:1–11"], ["watchD", "The Lord will reign for ever and ever. Exodus 15:18"], ["docT", "The whole multitude of the disciples began to praise God joyfully with a loud voice for all the deeds of power that they had seen, saying, “Blessed is the king who comes in the name of the Lord! Peace in heaven, and glory in the highest heaven!” Luke 19:37-38"], ["prayer", "God of grace, we remember your deeds on our behalf from long ago. When we lift our voices in praise today, it is because this day brings with it new expressions of your mercies. Thank you, Lord, for your mercy endures forever. Amen."]], "162": [["dateVerse", "Tuesday, June 11", "Psalm 74:10–17", "Ecclesiastes 1:1–3:8", "2 Corinthians 11:12–15"], ["watchD", "The Lord knows our thoughts, that they are but an empty breath. Psalm 94:11"], ["docT", "I want to know Christ and the power of his resurrection. Philippians 3:10"], ["prayer", "God of wholeness, thank you for listening to our hearts and voices. Because you know us, we can be truly cleansed and equipped to serve you. Excite in us a passion to serve you. In Jesus’ name we pray. Amen."]], "163": [["dateVerse", "Wednesday, June 12", "Psalm 74:18–23", "Ecclesiastes 3:9–5:20", "2 Corinthians 11:16–33"], ["watchD", "I will send survivors to the nations, that have not heard of my fame or seen my glory; and they shall declare my glory among the nations. Isaiah 66:19"], ["docT", "Jesus said, “All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything that I have commanded you.” Matthew 28:18-20"], ["prayer", "Dear Lord, as your love finds paths into our hardened hearts, make of us vessels fit to carry your life-giving message to a longing world. We yield to your shaping, so that we may, once more, feel your love for us and all your creation. Amen."]], "164": [["dateVerse", "Thursday, June 13", "Psalm 75", "Ecclesiastes 6:1–7:14", "2 Corinthians 12:1–13"], ["watchD", "God made human beings straightforward, but they have devised many schemes. Ecclesiastes 7:29 "], ["docT", "You will know them by their fruits. Matthew 7:16"], ["prayer", "O God, you have led us from anxiety into peace, yet we foolishly long to break away from your loving embrace. Forgive our wildness that prevents us from being tamed to do your will. In Jesus’ name we pray. Amen."]], "165": [["dateVerse", "Friday, June 14", "Psalm 76", "Ecclesiastes 7:15–9:18", "2 Corinthians 12:14–13:4"], ["watchD", "Abraham’s servant remained silent so as to know whether the Lord had made his journey prosperous or not. Genesis 24:21 NKJV"], ["docT", "You need endurance, so that when you have done the will of God, you may receive what was promised. Hebrews 10:36"], ["prayer", "Patient Lord, you see us as we are; yet you love us in spite of our imperfections. Forgive and calm our railings against you. We confess that we are often unable to truly understand your ways. By your grace, lead us in the paths of righteousness. In Jesus’ name we pray. Amen."]], "166": [["dateVerse", "Saturday, June 15", "Psalm 77:1–9", "Ecclesiastes 10:1–12:14", "2 Corinthians 13:5–13"], ["watchD", "I will teach transgressors your ways, and sinners will return to you. Psalm 51:13"], ["docT", "God our Savior desires everyone to be saved and to come to the knowledge of the truth. 1 Timothy 2:3-4"], ["prayer", "God of our salvation, we are yours. But, our blindness often prevents us from sensing your loving care for us. As a result, we push away from you at the very times we need you most. Forgive us and help us to trust your wisdom in our lives. Amen."]], "167": [["info", "Trinity Sunday"], ["watchO", "Watchword for the week — Since we are justified by faith, we have peace with God through our Lord Jesus Christ. Romans 5:1"], ["dateVerse", "Sunday, June 16", "Proverbs 8:1-4,22-31", "Psalm 8", "Romans 5:1-5", "John 16:12-15"], ["watchD", "For me it is good to be near God; I have made the Lord God my refuge, to tell of all your works. Psalm 73:28 "], ["docT", "You are a chosen race, a royal priesthood, a holy nation, God’s own people, in order that you may proclaim the mighty acts of him who called you out of darkness into his marvelous light. 1 Peter 2:9"], ["prayer", "Lord of all, we are reminded that we are yours for a reason—to show our allegiance to you by how we live in the world. We beseech you to enable us to see this world with fresh eyes as you guide us to understand that all dominion belongs to you, and that we are your servant creatures. Amen."]], "168": [["dateVerse", "Monday, June 17", "Psalm 77:10–15", "Song of Solomon 1:1–2:7", "Galatians 1:1–12"], ["watchD", "As the rain and the snow come down from heaven, and do not return there until they have watered the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater, so shall my word be that goes out from my mouth. Isaiah 55:10-11"], ["docT", "My message and my preaching were not in persuasive words of wisdom, but in demonstration of the Spirit and of power. 1 Corinthians 2:4 NASB"], ["prayer", "O God, in a time of changes and uncertainties, your word is steadfast, and will accomplish your purpose. May your Church continue to proclaim your word with full assurance that, not only is it our hope, but it reveals your power and love to all who believe and trust in you. In the name of Jesus we pray. Amen."]], "169": [["dateVerse", "Tuesday, June 18", "Psalm 77:16–20", "Song of Solomon 2:8–4:16", "Galatians 1:13–24"], ["watchD", "The Lord said to Jeremiah, “Now I have put my words in your mouth.” Jeremiah 1:9 "], ["docT", "But make up your mind not to worry beforehand how you will defend yourselves. For I will give you words and wisdom. Luke 21:14-15 NIV"], ["prayer", "Lord, often we are not bold in our witness or we are afraid in sharing our testimony, so we remain silent. Encourage us to speak without fear and dwell in your word and presence each day. May we trust you to teach us to speak with grace and wisdom, that the good news may be proclaimed wherever you lead us. Amen."]], "170": [["dateVerse", "Wednesday, June 19", "Psalm 78:1–8", "Song of Solomon 5,6", "Galatians 2:1–14"], ["watchD", "He will bless those who fear the Lord, both small and great. Psalm 115:13"], ["docT", "In Christ Jesus you are all children of God through faith. Galatians 3:26"], ["prayer", "Gracious God, thank you for the assurance that in your sight we are all special; great or small, you bless us. You watch over us and bless all who put their trust in you. Help us to share this good news to those around us, especially those our world tends to forget and abuse. Amen."]], "171": [["dateVerse", "Thursday, June 20", "Psalm 78:9–16", "Song of Solomon 7,8", "Galatians 2:15–3:5"], ["watchD", "Even when you turn gray I will carry you. I have made, and I will bear; I will carry and will save. Isaiah 46:4"], ["docT", "God is faithful; by him you were called into the fellowship of his Son, Jesus Christ our Lord. 1 Corinthians 1:9"], ["prayer", "God, we face fear as we grow older, moving into the unknown—worrying about loneliness, dementia, mental illness, financial insecurity, and many other concerns. Reassure us that your constant care and love are new every morning. Remind us, Holy Spirit, of your everlasting presence to guide and comfort us through every stage of our earthly pilgrimage, so that we may remain in fellowship with Christ, our friend. Amen."]], "172": [["dateVerse", "Friday, June 21", "Psalm 78:17–31", "Isaiah 1", "Galatians 3:6–18"], ["watchD", "I will add to their numbers, and they will not be decreased; I will bring them honor, and they will not be disdained. Jeremiah 30:19 NIV"], ["docT", "Jesus told them another parable: “The kingdom of heaven is like yeast that a woman took and mixed in with three measures of flour until all of it was leavened.” Matthew 13:33"], ["prayer", "Heavenly Lord, may your grace continue to grow in our hearts and change us from the inside out. May the gospel message transform our lives and exert its influence on the world around us. May our lifestyle always reflect God’s glory, that through our testimonies, his kingdom will be extended as others believe in him. In Jesus’ name we pray. Amen."]], "173": [["dateVerse", "Saturday, June 22", "Psalm 78:32–39", "Isaiah 2:1–4:1", "Galatians 3:19–29"], ["watchD", "Out of the mouths of babes and infants you have founded a bulwark. Psalm 8:2"], ["docT", "The least among all of you is the greatest. Luke 9:48"], ["prayer", "Remake us, Holy Spirit, so that with humble hearts and sincere lips, we may truly praise you with our worship and in our service. Then, others will know that greatness is not derived from status, wealth, or education, but through serving others. Amen."]], "174": [["info", "Second Sunday after Pentecost"], ["watchO", "Watchword for the week — For dominion belongs to the Lord, and he rules over the nations. Psalm 22:28"], ["dateVerse", "Sunday, June 23", "Isaiah 65:1-9", "Psalm 22:19-28", "Galatians 3:23-29", "Luke 8:26-39"], ["watchD", "Ah, Lord, great and awesome God, keeping covenant and steadfast love with those who love you and keep your commandments, we have sinned and done wrong. Daniel 9:4-5"], ["docT", "Where sin increased, grace abounded all the more. Romans 5:20"], ["prayer", "Gracious God, out of your kindness you invite us to repent of our sins. Today and every day, help us to turn away from wrongful living. Then, by God’s grace, we will be sanctified and filled with joy as we testify of his everlasting love. We pray in the name of the Father, Son, and Holy Spirit. Amen."]], "175": [["dateVerse", "Monday, June 24", "Psalm 78:40–55", "Isaiah 4:2–5:30", "Galatians 4:1–16"], ["watchD", "Shall we receive the good at the hand of God, and not receive the bad? Job 2:10"], ["docT", "Jesus prayed, “Father, if you are willing, remove this cup from me; yet, not my will but yours be done.” Luke 22:42"], ["prayer", "By your example, Redeemer, show us, during times of our persecution and trials, how to accept God’s will and purpose in our lives. Assist us to remember that all things will work for good to those who put their trust in you. Give us the grace to say at all times, “Your will be done!” Amen."]], "176": [["dateVerse", "Tuesday, June 25", "Psalm 78:56–64", "Isaiah 6,7", "Galatians 4:17–27"], ["watchD", "For a brief moment I abandoned you, but with great compassion I will gather you. Isaiah 54:7"], ["docT", "Jesus said, “I will not leave you orphaned; I am coming to you.” John 14:18"], ["prayer", "Remind us today, Holy Spirit, that your presence is always with us to comfort, to guide, and to strengthen us always. Sometimes on life’s journey, we feel like we are on a pilgrimage alone, forgetting that you have promised to never forsake us or turn your back against us. May we always rely on you, Holy Spirit, to remind us of God’s established covenant. Amen."]], "177": [["dateVerse", "Wednesday, June 26", "Psalm 78:65–72", "Isaiah 8:1–9:7", "Galatians 4:28–5:6"], ["watchD", "Be gracious to me, O Lord, for I am in distress. Psalm 31:9"], ["docT", "Jesus said, “But even the hairs of your head are all counted. Do not be afraid.” Luke 12:7"], ["prayer", "Help us, O Savior, in times of trouble and trials, to know that you are fully aware of every aspect of our lives. Help us, Holy Spirit, to trust in our heavenly parent who is full of compassion and mercy. Help us to walk by faith, surrounded by perfect peace, knowing that God is taking care of us through every need, storm, or situation. Amen."]], "178": [["dateVerse", "Thursday, June 27", "Psalm 79:1–8", "Isaiah 9:8–10:11", "Galatians 5:7–18"], ["watchD", "God says, “From this time forward I make you hear new things, hidden things that you have not known.” Isaiah 48:6"], ["docT", "God has made known to us the mystery of his will, according to his good pleasure that he set forth in Christ. Ephesians 1:9"], ["prayer", "Lord, open our ears to listen, remove the scales from our eyes to see, and melt our rebellious hearts to receive the mystery of your love and grace. Then, and only then, Lord, we truly will be able to embrace your truth and bear witness of your goodness towards all creation. Amen."]], "179": [["dateVerse", "Friday, June 28", "Psalm 79:9–13", "Isaiah 10:12–11:9", "Galatians 5:19–6:5"], ["watchD", "We also will serve the Lord, for he is our God. Joshua 24:18"], ["docT", "We, who are many, are one body in Christ, and individually we are members one of another. We have gifts that differ according to the grace given to us. Romans 12:5-6"], ["prayer", "Bind us together, Holy Spirit, as one body in Christ, so that we may use our various gifts to serve our Lord in proclaiming the gospel to all people in word and deed through the grace given to all believers. May we embrace our various gifts for the common good. For to your church the task is given to make disciples of all people. In Jesus’ name we pray. Amen."]], "180": [["dateVerse", "Saturday, June 29", "Psalm 80:1–7", "Isaiah 11:10–13:22", "Galatians 6:6–18"], ["watchD", "I will punish you according to the fruit of your doings, says the Lord. Jeremiah 21:14"], ["docT", "So let us not grow weary in doing what is right, for we will reap at harvest time, if we do not give up. Galatians 6:9"], ["prayer", "Gracious Lord, we confess those times when our work does not reflect our faith in you. Sometimes, we give up because of our impatience to trust in your timing. We fail to do what is pleasing in your sight because we are afraid of the world’s reaction. Forgive, redeem, and renew us through your spirit. Amen."]], "181": [["info", "Third Sunday after Pentecost"], ["watchO", "Watchword for the week — If we live by the Spirit, let us also be guided by the Spirit. Galatians 5:25"], ["dateVerse", "Sunday, June 30", "1 Kings 19:15-16,19-21", "Psalm 16", "Galatians 5:1,13-25", "Luke 9:51-62"], ["watchD", "You shall worship the Lord your God, and he will bless your bread and your water. Exodus 23:25"], ["docT", "Therefore do not worry, saying, ‘What will we eat?’ or ‘What will we drink?’ or ‘What will we wear?’ Your heavenly Father knows that you need all these things. Matthew 6:31,32"], ["prayer", "Lord, we often become so overwhelmed with the basic needs of our lives that we forget that you are aware and will continue to supply all that we need to live. We get so discouraged and discontented because of the prosperity preached by the world that we forget that, in you, we live and move and have our being. Today, and each day, we will rejoice in thanksgiving for your sustenance, provisions, and promises, always. Amen."]], "182": [["dateVerse", "Monday, July 1", "Psalm 80:8–11", "Isaiah 14", "Ephesians 1:1–10"], ["watchD", "Search me, O God, and know my heart; test me and know my thoughts. See if there is any wicked way in me, and lead me in the way everlasting. Psalm 139:23-24"], ["docT", "Who is wise and understanding among you? Show by your good life that your works are done with gentleness born of wisdom. James 3:13"], ["prayer", "Lord of all, we ask you to search us. Search our hearts and minds, and give us wisdom to follow the path you have set before us. We sing of your goodness and feel your love. In Jesus’ name we pray. Amen."]], "183": [["dateVerse", "Tuesday, July 2", "Psalm 80:12–19", "Isaiah 15,16", "Ephesians 1:11–23"], ["watchD", "Lord, do not let my heart be drawn to what is evil. Psalm 141:4 NIV"], ["docT", "Do not be overcome by evil, but overcome evil with good. Romans 12:21"], ["prayer", "Lord, evil is all around us. We pray for the strength to be free from such darkness. Fill us with your goodness so others around can see your true light. Be with us every step of the way. Amen."]], "184": [["dateVerse", "Wednesday, July 3", "Psalm 81:1–5", "Isaiah 17:1–19:17", "Ephesians 2:1–10"], ["watchD", "Teach us to count our days that we may gain a wise heart. Psalm 90:12"], ["docT", "Jesus said, “Everyone then who hears these words of mine and acts on them will be like a wise man who built his house on rock.” Matthew 7:24"], ["prayer", "God of wisdom and light, grant us the insight to allow your spirit to brightly shine through us for others to see. Let us live fully for you—until you come again. In Jesus’ name we pray. Amen."]], "185": [["dateVerse", "Thursday, July 4", "Psalm 81:6–10", "Isaiah 19:18–22:14", "Ephesians 2:11–22"], ["watchD", "Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["docT", "Now may our Lord Jesus Christ himself and God our Father, who loved us and through grace gave us eternal comfort and good hope, comfort your hearts and strengthen them in every good work and word. 2 Thessalonians 2:16-17"], ["prayer", "Dear God, because of your goodness and grace, we are saved. We pray for our lives to continuously be restored to do your work. Keep us in your loving and grace-giving hands. In your name we pray. Amen."]], "186": [["dateVerse", "Friday, July 5", "Psalm 81:11–16", "Isaiah 22:15–23:18", "Ephesians 3:1–13"], ["watchD", "O Lord, you have searched me and known me. You know when I sit down and when I rise up; you discern my thoughts from far away. Psalm 139:1-2"], ["docT", "In him we live and move and have our being. Acts 17:28"], ["prayer", "Creative One, we thank you today for creating us; for making us in your image. We do fall short often, but with your cornerstone in place, we can continue to build. Let your power be strong within us. In Jesus’ name we pray. Amen."]], "187": [["dateVerse", "Saturday, July 6", "Psalm 82:1–4", "Isaiah 24,25", "Ephesians 3:14–4:6"], ["specialVerse", "John Hus Festival†", "Isaiah 49:1-7", "Psalm 135:1-13", "1 Corinthians 1:18-24", "Mark 8:34-38"], ["watchD", "My people shall be satisfied with my bounty, says the Lord. Jeremiah 31:14"], ["docT", "Heal the sick, raise the dead, cleanse those who have leprosy, drive out demons. Freely you have received; freely give. Matthew 10:8 NIV"], ["prayer", "Healing Lord, may we be a bold witness just like Hus, to spread your word to everyone we meet. Protect us and guide us along the way, and may we always feel your healing touch. In your precious and holy name. Amen."], ["info", "† On July 6, 1415, John Hus was martyred at the Council of Constance."]], "188": [["info", "Fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — So let us not grow weary in doing what is right. Galatians 6:9"], ["dateVerse", "Sunday, July 7", "Isaiah 66:10-14", "Psalm 66:1-9", "Galatians 6:(1-6),7-16", "Luke 10:1-11,16-20"], ["watchD", "Seek the Lord, all you humble of the land, who do his commands; seek righteousness, seek humility. Zephaniah 2:3"], ["docT", "Blessed are those who hunger and thirst for righteousness, for they will be filled. Matthew 5:6"], ["prayer", "Lord, we seek to find you daily, and to follow along your path of righteousness. Teach us and guide us so we may live and lead others fully in your way. Thank you, gracious God. Amen."]], "189": [["dateVerse", "Monday, July 8", "Psalm 82:5–8", "Isaiah 26,27", "Ephesians 4:7–16"], ["watchD", "Who dares despise the day of small things, will rejoice when they see the chosen capstone. Zechariah 4:10 NIV"], ["docT", "Jesus said, “The kingdom of heaven is like a mustard seed that someone took and sowed in his field; it is the smallest of all the seeds, but when it has grown it is the greatest of shrubs and becomes a tree, so that the birds of the air come and make nests in its branches.” Matthew 13:31-32"], ["prayer", "Father God, you have laid a strong foundation. We pray our hearts be opened to build our lives upon this foundation. We are weak without you, yet strong with you. Thank you for your strength in our lives. In Jesus’ name we pray. Amen."]], "190": [["dateVerse", "Tuesday, July 9", "Psalm 83:1–8", "Isaiah 28", "Ephesians 4:17–28"], ["watchD", "Thus says the Lord, “Seek me and live.” Amos 5:4"], ["docT", "While you have the light, believe in the light, so that you may become children of light. John 12:36"], ["prayer", "Dear Lord, give us opportunities to seek you. Put us in situations where we must lean on you, for this is when we can and will be filled with your light. Let us shine your light brightly for others to see. In Jesus’ name we pray. Amen."]], "191": [["dateVerse", "Wednesday, July 10", "Psalm 83:9–12", "Isaiah 29", "Ephesians 4:29–5:7"], ["watchD", "When the song was raised, with trumpets and cymbals and other musical instruments, in praise to the Lord, “For he is good, for his steadfast love endures forever,” the glory of the Lord filled the house of God. 2 Chronicles 5:13,14"], ["docT", "I pray that you may have the power to comprehend, with all the saints, what is the breadth and length and height and depth, and to know the love of Christ that surpasses knowledge, so that you may be filled with all the fullness of God. Ephesians 3:18-19"], ["prayer", "Amazing God, we pray for all people to come to know the fullness you bring. Help us fill our lives with your love and compassion, and let it overflow so others will want the same. It is in your loving name we pray. Amen."]], "192": [["dateVerse", "Thursday, July 11", "Psalm 83:13–18", "Isaiah 30,31", "Ephesians 5:8–20"], ["watchD", "The Lord shall arbitrate for many peoples; they shall beat their swords into plowshares, and their spears into pruning-hooks. Isaiah 2:4"], ["docT", "Glory to God in the highest heaven, and on earth peace among those whom he favors! Luke 2:14"], ["prayer", "Father God, thank you for your judgment, your glory, and your peace given to each of us. All three help keep us on course to do your will. Thank you for who you will always be. Amen."]], "193": [["dateVerse", "Friday, July 12", "Psalm 84:1–7", "Isaiah 32:1–33:16", "Ephesians 5:21–33"], ["watchD", "The Lord says, “If you obey my voice and keep my covenant, you shall be my treasured possession out of all the peoples. Indeed, the whole earth is mine.” Exodus 19:5"], ["docT", "God saved us and called us with a holy calling, not according to our works but according to his own purpose and grace. This grace was given to us in Christ Jesus before the ages began. 2 Timothy 1:9"], ["prayer", "Lord of grace, you have called us to be your people, to do your work, and to be filled with your Holy Spirit. Please guide and strengthen us with the love you have shown from the very beginning. In your holy name. Amen."]], "194": [["dateVerse", "Saturday, July 13", "Psalm 84:8–12", "Isaiah 33:17–35:10", "Ephesians 6:1–9"], ["watchD", "Woe to him who piles up stolen goods and makes himself wealthy by extortion! How long must this go on? Habakkuk 2:6 NIV"], ["docT", "Jesus said, “Take care! Be on your guard against all kinds of greed; for one’s life does not consist in the abundance of possessions.” Luke 12:15"], ["prayer", "O Lord, we confess and ask forgiveness for our greed. Too often we treasure material possessions more than your word. Help us focus on your word and the life everlasting promised us. In your ever-faithful name. Amen."]], "195": [["info", "Fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — Make me to know your ways, O Lord; teach me your paths. Psalm 25:4"], ["dateVerse", "Sunday, July 14", "Deuteronomy 30:9-14", "Psalm 25:1-10", "Colossians 1:1-14", "Luke 10:25-37"], ["watchD", "Give us life, and we will call on your name. Psalm 80:18"], ["docT", "Jesus said to the blind man, “Receive your sight; your faith has saved you.” Immediately he regained his sight and followed him, glorifying God. Luke 18:42-43"], ["prayer", "Giver of life, we call on you to breathe new life into all of us. Take away the darkness and make us who you want us to be. Let your spirit wash over us, and help us to love as you do. Amen."]], "196": [["dateVerse", "Monday, July 15", "Psalm 85:1–7", "Isaiah 36:1–37:13", "Ephesians 6:10–24"], ["watchD", "The Lord your God is testing you, to know whether you indeed love the Lord your God with all your heart and soul. Deuteronomy 13:3"], ["docT", "We know that suffering produces perseverance, perseverance, character; and character, hope. Romans 5:3-4 NIV"], ["prayer", "Holy God, you have suffered greatly for each one of us. You have shown incredible and amazing love. Because of your love, we are able to persevere with character and grace. It is our hope to one day see you face to face. Amen."]], "197": [["dateVerse", "Tuesday, July 16", "Psalm 85:8–13", "Isaiah 37:14–38", "Philippians 1:1–11"], ["watchD", "For in many dreams and in many words there is emptiness. Rather, fear God. Ecclesiastes 5:7 NASB"], ["docT", "If any of you is lacking in wisdom, ask God, who gives to all generously and ungrudgingly. James 1:5"], ["prayer", "O God of wisdom, let us not take for granted your generosity and love. Fill us with wisdom to fear life without you. Thank you for your infinite gift. Amen."]], "198": [["dateVerse", "Wednesday, July 17", "Psalm 86:1–10", "Isaiah 38:1–40:5", "Philippians 1:12–22"], ["watchD", "The Lord our God is righteous in everything he does. Daniel 9:14 NIV"], ["docT", "Every good gift and every perfect gift is from above, and comes down from the Father of lights, with whom there is no variation or shadow of turning. James 1:17 NKJV"], ["prayer", "Almighty God, we thank you for the gifts you have given us. Present us with opportunities to use these gifts to grow your kingdom. Help us to stay by your side every step of the way. Amen."]], "199": [["dateVerse", "Thursday, July 18", "Psalm 86:11–17", "Isaiah 40:6–41:7", "Philippians 1:23–2:4"], ["watchD", "The Lord is slow to anger but great in power; the Lord will not leave the guilty unpunished. Nahum 1:3 NIV"], ["docT", "Regard the patience of our Lord as salvation. 2 Peter 3:15"], ["prayer", "Patient Lord, we know we fall short every day; teach us to be like you, slow to anger and full of grace. In your name we pray. Amen."]], "200": [["dateVerse", "Friday, July 19", "Psalm 87", "Isaiah 41:8–42:9", "Philippians 2:5–18"], ["watchD", "I hold my life in my hand continually, but I do not forget your law. Psalm 119:109"], ["docT", "Paul wrote: And you became imitators of us and of the Lord, for in spite of persecution you received the word with joy inspired by the Holy Spirit. 1 Thessalonians 1:6"], ["prayer", "Our gracious Lord, today we simply ask that your hand be upon us. Grant us the ability to be like you. Let your exemplary life on this earth always be followed. Amen."]], "201": [["dateVerse", "Saturday, July 20", "Psalm 88:1–5", "Isaiah 42:10–43:21", "Philippians 2:19–30"], ["watchD", "The earth will be full of the knowledge of the Lord as the waters cover the sea. Isaiah 11:9"], ["docT", "God was pleased to have all his fullness dwell in Christ, and through him to reconcile to himself all things, whether things on earth or things in heaven, by making peace through his blood, shed on the cross. Colossians 1:19-20 NIV"], ["prayer", "Loving God, many years ago you sent your son for us. You sent him to pay the ultimate price so that we may live with you forever. Thank you for loving us even when we are not deserving. Amen. "]], "202": [["info", "Sixth Sunday after Pentecost"], ["watchO", "Watchword for the week — Is anything too wonderful for the Lord? Genesis 18:14"], ["dateVerse", "Sunday, July 21", "Genesis 18:1-10a", "Psalm 15", "Colossians 1:15-28", "Luke 10:38-42"], ["watchD", "The Lord says, “I desire steadfast love and not sacrifice, the knowledge of God rather than burnt-offerings.” Hosea 6:6"], ["docT", "And now faith, hope, and love abide, these three; and the greatest of these is love. 1 Corinthians 13:13"], ["prayer", "God, you have given us your love. We pray your love will burn within us so fiercely that we cannot keep it to ourselves. Be with us today and always. Amen."]], "203": [["dateVerse", "Monday, July 22", "Psalm 88:6–12", "Isaiah 43:22–44:23", "Philippians 3:1–11"], ["watchD", "Those of steadfast mind you keep in peace—in peace because they trust in you. Isaiah 26:3"], ["docT", "We want each one of you to show the same diligence so as to realize the full assurance of hope to the very end. Hebrews 6:11"], ["prayer", "O God, we put our trust and hope in you. We cannot wait for the glorious day that we will be with you. Thank you for the peace of knowing what is to come for your children. In Jesus’ name we pray. Amen."]], "204": [["dateVerse", "Tuesday, July 23", "Psalm 88:13–18", "Isaiah 44:24–45:25", "Philippians 3:12–4:1"], ["watchD", "Out of the depths I cry to you, O Lord. Lord, hear my voice! Psalm 130:1-2"], ["docT", "Jesus spoke to the disciples, “Take heart, it is I; do not be afraid.” Matthew 14:27"], ["prayer", "Lord, hear our cry. At times, we tend to walk away from you, yet know we should never stray. Guide us away from the darkness and take away our fear, that we may know that you are with us. Thank you for never forsaking us. Amen."]], "205": [["dateVerse", "Wednesday, July 24", "Psalm 89:1–8", "Isaiah 46:1–48:6", "Philippians 4:2–13"], ["watchD", "I will look to the Lord, I will wait for the God of my salvation; my God will hear me. Micah 7:7"], ["docT", "Hope does not disappoint us. Romans 5:5"], ["prayer", "Loving God, thank you for scripture that reminds us of who you are. You are faithful, loving, providing, accepting, and so much more. We thank you today for holding your arms open and wanting us to be held by them. Continue to guide us on your path. Amen."]], "206": [["dateVerse", "Thursday, July 25", "Psalm 89:9–18", "Isaiah 48:7–49:21", "Philippians 4:14–23"], ["watchD", "The Lord answered Job, “Where were you when I laid the foundation of the earth? and said to the sea, ‘Thus far shall you come, and no farther, and here shall your proud waves be stopped’?” Job 38:4,11"], ["docT", "By faith we understand that the worlds were prepared by the word of God, so that what is seen was made from things that are not visible. Hebrews 11:3"], ["prayer", "Dear God, we know through faith the many wonders you have created. You have given boundaries, limits, and rules to follow through those creations. Let us now, with our faith, continue to follow in your way. In your name we pray. Amen."]], "207": [["dateVerse", "Friday, July 26", "Psalm 89:19–29", "Isaiah 49:22–51:16", "Colossians 1:1–14"], ["watchD", "Return to me, says the Lord of hosts, and I will return to you. Zechariah 1:3"], ["docT", "Jesus said, “I have come to call not the righteous but sinners.” Matthew 9:13"], ["prayer", "Lord, you call each one of us to come unto you. As sinners, we know your truth and the door opens. For that we are grateful. Thank you for being ever-present! Amen. "]], "208": [["dateVerse", "Saturday, July 27", "Psalm 89:30–37", "Isaiah 51:17–53:12", "Colossians 1:15–27"], ["watchD", "The ransomed of the Lord shall return, they shall obtain joy and gladness, and sorrow and sighing shall flee away. Isaiah 51:11"], ["docT", "We will be with the Lord forever. 1 Thessalonians 4:17"], ["prayer", "Heavenly God, as we await our call home, we continue to do your work here on Earth. The day is coming where we will see you face to face, and it will surely be a day full of joy and gladness. Amen."]], "209": [["info", "Seventh Sunday after Pentecost"], ["watchO", "Watchword for the week — Lord, teach us to pray. Luke 11:1"], ["dateVerse", "Sunday, July 28", "Genesis 18:20-32", "Psalm 138", "Colossians 2:6-15,(16-19)", "Luke 11:1-13"], ["watchD", "You who seek God, your hearts shall live. Psalm 69:32 NKJV"], ["docT", "Mary sat at the Lord’s feet and listened to what he was saying. Luke 10:39"], ["prayer", "Loving God, just as children listen to their parents, let us be drawn to listen to you even more. Let the world slow down around us, allowing you to be clearly heard. Quiet our minds, and let us be led by our hearts. In your name we pray. Amen."]], "210": [["dateVerse", "Monday, July 29", "Psalm 89:38–45", "Isaiah 54,55", "Colossians 1:28–2:10"], ["watchD", "The Lord has granted me the petition that I made to him. 1 Samuel 1:27"], ["docT", "Jesus said, “Ask, and it will be given you; search, and you will find; knock, and the door will be opened for you.” Matthew 7:7"], ["prayer", "Gracious God, you listen when we ask; you are present when we search; and you open the door wide when we knock. Thank you for being so loving, so good, and so kind. In Jesus’ name we pray. Amen."]], "211": [["dateVerse", "Tuesday, July 30", "Psalm 89:46–52", "Isaiah 56,57", "Colossians 2:11–23"], ["watchD", "I believe that I shall see the goodness of the Lord in the land of the living. Psalm 27:13"], ["docT", "To the thirsty I will give water as a gift from the spring of the water of life. Revelation 21:6"], ["prayer", "O Lord, we drink of the living water and avail ourselves of all you offer. Keep us growing by your hand and help us bloom into people worthy of you. It is in your precious and holy name we pray. Amen."]], "212": [["dateVerse", "Wednesday, July 31", "Psalm 90", "Isaiah 58,59", "Colossians 3:1–11"], ["watchD", "The Lord is in his holy temple; let all the earth keep silence before him! Habakkuk 2:20 "], ["docT", "Let anyone with ears listen! Matthew 11:15"], ["prayer", "Lord, help us to hear your expectations of us. If it is to help others, place them in our paths. If it is to listen, let our ears be opened. If it is to be still, help us calm our distractions. We pray in Jesus’ name. Amen. "]], "213": [["dateVerse", "Thursday, August 1", "Psalm 91:1–8", "Isaiah 60,61", "Colossians 3:12–25"], ["watchD", "But you, O Lord, do not be far from me; O my strength, hasten to help me! Psalm 22:19 NKJV"], ["docT", "Paul said, “To this day I have had help from God, and so I stand here, testifying to both small and great.” Acts 26:22"], ["prayer", "Mighty God, many times we could have fallen and not stood up again. Through the unexpected challenges of life, you have given us everything we need. May we pass these blessings on to others. In Jesus’ name we pray. Amen."]], "214": [["dateVerse", "Friday, August 2", "Psalm 91:9–16", "Isaiah 62,63", "Colossians 4:1–9"], ["watchD", "When the ways of people please the Lord, he causes even their enemies to be at peace with them. Proverbs 16:7"], ["docT", "Love your enemies, do good, and lend, expecting nothing in return. Your reward will be great, and you will be children of the Most High. Luke 6:35"], ["prayer", "Protector of Peace, strengthen and unite the souls of all people. With our hearts broken and selfish, direct us toward service to humanity. Turn us from vindictiveness, and teach us to love one another. Amen. "]], "215": [["dateVerse", "Saturday, August 3", "Psalm 92:1–8", "Isaiah 64,65", "Colossians 4:10–1", "Thessalonians 1:5a"], ["watchD", "Hear, you who are far away, what I have done; and you who are near, acknowledge my might. Isaiah 33:13"], ["docT", "God who did not withhold his own Son, but gave him up for all of us, will he not with him also give us everything else? Romans 8:32"], ["prayer", "Eternal God, we humbly come before you with gratitude and praise. Do not distract us from the evils of this world, but prepare and deliver us to triumph over them. May our service on this earth glorify you. In Jesus’ name we pray. Amen."]], "216": [["info", "Eighth Sunday after Pentecost"], ["watchO", "Watchword for the week — Set your minds on things that are above, not on things that are on earth. Colossians 3:2"], ["dateVerse", "Sunday, August 4", "Ecclesiastes 1:2,12-14,2:18-23", "Psalm 49:1-12", "Colossians 3:1-11", "Luke 12:13-21"], ["watchD", "Holy, holy, holy is the Lord of hosts; the whole earth is full of his glory. Isaiah 6:3"], ["docT", "Hallelujah! For the Lord our God the Almighty reigns. Let us rejoice and exult and give him the glory. Revelation 19:6-7"], ["prayer", "Maker of all things life-giving and timeless, we praise your holy name. Keep our spirits lifted as high as the hills, and our eyes fixed on you. Take us to the ends of the earth to share your love. Amen."]], "217": [["dateVerse", "Monday, August 5", "Psalm 92:9–15", "Isaiah 66–Jeremiah 1:7", "1 Thessalonians 1:5b–2:9"], ["watchD", "Yet, O Lord, you are our Father; we are the clay, and you are our potter; we are all the work of your hand. Isaiah 64:8"], ["docT", "We are what he has made us, created in Christ Jesus for good works. Ephesians 2:10"], ["prayer", "Vivacious Creator, mold our spirits into those of peace, joy, and truth. Grant us the inspiration to reach for the highest of potentials you have for us. Place on our hearts the desire to be like you. Amen."]], "218": [["dateVerse", "Tuesday, August 6", "Psalm 93", "Jeremiah 1:8–2:19", "1 Thessalonians 2:10–20"], ["watchD", "He who vindicates me is near. Who will contend with me? Isaiah 50:8"], ["docT", "Jesus said, “Zacchaeus, hurry and come down; for I must stay at your house today.” Luke 19:5"], ["prayer", "Great Voice of truth and wisdom, we accept the invitation to represent you. Coach us to be humble as we interact with the inhabitants of your creation. Place before us fields of opportunity to grow. In Jesus’ name we pray. Amen."]], "219": [["dateVerse", "Wednesday, August 7", "Psalm 94:1–11", "Jeremiah 2:20–3:13", "1 Thessalonians 3"], ["watchD", "But you, O Bethlehem of Ephrathah, who are one of the little clans of Judah, from you shall come forth for me one who is to rule in Israel, whose origin is from of old, from ancient days. Micah 5:2"], ["docT", "God chose what is low and despised in the world, things that are not, to reduce to nothing things that are. 1 Corinthians 1:28"], ["prayer", "Eternal Lord, we know that our imperfections are many. Journey with us as we seek to right our wrongs. Make our hearts and souls clean, so they may have more room for your love. Amen."]], "220": [["dateVerse", "Thursday, August 8", "Psalm 94:12–23", "Jeremiah 3:14–4:22", "1 Thessalonians 4:1–12"], ["watchD", "In your hand are power and might, so that no one is able to withstand you. 2 Chronicles 20:6"], ["docT", "Now to him who by the power at work within us is able to accomplish abundantly far more than all we can ask or imagine, to him be glory in the church and in Christ Jesus to all generations, forever and ever. Ephesians 3:20-21"], ["prayer", "Almighty God, we find our hope and direction in you. Don’t abandon us, but push us forward into the world you created, and the lives you want us to live. May all that we say and do be fruitful. Amen."]], "221": [["dateVerse", "Friday, August 9", "Psalm 95", "Jeremiah 4:23–5:25", "1 Thessalonians 4:13–5:3"], ["watchD", "Not by might, nor by power, but by my spirit, says the Lord of hosts. Zechariah 4:6"], ["docT", "Through the Spirit we eagerly await by faith the righteousness for which we hope. Galatians 5:5 NIV"], ["prayer", "Bring us closer to you, O Lord, so that we may hear your call. From our places of darkness and comfort, call on us to be laborers in your world. Before our time on earth is over, may our service please you. Amen."]], "222": [["dateVerse", "Saturday, August 10", "Psalm 96:1–9", "Jeremiah 5:26–6:30", "1 Thessalonians 5:4–15"], ["watchD", "You shall not join hands with the wicked to act as a malicious witness. Exodus 23:1"], ["docT", "By your words you will be justified, and by your words you will be condemned. Matthew 12:37"], ["prayer", "Master of all, judge of people and nations, send us into the world to carry forth your vision. May we wander through forests of uncertainty, knowing you are with us. Work in us and through us. Send us. Amen."]], "223": [["info", "Ninth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus says, “Do not be afraid, little flock, for it is your Father’s good pleasure to give you the kingdom.” Luke 12:32"], ["dateVerse", "Sunday, August 11", "Genesis 15:1-6", "Psalm 33:12-22", "Hebrews 11:1-3,8-16", "Luke 12:32-40"], ["watchD", "The Lord waits to be gracious to you; therefore he will rise up to show mercy to you. Isaiah 30:18"], ["docT", "You then, my child, be strong in the grace that is in Christ Jesus. 2 Timothy 2:1"], ["prayer", "Teacher, you have graced us with the gifts of life and song. Sweet melody is your word; keep our voices strong. Give us trumpets to sound your call while silencing the noises of oppression. Amen. "]], "224": [["dateVerse", "Monday, August 12", "Psalm 96:10–13", "Jeremiah 7", "1 Thessalonians 5:16–28"], ["watchD", "They sang responsively, praising and giving thanks to the Lord, ‘For he is good, for his steadfast love endures forever. Ezra 3:11"], ["docT", "The entire crowd was rejoicing at all the wonderful things that Jesus was doing. Luke 13:17"], ["prayer", "Nurturing Lord, fill our hearts with songs of praise and joy. Show us more of your creation. Bring us, your orchestra, in harmony with each other. Send us out as members of your holy chorus. Amen."]], "225": [["dateVerse", "Tuesday, August 13", "Psalm 97:1–6", "Jeremiah 8:1–9:9", "2 Thessalonians 1"], ["specialVerse", "August Thirteenth Festival†", "Joshua 24:16-24", "Psalm 133", "1 John 4:1-13", "John 17:1-2,6-19"], ["watchD", "He makes me lie down in green pastures; he leads me beside still waters; he restores my soul. Psalm 23:2-3"], ["docT", "Jesus said, “I came that they may have life, and have it abundantly.” John 10:10"], ["prayer", "Heavenly Guide, although we have come so far over many years, we know there is much yet to be done. Diversity throughout peoples and nations is a testament to your creativity and awesome power. Carry us forward, serving every unique member of your worldwide congregation. Amen."], ["info", "†On this date in 1727 in Berthelsdorf, Saxony (now Germany), a group of quarreling Christians experienced their unity in Christ through the power of the Holy Spirit. This new Pentecost marked the revival of the Unity of the Brethren, begun in 1457, and the beginning of the Renewed Moravian Church."]], "226": [["dateVerse", "Wednesday, August 14", "Psalm 97:7–12", "Jeremiah 9:10–10:16", "2 Thessalonians 2:1–12"], ["watchD", "I want you to fear and respect me. Zephaniah 3:7 ERV"], ["docT", "Repent, for the kingdom of heaven has come near. Matthew 4:17"], ["prayer", "Triumphant Lord, our instruments are not loud enough to ring sufficient praises in your name! Reveal your greatness to us each day. Take us onward in your service, producing fruits for your people. Remind us that all we do is for you. Amen."]], "227": [["dateVerse", "Thursday, August 15", "Psalm 98", "Jeremiah 10:17–11:23", "2 Thessalonians 2:13–3:5"], ["watchD", "How beautiful on the mountains are the feet of those who bring good news, who proclaim peace, who bring good tidings, who proclaim salvation, who say to Zion, “Your God reigns!” Isaiah 52:7 NIV"], ["docT", "Whatever house you enter, first say, ‘Peace to this house!’ Luke 10:5"], ["prayer", "Truest Neighbor, we thank you for the valleys and the hills, the ponds and the sea from which to shout your name. Keep us busy turning the fields and fishing the waters in search of more people with whom to share your word. Teach us, from our youngest of days, to care for your creation. Amen."]], "228": [["dateVerse", "Friday, August 16", "Psalm 99", "Jeremiah 12:1–13:19", "2 Thessalonians 3:6–18"], ["watchD", "I, the Lord, am the vineyard’s keeper; every moment I water it. I guard it night and day so that no one can harm it. Isaiah 27:3"], ["docT", "God’s firm foundation stands, bearing this inscription: “The Lord knows those who are his.” 2 Timothy 2:19"], ["prayer", "Compassionate Lord, we ask your continued protection from forces of evil and hate. As we journey through life, may we be reminded that only your judgment counts. Forgive us when we fall short, and guide us back to you. In Jesus’ name we pray. Amen."]], "229": [["dateVerse", "Saturday, August 17", "Psalm 100", "Jeremiah 13:20–14:22", "1 Timothy 1:1–11"], ["watchD", "Thus says the Lord, “How long will you refuse to humble yourself before me?” Exodus 10:3"], ["docT", "Submit yourselves therefore to God. Resist the devil, and he will flee from you. James 4:7"], ["prayer", "Ruler of nations, we humble our hearts and tongues before you. Join our spirits with yours so that we may go into the world and bear fruits that will last. Make us instruments of your will. Amen."]], "230": [["info", "Tenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let us run with perseverance the race that is set before us, looking to Jesus the pioneer and perfecter of our faith. Hebrews 12:2"], ["dateVerse", "Sunday, August 18", "Jeremiah 23:23-29", "Psalm 82", "Hebrews 11:29-12:2", "Luke 12:49-56"], ["watchD", "Commit your way to the Lord; trust in him, and he will act. Psalm 37:5"], ["docT", "I am confident of this, that the one who began a good work among you will bring it to completion by the day of Jesus Christ. Philippians 1:6"], ["prayer", "Lord, although we too often show doubt or forget to trust in you, you never doubt or lose sight of us. Somehow, you always reveal yourself and draw us back to you. Mend us, imperfect beings. In Jesus’ name we pray. Amen. "]], "231": [["dateVerse", "Monday, August 19", "Psalm 101", "Jeremiah 15:1–16:13", "1 Timothy 1:12–2:7"], ["watchD", "Behold, your King is coming to you; He is just and having salvation, lowly and riding on a donkey. Zechariah 9:9 NKJV"], ["docT", "The Son of Man came not to be served but to serve, and to give his life a ransom for many. Matthew 20:28"], ["prayer", "Comforter and Sustainer, we bring to you our sorrows, so they may be lifted like the fog to reveal the sun. Giver of life, we offer thanks for the peace we find in companionship with you and your servants. Brighter are the days ahead because of you. In Jesus’ name we pray. Amen. "]], "232": [["dateVerse", "Tuesday, August 20", "Psalm 102:1–11", "Jeremiah 16:14–17:27", "1 Timothy 2:8–3:7"], ["watchD", "He is named Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace. Isaiah 9:6"], ["docT", "Jesus asked the disciples, “But who do you say that I am?” Matthew 16:15"], ["prayer", "Magnificent Lord, you have called us by name to go and serve your people. May we seek to give voice to the voiceless, and join spirits with no regard for color, class, or language. Amen."]], "233": [["dateVerse", "Wednesday, August 21†", "Psalm 102:12–22", "Jeremiah 18:1–19:9", "1 Timothy 3:8–16"], ["watchD", "I must bear the indignation of the Lord, because I have sinned against him. Micah 7:9"], ["docT", "Humble yourselves before the Lord, and he will exalt you. James 4:10"], ["prayer", "Blessed Redeemer, you have chosen us and we have sinned. Thank you for standing by us despite our imperfections. Daily, we will seek to do better by your holy name. Amen. "], ["info", "†On this day in 1732, the first missionaries departed from Herrnhut bound for St. Thomas."]], "234": [["dateVerse", "Thursday, August 22", "Psalm 102:23–28", "Jeremiah 19:10–21:10", "1 Timothy 4:1–10"], ["watchD", "He was cut off from the land of the living, stricken for the transgression of my people. Isaiah 53:8"], ["docT", "Consider him who endured such hostility against himself from sinners, so that you may not grow weary or lose heart. Hebrews 12:3"], ["prayer", "Everlasting Lord, you endured the greatest of suffering so that we would be free! Darkest days were yours to bear so that the sun could be ours. May we spend our whole lives repaying you. In Jesus’ name we pray. Amen. "]], "235": [["dateVerse", "Friday, August 23", "Psalm 103:1–5", "Jeremiah 21:11–22:30", "1 Timothy 4:11–5:8"], ["watchD", "Yours, O Lord, are the greatness, the power, the glory, the victory, and the majesty; for all that is in the heavens and on the earth is yours. 1 Chronicles 29:11"], ["docT", "You are worthy, our Lord and God, to receive glory and honor and power, for you created all things, and by your will they existed and were created. Revelation 4:11"], ["prayer", "Righteous Lord, you are our greatest mentor. Blessed are we who have been guided by your words and by those servants who have answered your call. Ask us to sing praises to your name, and we will gather an entire chorus. Bowing before you, we lift your name. Amen."]], "236": [["dateVerse", "Saturday, August 24", "Psalm 103:6–18", "Jeremiah 23:1–32", "1 Timothy 5:9–16"], ["watchD", "If you seek me with all your heart, I will let you find me, says the Lord. Jeremiah 29:13-14"], ["docT", "Set your minds on things that are above, not on things that are on earth. Colossians 3:2"], ["prayer", "All-knowing God, we search for you in the coming and going of the ocean tides, the passing years, and the shedding of tears. Each season brings us closer to you. Lord, continue to surprise us, inspire us, and reside in the mysteries of life. Lift our spirits. Amen."]], "237": [["info", "Eleventh Sunday after Pentecost "], ["watchO", "Watchword for the week — The steadfast love of the Lord is from everlasting to everlasting on those who fear him. Psalm 103:17"], ["dateVerse", "Sunday, August 25", "Isaiah 58:9b-14", "Psalm 103:1-8", "Hebrews 12:18-29", "Luke 13:10-17"], ["watchD", "The surviving remnant of the house of Judah shall again take root downwards, and bear fruit upwards. 2 Kings 19:30"], ["docT", "If the root is holy, then the branches also are holy. Romans 11:16"], ["prayer", "Master, your reign exceeds all time and space. May we, your servants, ensure that all generations to come continue to seek your direction. With your blessing and guidance, may our foundation become firm. Amen."]], "238": [["dateVerse", "Monday, August 26", "Psalm 103:19–22", "Jeremiah 23:33–25:14", "1 Timothy 5:17–6:2"], ["watchD", "Thus says the Lord, “In a time of favor I have answered you, on a day of salvation I have helped you.” Isaiah 49:8"], ["docT", "The same Lord is Lord of all and is generous to all who call on him. Romans 10:12"], ["prayer", "Mighty Oak of the universe, your influence branches out into every aspect of our being. Send us out into the world so that your word may grow. Make us gardeners of your creation. Call us to nurture those vulnerable and dying among us. Amen. "]], "239": [["dateVerse", "Tuesday, August 27", "Psalm 104:1–9", "Jeremiah 25:15–26:9", "1 Timothy 6:3–16"], ["watchD", "See, I am sending my messenger to prepare the way before me. Malachi 3:1"], ["docT", "The angel said to the shepherds, “Do not be afraid; for see—I am bringing you good news of great joy for all the people.” Luke 2:10"], ["prayer", "Everlasting Lord, fill us with the comfort and knowledge that you are with us. Catch us when we fall, and encourage us when we make you glad. May our lives be devoted to a relationship with your spirit. Amen."]], "240": [["dateVerse", "Wednesday, August 28", "Psalm 104:10–18", "Jeremiah 26:10–27:22", "1 Timothy 6:17–2 Timothy 1:7"], ["watchD", "Moses said to God, “Who am I that I should go to Pharaoh, and bring the Israelites out of Egypt?” God said, “I will be with you.” Exodus 3:11-12"], ["docT", "My grace is sufficient for you, for power is made perfect in weakness. 2 Corinthians 12:9"], ["prayer", "Just God, you have called us to go and serve the people at every longitude and latitude crossing this earth. You have set a fire in our hearts and inspired us in word and example! Remind us daily of the vision you have for us. Amen."]], "241": [["dateVerse", "Thursday, August 29", "Psalm 104:19–23", "Jeremiah 28:1–29:14", "2 Timothy 1:8–18"], ["watchD", "The fear of the Lord is instruction in wisdom. Proverbs 15:33"], ["docT", "Anyone who claims to know something does not yet have the necessary knowledge; but anyone who loves God is known by him. 1 Corinthians 8:2-3"], ["prayer", "Dearest Lord, there are so many people in this world who are yearning to be set free from oppression. Make us into vessels of empowerment, delivering the fruit of your spirit. Send us into this world and deliver us home after your deeds are done. Amen."]], "242": [["dateVerse", "Friday, August 30", "Psalm 104:24–30", "Jeremiah 29:15–30:11", "2 Timothy 2:1–13"], ["watchD", "Who knows? God may relent and change his mind; he may turn from his fierce anger, so that we do not perish. Jonah 3:9"], ["docT", "The Lord is patient with you, not wanting any to perish, but all to come to repentance. 2 Peter 3:9"], ["prayer", "Lord, our imperfections often confine us and restrict our potential. Forgive us so that we may be set free to begin anew in you. We owe such a debt of gratitude already. May our fruitful and life-giving deeds be our payment. In Jesus’ name we pray. Amen."]], "243": [["dateVerse", "Saturday, August 31", "Psalm 104:31–35", "Jeremiah 30:12–31:22", "2 Timothy 2:14–26"], ["watchD", "Our help is in the name of the Lord, who made heaven and earth. Psalm 124:8"], ["docT", "Your Father knows what you need before you ask him. Matthew 6:8"], ["prayer", "Maker of heaven and earth and all points between, help us to see the beauty in what others pass by. Lead us to a time and place where each unique aspect of your creation is appreciated. Move our spirits toward common peace. Amen."]], "244": [["info", "Twelfth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let mutual love continue. Hebrews 13:1  "], ["dateVerse", "Sunday, September 1", "Proverbs 25:6-7", "Psalm 112", "Hebrews 13:1-8,15-16", "Luke 14:1,7-14"], ["watchD", "O give thanks to the Lord of Lords, who alone does great wonders, for his steadfast love endures forever. Psalm 136:3,4 "], ["docT", "Thanks be to God for his indescribable gift! 2 Corinthians 9:15 "], ["prayer", "Dearest Lord, we thank you for your enduring love for us—a love so large that we cannot even comprehend it fully. It is because we are so loved that we are able to share kindness and love with others. In your name we pray. Amen."]], "245": [["dateVerse", "Monday, September 2", "Psalm 105:1–7", "Jeremiah 31:23–32:15", "2 Timothy 3:1–9"], ["watchD", "The Lord says, “I will be gracious to whom I will be gracious, and will show mercy on whom I will show mercy.” Exodus 33:19    "], ["docT", "There is no distinction, since all have sinned and fall short of the glory of God; they are now justified by his grace as a gift. Romans 3:22-24"], ["prayer", "O Lord, we are all sinners, but you have chosen us as your own and have given us your glorious gifts of forgiveness and grace, so that we might face another day. Thank you for your life-restoring mercy. Amen."]], "246": [["dateVerse", "Tuesday, September 3", "Psalm 105:8–15", "Jeremiah 32:16–33:5", "2 Timothy 3:10–4:8"], ["watchD", "I will wait for the Lord, who is hiding his face from the house of Jacob. Isaiah 8:17"], ["docT", "So we are always confident; even though we know that while we are at home in the body we are away from the Lord—for we walk by faith, not by sight. 2 Corinthians 5:6-7  "], ["prayer", "Dear Lord, help us to remember your promise to be with us always, so that we can walk this earthly path with faith and confidence. May our eyes be fixed firmly on the treasure that is ours, when we see you face to face. Amen."]], "247": [["dateVerse", "Wednesday, September 4", "Psalm 105:16–22", "Jeremiah 33:6–34:7", "2 Timothy 4:9–22"], ["watchD", "Things that we have heard and known, that our ancestors have told us—we will not hide them from their children. Psalm 78:3-4 "], ["docT", "No one after lighting a lamp puts it under the bushel basket, but on the lampstand, and it gives light to all in the house. Matthew 5:15  "], ["prayer", "Lord, help us to live our lives, so that others may see the reflection of your light and love through us. May we demonstrate your love in our homes, our churches, and our communities each day. Amen."]], "248": [["dateVerse", "Thursday, September 5", "Psalm 105:23–36", "Jeremiah 34:8–35:19", "Titus 1:1–9"], ["watchD", "Let the heavens be glad, and let the earth rejoice, and let them say among the nations, ‘The Lord is king!’ 1 Chronicles 16:31 "], ["docT", "At the name of Jesus every knee should bend, in heaven and on earth and under the earth. Philippians 2:10 "], ["prayer", "Almighty God, we kneel before you in adoration and rejoice that you are our Lord and King. Thank you for the amazing gift of your Son, our Savior, and for the Holy Spirit who lives within us. Amen."]], "249": [["dateVerse", "Friday, September 6", "Psalm 105:37–45", "Jeremiah 36", "Titus 1:10–2:5"], ["watchD", "How very good and pleasant it is when kindred live together in unity! For there the Lord ordained his blessing, life for evermore. Psalm 133:1,3 "], ["docT", "Be devoted to one another in love. Honor one another above yourselves. Romans 12:10 NIV "], ["prayer", "Lord God, source of all love, teach us to live our lives as Christ taught us, showing that same unlimited love and respect to all, so that we might live in peace and harmony in this world. Amen."]], "250": [["dateVerse", "Saturday, September 7", "Psalm 106:1–5", "Jeremiah 37:1–38:13", "Titus 2:6–3:2"], ["watchD", "Look at the proud! Their spirit is not right in them, but the righteous live by their faith. Habakkuk 2:4  "], ["docT", "Take my yoke upon you, and learn from me; for I am gentle and humble in heart, and you will find rest for your souls. Matthew 11:29 "], ["prayer", "Lord, teach us to be humble as we follow in your footsteps. Renew a right spirit within us. As we learn to trust you and give ourselves fully to you, we will find the rest and peace that we all seek. Amen."]], "251": [["info", "Thirteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Choose life so that you and your descendants may live, loving the Lord your God, obeying him, and holding fast to him. Deuteronomy 30:19,20"], ["dateVerse", "Sunday, September 8", "Deuteronomy 30:15-20", "Psalm 1", "Philemon 1-21", "Luke 14:25-33"], ["watchD", "I have put my spirit upon my servant; he will bring forth justice to the nations. Isaiah 42:1 "], ["docT", "Jesus says, “For this I was born, and for this I came into the world, to testify to the truth.” John 18:37 "], ["prayer", "Dear God, you sent your son to die on a cross to save us all from our sins. Help us to look to him and to seek his counsel, so that we might know how to live in this world in a way pleasing to you. Amen."]], "252": [["dateVerse", "Monday, September 9", "Psalm 106:6–12", "Jeremiah 38:14–39:18", "Titus 3:3–15"], ["watchD", "O my people, what have I done to you? In what have I wearied you? Answer me! Micah 6:3 "], ["docT", "The father said to the older son, “Son, you are always with me, and all that is mine is yours. But we had to celebrate and rejoice, because this brother of yours was dead and has come to life; he was lost and has been found.” Luke 15:31-32 "], ["prayer", "Lord, in this world there are so many choices. When we make the wrong choice, we are infinitely grateful to know that you are waiting with open arms to welcome us back with forgiveness and rejoicing. We need only come to you. Amen."]], "253": [["dateVerse", "Tuesday, September 10", "Psalm 106:13–23", "Jeremiah 40,41", "Philemon 1:1–11"], ["watchD", "The Lord God is a sun and shield. Psalm 84:11 "], ["docT", "Paul wrote: My God will fully satisfy every need of yours according to his riches in glory in Christ Jesus. Philippians 4:19 "], ["prayer", "Dear God, when we are in need or lost and afraid, we thank you for the assurance that we need only look to you, our sun and shield. You sent your only son that we might have what we truly need—love and forgiveness. Amen."]], "254": [["dateVerse", "Wednesday, September 11", "Psalm 106:24–31", "Jeremiah 42,43", "Philemon 1:12–25"], ["watchD", "You must not distort justice; you must not show partiality; and you must not accept bribes, for a bribe blinds the eyes of the wise and subverts the cause of those who are in the right. Deuteronomy 16:19 "], ["docT", "Everyone who names the name of the Lord is to abstain from wickedness. 2 Timothy 2:19 NASB "], ["prayer", "O Lord, we are yours. Help us to remember that fact when we are tempted to take the easy, more comfortable road. Help us to live according to your teachings, and to be honest, loving, and kind in dealing with others. Amen."]], "255": [["dateVerse", "Thursday, September 12", "Psalm 106:32–39", "Jeremiah 44", "Hebrews 1:1–9"], ["watchD", "Elijah prayed, “Answer me, Lord, answer me, so these people will know that you, Lord, are God, and that you are turning their hearts back again.” 1 Kings 18:37 NIV "], ["docT", "And this is my prayer, that your love may overflow more and more with knowledge and full insight to help you to determine what is best. Philippians 1:9-10"], ["prayer", "Lord, sometimes we are distracted by earthly pain or pleasure. We ask that you turn our hearts back to you in love and worship. Help us to study your word with discernment, so that we will know what you would have us do. Amen."]], "256": [["dateVerse", "Friday, September 13", "Psalm 106:40–48", "Jeremiah 45,46", "Hebrews 1:10–2:8a"], ["watchD", "Why is light given to one in misery, and life to the bitter in soul, who long for death, but it does not come? Job 3:20-21 "], ["docT", "Because Jesus himself was tested by what he suffered, he is able to help those who are being tested. Hebrews 2:18 "], ["prayer", "Lord, when we are tested and we long for relief, as Job did, help us to turn to you. Your suffering helps you understand our anguish. So help us, through our suffering, to then be a comfort for others. Amen. "]], "257": [["dateVerse", "Saturday, September 14", "Psalm 107:1–9", "Jeremiah 47:1–48:25", "Hebrews 2:8b–18"], ["watchD", "I will set up over them one shepherd and he shall feed them. Ezekiel 34:23"], ["docT", "Jesus said, “I am the good shepherd. I know my own and my own know me.” John 10:14 "], ["prayer", "O God, we are so thankful for the gift of your son, our shepherd. What comfort and relief to know that when we call out to him for help, he knows us by our very name and answers us. Amen."]], "258": [["info", "Fourteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The sacrifice acceptable to God is a broken spirit; a broken and contrite heart, O God, you will not despise. Psalm 51:17"], ["dateVerse", "Sunday, September 15", "Exodus 32:7-14", "Psalm 51:1-10", "1 Timothy 1:12-17", "Luke 15:1-10"], ["watchD", "I love you, O Lord, my strength. Psalm 18:1 "], ["docT", "A woman in the city, who was a sinner, began to bathe Jesus’ feet with her tears and to dry them with her hair. Then she continued kissing his feet and anointing them with the ointment. Luke 7:37,38 "], ["prayer", "Lord, you are our refuge and our strength—our salvation. May we show our gratitude and our love for you as freely and as sincerely as the one who bathed your feet with her tears. Amen."]], "259": [["info", "Ministers’ Covenant Day †"], ["dateVerse", "Monday, September 16", "Psalm 107:10–16", "Jeremiah 48:26–49:16", "Hebrews 3:1–15"], ["watchD", "Seek good and not evil, that you may live. Amos 5:14  "], ["docT", "Let the same mind be in you that was in Christ Jesus. Philippians 2:5 "], ["prayer", "O Lord, help us to shun all wrong and to seek an ever-closer walk with you, so that we might live as you intended. May we be a blessing to others, and may they catch a glimpse of you in us. In Jesus’ name we pray. Amen."], ["info", "† On September 16, 1741, at a Moravian synod in London, Jesus was recognized as Chief Elder, or head, of the Moravian Church. Moravian clergy now observe this by renewing their response to the call of Christ, and the denomination celebrates the festival day of November 13, when the synod action was announced to congregations around the world."]], "260": [["dateVerse", "Tuesday, September 17", "Psalm 107:17–22", "Jeremiah 49:17–38", "Hebrews 3:16–4:5"], ["watchD", "But where are your gods that you made for yourself? Let them come, if they can save you, in your time of trouble. Jeremiah 2:28 "], ["docT", "Jesus got up and rebuked the winds and the waves, and it was completely calm. Matthew 8:26 NIV "], ["prayer", "Lord, we are thankful that we can call on your precious name when we are lost and afraid. Remind us that you will be there to still the waves that toss us about. What peace! We thank you. Amen."]], "261": [["dateVerse", "Wednesday, September 18", "Psalm 107:23–32", "Jeremiah 50:1–40", "Hebrews 4:6–16"], ["watchD", "I delight in the way of your decrees as much as in all riches. Psalm 119:14"], ["docT", "Jesus said: “Therefore every scribe who has become a disciple of the kingdom of heaven is like a head of a household, who brings out of his treasure things new and old.” Matthew 13:52 NASB "], ["prayer", "Dear Lord, we delight in your word, your promises of love, grace, and forgiveness. These are the treasures you have given us. Earthly treasures fade away, but your love never does. It endures forever. Amen."]], "262": [["dateVerse", "Thursday, September 19", "Psalm 107:33–43", "Jeremiah 50:41–51:23", "Hebrews 5"], ["watchD", "The Lord went in front of them in a pillar of cloud by day, to lead them along the way, and in a pillar of fire by night, to give them light. Exodus 13:21 "], ["docT", "Therefore we must pay greater attention to what we have heard, so that we do not drift away from it. Hebrews 2:1   "], ["prayer", "Lord, you are a light for us to follow through the darkness. Help us to be diligent in keeping our eyes firmly fixed on you, so that we do not stray from the path you are setting out before us. Amen."]], "263": [["dateVerse", "Friday, September 20", "Psalm 108:1–5", "Jeremiah 51:24–64", "Hebrews 6:1–12"], ["watchD", "The meek shall obtain fresh joy in the Lord, and the neediest people shall exult in the Holy One of Israel. Isaiah 29:19  "], ["docT", "The Pharisees said to his disciples, “Why does your teacher eat with tax collectors and sinners?” Matthew 9:11 "], ["prayer", "Dear Lord Jesus, we are comforted and filled with joy and gratitude to know that you came to save all sinners, no matter what our station or situation in life might be. We need only call your name. Amen."]], "264": [["dateVerse", "Saturday, September 21", "Psalm 108:6–13", "Jeremiah 52", "Hebrews 6:13–7:3"], ["watchD", "God said to Jacob, “I am God, the God of your father; do not be afraid. I myself will go down with you to Egypt, and I will also bring you up again.” Genesis 46:3,4"], ["docT", "Therefore lift your drooping hands and strengthen your weak knees, and make straight paths for your feet. Hebrews 12:12-13 "], ["prayer", "O God, you have assured us that you are with us even when the way is rocky and unknown. Help us not to be afraid, but to lean on your strength and to say with Jacob, “Surely the Lord is in this place.” Amen."]], "265": [["info", "Fifteen Sunday after Pentecost "], ["watchO", "Watchword for the week — From the rising of the sun to its setting the name of the Lord is to be praised. Psalm 113:3 "], ["dateVerse", "Sunday, September 22", "Amos 8:4-7", "Psalm 113", "1 Timothy 2:1-7", "Luke 16:1-13"], ["watchD", "Lead me in your truth, and teach me. Psalm 25:5 "], ["docT", "You have one instructor, the Messiah. Matthew 23:10 "], ["prayer", "O Lord, we thank you for your promise to take us by your mighty right hand and lead us in the way we should go. You are our life coach; make us your willing students. Amen."]], "266": [["dateVerse", "Monday, September 23", "Psalm 109:1–7", "Lamentations 1:1–15", "Hebrews 7:4–17"], ["watchD", "The bows of the mighty are broken, but the feeble gird on strength. 1 Samuel 2:4 "], ["docT", "As servants of God we have commended ourselves in every way: through truthful speech, and the power of God; with the weapons of righteousness for the right hand and for the left. 2 Corinthians 6:4,7 "], ["prayer", "Lord, you have provided us with the only weapons that we need to navigate through this world—your truth and grace brought to us through Jesus. We have strength only through you and your son. Amen."]], "267": [["dateVerse", "Tuesday, September 24", "Psalm 109:8–20", "Lamentations 1:16–2:10", "Hebrews 7:18–28"], ["watchD", "I will give them a heart to know that I am the Lord. Jeremiah 24:7  "], ["docT", "It is God who establishes us with you in Christ and has anointed us, by putting his seal on us and giving us his Spirit in our hearts as a first installment. 2 Corinthians 1:21-22    "], ["prayer", "Dear God, you sent your son and the Holy Spirit to claim us as your own—sealed by your love, grace, and forgiveness. When you speak, help our hearts to respond and to fully embrace you as Lord. Amen."]], "268": [["dateVerse", "Wednesday, September 25", "Psalm 109:21–31", "Lamentations 2:11–3:15", "Hebrews 8"], ["watchD", "Justice, and only justice, you shall pursue, so that you may live. Deuteronomy 16:20"], ["docT", "Continue securely established and steadfast in the faith, without shifting from the hope promised by the gospel that you heard, which has been proclaimed to every creature under heaven. Colossians 1:23 "], ["prayer", "Lord, help us to hold steadfast and sure to our faith and hope in your promises of salvation for each of us. Draw us ever nearer to you, so that we may never waver from our promise to follow you. Amen."]], "269": [["dateVerse", "Thursday, September 26", "Psalm 110", "Lamentations 3:16–66", "Hebrews 9:1–10"], ["watchD", "In the fear of the Lord one has strong confidence. Proverbs 14:26 "], ["docT", "I know the one in whom I have put my trust, and I am sure that he is able to guard until that day what I have entrusted to him. 2 Timothy 1:12 "], ["prayer", "Lord, you are our rock and our salvation. Help us to remain faithful through all the ups and downs of our lives. When we put our trust fully in you, we are constantly amazed at the way you care for us. Thank you! Thank you! Amen."]], "270": [["dateVerse", "Friday, September 27", "Psalm 111", "Lamentations 4,5", "Hebrews 9:11–22"], ["watchD", "Moreover, it is God’s gift that all should eat and drink and take pleasure in all their toil. Ecclesiastes 3:13 "], ["docT", "Give us this day our daily bread. Matthew 6:11 "], ["prayer", "Lord, because you provide for us so abundantly, help us to live a life of joy and thanksgiving. May we, who are so blessed, be generous and loving to those around us. In your name we pray. Amen."]], "271": [["dateVerse", "Saturday, September 28", "Psalm 112", "Ezekiel 1,2", "Hebrews 9:23–10:4"], ["watchD", "Cast your burden on the Lord, and he will sustain you. Psalm 55:22 "], ["docT", "Therefore do not cast away your confidence, which has great reward. Hebrews 10:35 NKJV "], ["prayer", "Lord, when we feel as though we are sinking under the weight of our burdens, how comforting and freeing it is to know that all we have to do is bring them to you, and lay them at your feet. You will sustain us. Amen."]], "272": [["info", "Sixteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — There is great gain in godliness combined with contentment. 1 Timothy 6:6"], ["dateVerse", "Sunday, September 29", "Amos 6:1a,4-7", "Psalm 146", "1 Timothy 6:6-19", "Luke 16:19-31"], ["watchD", "A king is not saved by his great army; a warrior is not delivered by his great strength. Psalm 33:16  "], ["docT", "When Herod died, an angel of the Lord suddenly appeared in a dream to Joseph in Egypt and said, “Get up, take the child and his mother, and go to the land of Israel, for those who were seeking the child’s life are dead.” Matthew 2:19-20"], ["prayer", "Lord, we know that we are not saved by our own strength, but by holding fast to your love and leaning on your strength. What joy to know that, just as you delivered our savior from Herod, you will deliver us from our fears. Amen."]], "273": [["dateVerse", "Monday, September 30", "Psalm 113", "Ezekiel 3–4:5", "Hebrews 10:5–18"], ["watchD", "Put my tears in your bottle. Are they not in your record? Psalm 56:8"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation, who consoles us in all our affliction, so that we may be able to console those who are in any affliction. 2 Corinthians 1:3-4 "], ["prayer", "Lord God, when we are overcome with sorrow, when we can no longer walk alone, you dry our tears and walk with us. So, in the same way, help us, in your name, to walk with others who are in need of consolation. Amen."]], "274": [["dateVerse", "Tuesday, October 1", "Psalm 114", "Ezekiel 4:6–6:7", "Hebrews 10:19–31"], ["watchD", "In God I trust; I am not afraid. What can a mere mortal do to me? Psalm 56:11"], ["docT", "I can do all things through him who strengthens me. Philippians 4:13"], ["prayer", "God, so often in scripture you send that message of, “Fear not” to your people. Yet, so often we live according to our fears. You promise to give us strength enough to live according to our faith, our loves, and our hopes. May we so live. Amen."]], "275": [["dateVerse", "Wednesday, October 2", "Psalm 115:1–8", "Ezekiel 6:8–7:27", "Hebrews 10:32–11:3"], ["watchD", "When Job’s three friends heard of all these troubles that had come upon him, they sat with him on the ground for seven days and seven nights, and no one spoke a word to him, for they saw that his suffering was very great. Job 2:11,13"], ["docT", "Love bears all things. 1 Corinthians 13:7"], ["prayer", "God, whose love toward us is beyond our understanding, you carry our needs on your heart, even before we acknowledge them. Give to us, your children, loving hearts and hands to bear the needs of our sisters and brothers. Amen."]], "276": [["dateVerse", "Thursday, October 3", "Psalm 115:9–18", "Ezekiel 8,9", "Hebrews 11:4–16"], ["watchD", "The God of heaven will set up a kingdom that shall never be destroyed. Daniel 2:44"], ["docT", "For yours is the kingdom and the power and the glory forever. Amen. Matthew 6:13 NKJV"], ["prayer", "Eternal God, you are what was, what is, and what is to come. We thank you for the new Jerusalem—not only a picture of our future with you—but also a vision of what this world may be if we are in tune with you. Amen."]], "277": [["dateVerse", "Friday, October 4", "Psalm 116:1–7", "Ezekiel 10:1–11:15", "Hebrews 11:17–28"], ["watchD", "Lord, there is no one like you to help the powerless against the mighty. 2 Chronicles 14:11 NIV"], ["docT", "So, I will boast all the more gladly of my weaknesses, so that the power of Christ may dwell in me. 2 Corinthians 12:9"], ["prayer", "O strong One, you have chosen to come to us—limited, mortal creatures—as one of us. Sometimes we are weak and desperately need your help. Lord, may we also sense that when we are strong, it is because of you. In Jesus’ name we pray. Amen."]], "278": [["dateVerse", "Saturday, October 5", "Psalm 116:8–14", "Ezekiel 11:16–12:28", "Hebrews 11:29–40"], ["watchD", "God said, “My purpose shall stand, and I will fulfill my intention.” Isaiah 46:10"], ["docT", "So the last will be first, and the first will be last. Matthew 20:16"], ["prayer", "God, so different from us, yet in whose image we are made—open our hearts to live your purpose in your kingdom. Help us to become friends with our enemies, find homes for the abandoned, turn scarcity into abundance and spread unending joy. In Jesus’ name we pray. Amen."]], "279": [["info", "Seventeenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Commit your way to the Lord; trust in him, and he will act. Psalm 37:5"], ["dateVerse", "Sunday, October 6", "Habakkuk 1:1-4,2:1-4", "Psalm 37:1-9", "2 Timothy 1:1-14", "Luke 17:5-10"], ["watchD", "‘In this place I will give peace,’ says the Lord of hosts. Haggai 2:9 NKJV"], ["docT", "Keep on doing the things that you have learned and received and heard and seen in me, and the God of peace will be with you. Philippians 4:9"], ["prayer", "Giver of Peace, on this World Communion Sunday, slow us down so that we may be driven, not by our desire to succeed or to be rewarded, but by your will, so that we may be rested and ready for the world-transforming tasks you give us. Amen."]], "280": [["dateVerse", "Monday, October 7", "Psalm 116:15–19", "Ezekiel 13:1–14:11", "Hebrews 12:1–13"], ["watchD", "The Lord is my rock, my fortress, and my deliverer. 2 Samuel 22:2"], ["docT", "On him we have set our hope that he will continue to deliver us. 2 Corinthians 1:10 NIV"], ["prayer", "Lord, maybe our toughest job as people of faith is simply to remember that we belong to you and that we find our fullest life in joyfully, faithfully—and sometimes even recklessly—serving you. Amen."]], "281": [["dateVerse", "Tuesday, October 8", "Psalm 117", "Ezekiel 14:12–15:8", "Hebrews 12:14–24"], ["watchD", "I sought the Lord, and he answered me, and delivered me from all my fears. Psalm 34:4"], ["docT", "Jesus said, “Or what woman having ten silver coins, if she loses one of them, does not light a lamp, sweep the house, and search carefully until she finds it?” Luke 15:8"], ["prayer", "Father and Mother of us all, as earthly parents, how much we care for our children, who are precious in our sight! How much more do you care for us, and mourn when we lose our way! Give us the joy of being found. In Jesus’ name we pray. Amen."]], "282": [["dateVerse", "Wednesday, October 9", "Psalm 118:1–9", "Ezekiel 16:1–42", "Hebrews 12:25–13:6"], ["watchD", "Jacob said, “Come, let us go up to Bethel, that I may make an altar there to the God who answered me in the day of my distress and has been with me wherever I have gone.” Genesis 35:3"], ["docT", "Give thanks to God the Father at all times and for everything in the name of our Lord Jesus Christ. Ephesians 5:20"], ["prayer", "God of all places, make of us Bethels, houses of God, your sanctuaries, so that daily, even hourly, we may praise you and show that we are yours, wherever we are. Amen."]], "283": [["dateVerse", "Thursday, October 10", "Psalm 118:10–14", "Ezekiel 16:43–17:10", "Hebrews 13:7–19"], ["watchD", "I will heal their disloyalty; I will love them freely. Hosea 14:4"], ["docT", "Be merciful to those who doubt. Jude 22 NIV"], ["prayer", "Jesus, life is hard. The busy world around us pays little attention to you. It is easy for us to do the same—to ignore you, to doubt you, to forget you. Quiet us, that we may be attentive to your whisper and touch. Amen."]], "284": [["dateVerse", "Friday, October 11", "Psalm 118:15–21", "Ezekiel 17:11–18:18", "Hebrews 13:20–James 1:8"], ["watchD", "Alas for those who rely on horses, who trust in chariots because they are many, but do not consult the Lord! Isaiah 31:1"], ["docT", "Our competence is from God. 2 Corinthians 3:5"], ["prayer", "Invisible One, we don’t use chariots and horses, but we still want to trust in what we can see. So, you came in Jesus—the invisible made visible. May we find in him our strength—strength that we can trust. Amen."]], "285": [["dateVerse", "Saturday, October 12", "Psalm 118:22–29", "Ezekiel 18:19–19:14", "James 1:9–18"], ["watchD", "More majestic than the thunders of mighty waters, more majestic than the waves of the sea, majestic on high is the Lord! Psalm 93:4"], ["docT", "Jesus said to the disciples, “Where is your faith?” They were afraid and amazed, and said to one another, “Who then is this, that he commands even the winds and the water, and they obey him?” Luke 8:25"], ["prayer", "Majestic and amazing Lord, you are beyond our control; so much of life seems beyond our control. But you promise that human history moves toward your just and loving rule. Help us to be part of that movement. Amen."]], "286": [["info", "Eighteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — If we have died with him, we will also live with him. 2 Timothy 2:11  "], ["dateVerse", "Sunday, October 13", "2 Kings 5:1-3,7-15c", "Psalm 111", "2 Timothy 2:8-15", "Luke 17:11-19"], ["watchD", "God gives wisdom to the wise and knowledge to those who have understanding. Daniel 2:21"], ["docT", "The wisdom from above is first pure, then peaceable, gentle, willing to yield, full of mercy and good fruits, without a trace of partiality or hypocrisy. James 3:17"], ["prayer", "Source of all wisdom, help us to be wise, especially in our speaking and our listening. Open our hearts and minds so that our wisdom is peaceable, full of mercy, free of hypocrisy, and in harmony with your wisdom. Amen. "]], "287": [["dateVerse", "Monday, October 14", "Psalm 119:1–8", "Ezekiel 20:1–29", "James 1:19–27"], ["watchD", "I will save you from all your uncleannesses. Ezekiel 36:29"], ["docT", "There is therefore now no condemnation for those who are in Christ Jesus. Romans 8:1"], ["prayer", "Jesus, in many ways we have failed. But as you see us, we are not forever crippled or lost because of our past. Turn us from our past, whatever it holds. Show us how we can serve you and live well in the days ahead. Amen."]], "288": [["dateVerse", "Tuesday, October 15", "Psalm 119:9–16", "Ezekiel 20:30–21:17", "James 2:1–13"], ["watchD", "The Lord said, “I will give you as a light to the nations, that my salvation may reach to the end of the earth.” Isaiah 49:6"], ["docT", "God also highly exalted Christ Jesus and gave him the name that is above every name. Philippians 2:9"], ["prayer", "Risen Lord, as your people we may wonder how best to live with people who have not heard of you or who follow other traditions. But we have seen in you a way of life—of welcome, of caring, of forgiveness, of worship—that can bless all people. Amen."]], "289": [["dateVerse", "Wednesday, October 16", "Psalm 119:17–24", "Ezekiel 21:18–22:22", "James 2:14–26"], ["watchD", "Do not delay me, since the Lord has made my journey successful. Genesis 24:56"], ["docT", "Jesus saw a man called Matthew sitting at the tax booth; and he said to him, “Follow me.” And he got up and followed him. Matthew 9:9"], ["prayer", "Lord, you call us to follow you. Guide us so to understand success—and what in life really matters—that we can truly, with joy and faithfulness, follow you, even when we are not sure exactly where you may take us. Amen."]], "290": [["dateVerse", "Thursday, October 17", "Psalm 119:25–32", "Ezekiel 22:23–23:27", "James 3:1–12"], ["watchD", "When you make a sale to your neighbor or buy from your neighbor, you shall not cheat one another. Leviticus 25:14"], ["docT", "In everything do to others as you would have them do to you; for this is the law and the prophets. Matthew 7:12"], ["prayer", "Heavenly Neighbor, we think of you as so far away. Yet you came to us in Jesus as an earthly neighbor to tell us that we may meet you in all our neighbors. May we learn from Jesus how better to love our neighbors. Amen."]], "291": [["dateVerse", "Friday, October 18", "Psalm 119:33–40", "Ezekiel 23:28–24:8", "James 3:13–4:6"], ["watchD", "Whoever pursues righteousness and kindness will find life and honor. Proverbs 21:21"], ["docT", "The kingdom of God is not food and drink but righteousness and peace and joy in the Holy Spirit. Romans 14:17"], ["prayer", "Righteous God, righteousness sounds so hard and so religious. If we think of it as neighborliness, it feels a lot closer and more real—but not any easier. Make of us better neighbors to people near and far. Amen."]], "292": [["dateVerse", "Saturday, October 19", "Psalm 119:41–48", "Ezekiel 24:9–25:14", "James 4:7–17"], ["watchD", "Rise up, O Lord! Do not let mortals prevail. Psalm 9:19"], ["docT", "Jesus prayed, “I am not asking you to take them out of the world, but I ask you to protect them from the evil one.” John 17:15"], ["prayer", "Jesus, fellow traveler, life is not easy. Following you may not make it any easier, since you lead us to be more aware of our own sins and those of our culture. But you also promise to go with us, and to give us other fellow travelers. Amen."]], "293": [["info", "Nineteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Proclaim the message; be persistent whether the time is favorable or unfavorable; convince, rebuke, and encourage, with the utmost patience in teaching. 2 Timothy 4:2"], ["dateVerse", "Sunday, October 20", "Genesis 32:22-31", "Psalm 121", "2 Timothy 3:14-4:5", "Luke 18:1-8"], ["watchD", "I will make an everlasting covenant with them, never to draw back from doing good to them. Jeremiah 32:40"], ["docT", "So it depends not on human will or exertion, but on God who shows mercy. Romans 9:16"], ["prayer", "Great Chooser, you have chosen to create a universe and to create us. You also invite us to work with you, to care for and enjoy this universe and one another. Lead us to choose to work with you faithfully in your world. Amen."]], "294": [["dateVerse", "Monday, October 21", "Psalm 119:49–56", "Ezekiel 25:15–27:11", "James 5:1–12"], ["watchD", "Woe to the shepherds who only take care of themselves! Should not shepherds take care of the flock? Ezekiel 34:2 NIV"], ["docT", "Let each of you look not to your own interests, but to the interests of others. Philippians 2:4"], ["prayer", "Divine Leader, we thank you for good leaders in church and community. Where leaders are not doing their tasks well, may they grow or be replaced; and may our individual actions be shaped, not by our leaders, but by our faithful “yes” to your call. Amen."]], "295": [["dateVerse", "Tuesday, October 22", "Psalm 119:57–64", "Ezekiel 27:12–28:10", "James 5:13–20"], ["watchD", "Elijah said to all the people, “Come near to me.” So all the people came near to him. And he repaired the altar of the Lord which had been torn down. 1 Kings 18:30 NASB"], ["docT", "Let us then pursue what makes for peace and for mutual upbuilding. Romans 14:19"], ["prayer", "Great Builder, make of us, your church, what you want. Show us our failures and weaknesses. Help us to labor together—to help one another, to strive for peace among ourselves—so that we may better serve you. Amen."]], "296": [["dateVerse", "Wednesday, October 23", "Psalm 119:65–72", "Ezekiel 28:11–29:12", "1 Peter 1:1–12"], ["watchD", "Return to your God, hold fast to love and justice, and wait continually for your God. Hosea 12:6"], ["docT", "Therefore rid yourselves of all sordidness and rank growth of wickedness, and welcome with meekness the implanted word that has the power to save your souls. James 1:21"], ["prayer", "Patient and faithful One, we do not always do our best. We are sometimes lazy, sometimes afraid, sometimes selfish, sometimes too busy. Take us as we are and plant your word within us, so that we may grow into more faithful people. Amen."]], "297": [["dateVerse", "Thursday, October 24", "Psalm 119:73–80", "Ezekiel 29:13–30:26", "1 Peter 1:13–25"], ["watchD", "You let people ride over our heads; we went through fire and through water; yet you have brought us out to a spacious place. Psalm 66:12"], ["docT", "This is the victory that conquers the world, our faith. 1 John 5:4"], ["prayer", "O sure Foundation, other supports fail us and disappear. You alone are eternal and forever faithful… something so easy to say and so hard to believe in our hearts. Give us the faith to live by your example. In Jesus’ name we pray. Amen."]], "298": [["dateVerse", "Friday, October 25", "Psalm 119:81–88", "Ezekiel 31:1–32:16", "1 Peter 2:1–12"], ["watchD", "God does great things that we cannot comprehend. Job 37:5"], ["docT", "From him and through him and to him are all things. To him be the glory forever. Amen. Romans 11:36"], ["prayer", "O One beyond our comprehension, let us see enough and know enough to trust that you are good and life is good—when we let your river of grace flow through the desert of our world. Amen."]], "299": [["dateVerse", "Saturday, October 26", "Psalm 119:89–96", "Ezekiel 32:17–33:20", "1 Peter 2:13–25"], ["watchD", "You are a people holy to the Lord your God; it is you the Lord has chosen out of all the peoples on earth to be his people, his treasured possession. Deuteronomy 14:2"], ["docT", "God is one; and he will justify the circumcised on the ground of faith and the uncircumcised through that same faith. Romans 3:30"], ["prayer", "God, you are one; we are so many and so different. What a miracle! Amid and despite the divisions of the world, you have called us, your people, to show to all humanity that we are one family—your daughters and sons. May it be so. Amen."]], "300": [["info", "Twentieth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus says, “All who exalt themselves will be humbled, but all who humble themselves will be exalted.” Luke 18:14"], ["dateVerse", "Sunday, October 27", "Jeremiah 14:7-10,19-22", "Psalm 84:1-7", "2 Timothy 4:6-8,16-18", "Luke 18:9-14"], ["watchD", "The Lord makes poor and makes rich; he brings low, he also exalts. 1 Samuel 2:7"], ["docT", "We always carry around in our body the death of Jesus, so that the life of Jesus may also be revealed in our body. 2 Corinthians 4:10 NIV"], ["prayer", "Jesus, as your church, we are your body—together with people from every language and nation, rich and poor, educated and unable to read. May our life as your church lead people to say, “Yes! I want to know this Jesus.” Amen."]], "301": [["dateVerse", "Monday, October 28", "Psalm 119:97–104", "Ezekiel 33:21–34:19", "1 Peter 3:1–7"], ["watchD", "The people who know their God will display strength and take action. Daniel 11:32 NASB"], ["docT", "Jesus said, “Let your light shine before others, so that they may see your good works and give glory to your Father in heaven.” Matthew 5:16"], ["prayer", "Master Worker, we are your apprentices ready for the work you have entrusted to us: offering hope to cynics, submitting to your will, tearing down walls, welcoming the lonely. Keep teaching us. Work with us. In your holy name we pray. Amen."]], "302": [["dateVerse", "Tuesday, October 29", "Psalm 119:105–112", "Ezekiel 34:20–36:7", "1 Peter 3:8–22"], ["watchD", "Those who cling to worthless idols turn away from God’s love for them. Jonah 2:8 NIV"], ["docT", "No one can serve two masters; for a slave will either hate the one and love the other, or be devoted to the one and despise the other. You cannot serve God and wealth. Matthew 6:24"], ["prayer", "God, you have come to us in Jesus. You have chosen us. Amid all the choices that entice and often seduce us, may we more fully and firmly choose you. In your holy name we pray. Amen."]], "303": [["dateVerse", "Wednesday, October 30", "Psalm 119:113–120", "Ezekiel 36:8–36", "1 Peter 4"], ["watchD", "Remember the wonderful works he has done, his miracles, and the judgments he uttered. Psalm 105:5"], ["docT", "Taking the five loaves and the two fish, Jesus looked up to heaven, and blessed and broke the loaves, and gave them to the disciples, and the disciples gave them to the crowds. And all ate and were filled. Matthew 14:19-20"], ["prayer", "Divine Chef, we thank you for the simple pleasures of eating, and for all the ways you refresh and feed our spirits—through beauty, through silence, through friends, through ministries. Remind us that we and others need both kinds of bread. Amen."]], "304": [["dateVerse", "Thursday, October 31", "Psalm 119:121–128", "Ezekiel 37:1–38:6", "1 Peter 5"], ["watchD", "O give thanks to the Lord, call on his name, make known his deeds among the peoples. Psalm 105:1"], ["docT", "We have seen and do testify that the Father has sent his Son as the Savior of the world. 1 John 4:14"], ["prayer", "Eternal God, we give thanks for your deeds in all generations. Especially on this Halloween, the eve of All Saints’ Day, amid the secular celebrations, we remember with thanks those who have gone before us, and now rest with you. Amen."]], "305": [["info", "All Saints Day"], ["watchO", "Watchword for All Saints Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Friday, November 1", "Psalm 119:129–136", "Ezekiel 38:7–39:13", "2 Peter 1:1–11"], ["specialVerse", "All Saints Day", "Daniel 7:1-3,15-18", "Psalm 149", "Ephesians 1:11-23", "Luke 6:20-31"], ["watchD", "For your name’s sake, O Lord, pardon my guilt, for it is great. Psalm 25:11"], ["docT", "In Jesus Christ we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace. Ephesians 1:7"], ["prayer", "Lord God, thank you for all your saints, past and present, whom we have been blessed to know. Just as your love did shine through them, let your love now shine through us. In your son’s name. Amen."]], "306": [["dateVerse", "Saturday, November 2", "Psalm 119:137–144", "Ezekiel 39:14–40:16", "2 Peter 1:12–21"], ["watchD", "A gossip betrays a confidence, but a trustworthy person keeps a secret. Proverbs 11:13 NIV"], ["docT", "Guard what has been entrusted to you. Avoid the profane chatter. 1 Timothy 6:20"], ["prayer", "Dear Heavenly Father, help us to use our words to glorify you and avoid gossip. Let our words be a reflection of your love for us. Hear us as we pray and live the great commission. Amen."]], "307": [["info", "Twenty-First Sunday after Pentecost "], ["watchO", "Watchword for the week — Jesus says, “For the Son of Man came to seek and to save the lost.” Luke 19:10 "], ["dateVerse", "Sunday, November 3", "Isaiah 1:10-18", "Psalm 32:1-7", "2 Thessalonians 1:1-4,11-12", "Luke 19:1-10"], ["watchD", "O Lord, open my lips, and my mouth will declare your praise. Psalm 51:15"], ["docT", "With great power the apostles gave their testimony to the resurrection of the Lord Jesus, and great grace was upon them all. Acts 4:33"], ["prayer", "Lord Jesus, let us proclaim the good news of your resurrection wherever we go. Help us to be disciples of your grace in everything we do. We pray in your name. Amen."]], "308": [["dateVerse", "Monday, November 4", "Psalm 119:145–152", "Ezekiel 40:17–49", "2 Peter 2:1–10"], ["watchD", "The steadfast love of the Lord is from everlasting to everlasting on those who fear him, and his righteousness to children’s children, to those who keep his covenant. Psalm 103:17-18"], ["docT", "Only, live your life in a manner worthy of the gospel of Christ. Philippians 1:27"], ["prayer", "Christ, let us put on the armor of justice and peace as we strive to live our lives for you. Our covenant with you will last for generations. We pray in your everlasting name. Amen."]], "309": [["dateVerse", "Tuesday, November 5", "Psalm 119:153–160", "Ezekiel 41:1–42:9", "2 Peter 2:11–22"], ["watchD", "Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["docT", "Jesus said, “I have come as light into the world, so that everyone who believes in me should not remain in the darkness.” John 12:46"], ["prayer", "Lord, as we go through our day, we praise you for sending your dear son as the light into the world that was in darkness. Help us never to forget that he is light, even in our darkest times. Amen."]], "310": [["dateVerse", "Wednesday, November 6", "Psalm 119:161–168", "Ezekiel 42:10–43:21", "2 Peter 3:1–13"], ["watchD", "All the nations you have made shall come and bow down before you, O Lord, and shall glorify your name. Psalm 86:9"], ["docT", "This good news of the kingdom will be proclaimed throughout the world, as a testimony to all the nations; and then the end will come. Matthew 24:14"], ["prayer", "O Lord, as we await your return, we shout your praises in jubilant times and bow in silence in reverent times. Your name shall be glorified to all the nations! Amen."]], "311": [["dateVerse", "Thursday, November 7", "Psalm 119:169–176", "Ezekiel 43:22–44:27", "2 Peter 3:14–1 John 1:4"], ["watchD", "For we are aliens and transients before you, as were all our ancestors; our days on the earth are like a shadow, and there is no hope. 1 Chronicles 29:15"], ["docT", "Jesus said, “In my Father’s house there are many dwelling places.” John 14:2"], ["prayer", "Alpha and Omega, you are always with us. You have set a place for us on earth and in heaven. We praise you as we remember that one day we will be in our heavenly dwelling place with you. Amen."]], "312": [["dateVerse", "Friday, November 8", "Psalm 120", "Ezekiel 44:28–45:25", "1 John 1:5–2:11"], ["watchD", "The people of Israel said to Samuel, “Do not cease to cry out to the Lord our God for us, and pray that he may save us.” 1 Samuel 7:8"], ["docT", "Therefore confess your sins to one another, and pray for one another, so that you may be healed. James 5:16"], ["prayer", "Lord God, healer, just as the people of Israel asked Samuel to cry out for salvation, so shall we cry out prayers for one another. We are one family of faith, and feel each other’s pain and burden. Through you, we are healed. Amen."]], "313": [["dateVerse", "Saturday, November 9", "Psalm 121", "Ezekiel 46:1–47:12", "1 John 2:12–17"], ["watchD", "Who has directed the spirit of the Lord, or as his counselor has instructed him? Isaiah 40:13"], ["docT", "We ought not to think that the deity is like gold, or silver, or stone, an image formed by the art and imagination of mortals. Acts 17:29"], ["prayer", "Lord, you are more precious than gold or silver. Help us to look to you and not towards material things on this earth. Amen."]], "314": [["info", "Twenty-Second Sunday after Pentecost "], ["watchO", "Watchword for the week — For I know that my Redeemer lives, and that at the last he will stand upon the earth. Job 19:25"], ["dateVerse", "Sunday, November 10", "Job 19:23-27a", "Psalm 17:1-9", "2 Thessalonians 2:1-5,13-17", "Luke 20:27-38"], ["watchD", "Unless the Lord guards the city, the guard keeps watch in vain. Psalm 127:1"], ["docT", "So neither the one who plants nor the one who waters is anything, but only God who gives the growth. 1 Corinthians 3:7"], ["prayer", "God, all planting and watering we do in this world means nothing without you. You are the one who gives us growth. Help us remember this as we go through our daily routine. Amen."]], "315": [["dateVerse", "Monday, November 11", "Psalm 122", "Ezekiel 47:13–48:22", "1 John 2:18–29"], ["watchD", "If you will not listen to the voice of the Lord, then the hand of the Lord will be against you, as it was against your fathers. 1 Samuel 12:15 NASB"], ["docT", "I want you to be wise in what is good and guileless in what is evil. Romans 16:19"], ["prayer", "Savior, with you we know good and evil. Help us do what we know as good and avoid evil, for with you, good will prevail. In your name we pray. Amen."]], "316": [["dateVerse", "Tuesday, November 12", "Psalm 123", "Ezekiel 48:23–Daniel 1:21", "1 John 3:1–10"], ["watchD", "I myself will search for my sheep and look after them. Ezekiel 34:11 NIV"], ["docT", "When Jesus saw the crowds, he had compassion for them, because they were harassed and helpless, like sheep without a shepherd. Matthew 9:36"], ["prayer", "Great Shepherd, we were lost, but you found us. You know us by name and care for us. When we feel harassed and helpless, help us remember you are there to guide us. Amen."]], "317": [["info", "Chief Elder Festival"], ["dateVerse", "Wednesday, November 13", "Psalm 124", "Daniel 2:1–33", "1 John 3:11–24"], ["specialVerse", "The Chief Elder Festival†", "Ezekiel 34:11-16,23-24", "Psalm 8", "Hebrews 4:14-16", "John 10:1-10"], ["watchD", "His greatness will reach to the ends of the earth. Micah 5:4 NIV"], ["docT", "For in Jesus Christ the whole fullness of deity dwells bodily, and you have come to fullness in him, who is the head of every ruler and authority. Colossians 2:9-10"], ["prayer", "Jesus Christ our Chief Elder, head of the church, and head of our faith, we look to you for strength and leadership in our hearts and in your church. Help us to remember that you are head of every ruler and authority. Amen."], ["info", "†On this day, in 1741, it was announced in all Moravian congregations that Jesus Christ had been chosen Chief Elder of the Moravian Church. The Moravian Church has had no single human chief executive since then, and now observes this as a festival day."]], "318": [["dateVerse", "Thursday, November 14", "Psalm 125", "Daniel 2:34–3:18", "1 John 4:1–16a"], ["watchD", "Lord, save us! Lord, grant us success! Psalm 118:25 NIV"], ["docT", "It is God who is at work in you, enabling you both to will and to work for his good pleasure. Philippians 2:13"], ["prayer", "God, through you all work is done! Let our deeds grant us success in magnifying your name. Amen."]], "319": [["dateVerse", "Friday, November 15", "Psalm 126", "Daniel 3:19–4:18", "1 John 4:16b–5:5"], ["watchD", "When words are many, transgression is not lacking, but the prudent are restrained in speech. Proverbs 10:19"], ["docT", "With the tongue we bless the Lord and Father, and with it we curse those who are made in the likeness of God. From the same mouth come blessing and cursing. My brothers and sisters, this ought not to be so. James 3:9-10"], ["prayer", "Father God, from our mouths should come blessings in your name. Please help us refrain from cursing, and be an example of your love and blessings. Amen."]], "320": [["dateVerse", "Saturday, November 16", "Psalm 127", "Daniel 4:19–5:16", "1 John 5:6–21"], ["watchD", "The Lord will judge the ends of the earth; he will give strength to his king. 1 Samuel 2:10"], ["docT", "When the Son of Man comes in his glory, and all the angels with him, then he will sit on the throne of his glory. All the nations will be gathered before him. Matthew 25:31-32"], ["prayer", "Son of Man, we await your return. Give us strength to be good stewards of all your nations until you come again. Amen."]], "321": [["info", "Twenty-Third Sunday after Pentecost"], ["watchO", "Watchword for the week — Brothers and sisters, do not be weary in doing what is right. 2 Thessalonians 3:13"], ["dateVerse", "Sunday, November 17", "Malachi 4:1-2a", "Psalm 98", "2 Thessalonians 3:6-13", "Luke 21:5-19"], ["watchD", "The Israelites cried to the Lord, saying, “We have sinned against you, because we have abandoned our God.” Judges 10:10"], ["docT", "He has rescued us from the power of darkness and transferred us into the kingdom of his beloved Son, in whom we have redemption, the forgiveness of sins. Colossians 1:13-14"], ["prayer", "Father, you have rescued us from sin through your son. Help us keep our eyes on you and refrain from sin. Help us to ask for forgiveness that only comes through Jesus Christ. In the name of your son. Amen."]], "322": [["dateVerse", "Monday, November 18", "Psalm 128", "Daniel 5:17–6:18", "2 John"], ["watchD", "You hem me in, behind and before, and lay your hand upon me. Psalm 139:5"], ["docT", "Who will separate us from the love of Christ? Will hardship, or distress, or persecution, or famine, or nakedness, or peril, or sword? Romans 8:35"], ["prayer", "Christ, many toils of life try to separate us from you. Help us to grow strong from hardship and look towards you for comfort. Amen."]], "323": [["dateVerse", "Tuesday, November 19", "Psalm 129", "Daniel 6:19–7:22", "3 John"], ["watchD", "They will fight against you; but they shall not prevail against you, for I am with you, says the Lord, to deliver you. Jeremiah 1:19"], ["docT", "For the kingdom of God depends not on talk but on power. 1 Corinthians 4:20"], ["prayer", "Lord, you have all the power and might. May we always remember that you are stronger than our foe. We shall look to you for strength. Amen."]], "324": [["dateVerse", "Wednesday, November 20", "Psalm 130", "Daniel 7:23–8:27", "Jude 1:1–10"], ["watchD", "My lips will shout for joy when I sing praises to you; my soul also, which you have rescued. Psalm 71:23"], ["docT", "Sing psalms and hymns and spiritual songs among yourselves. Ephesians 5:19"], ["prayer", "Redeemer, we shout for joy and sing your praises. We make joyful noises in your name. Let our hymns, our voices, and our instruments ever glorify you! Amen."]], "325": [["dateVerse", "Thursday, November 21", "Psalm 131", "Daniel 9:1–10:7", "Jude 1:11–25"], ["watchD", "See, I am the Lord, the God of all flesh; is anything too hard for me? Jeremiah 32:27"], ["docT", "Now to God who is able to strengthen you according to my gospel and the proclamation of Jesus Christ, to the only wise God, through Jesus Christ, be the glory forever! Romans 16:25,27"], ["prayer", "Wise God, you are our strength—nothing is too hard for you. Let us take all to you and proclaim all glory to you through your son, Jesus Christ. Amen."]], "326": [["dateVerse", "Friday, November 22", "Psalm 132", "Daniel 10:8–11:19", "Revelation 1:1–8"], ["watchD", "Even the sparrow finds a home, and the swallow a nest for herself, where she may lay her young, at your altars, O Lord of hosts, my King and my God. Psalm 84:3"], ["docT", "Jesus says, “Where two or three are gathered in my name, I am there among them.” Matthew 18:20"], ["prayer", "Lord of hosts, our king and our God, we come before you to find our home in you. We gather together in small numbers and large groups, and you are there among us proclaiming your name and doing great works. Amen."]], "327": [["dateVerse", "Saturday, November 23", "Psalm 133", "Daniel 11:20–12:7", "Revelation 1:9–20"], ["watchD", "The Lord is my shepherd, I shall not want. Psalm 23:1"], ["docT", "As servants of God we have commended ourselves in every way: as sorrowful, yet always rejoicing; as poor, yet making many rich; as having nothing, and yet possessing everything. 2 Corinthians 6:4,10"], ["prayer", "My Shepherd, there are times of feast and times of famine in our lives. Help us to always count our blessings—no matter the famine. You are always with us and this makes us richer than any gold or silver ever could. Amen."]], "328": [["info", "Reign of Christ Sunday "], ["watchO", "Watchword for the week — Be still, and know that I am God! I am exalted among the nations, I am exalted in the earth. Psalm 46:10"], ["dateVerse", "Sunday, November 24", "Jeremiah 23:1-6", "Psalm 46", "Colossians 1:11-20", "Luke 23:33-43"], ["watchD", "Light dawns for the righteous, and joy for the upright in heart. Psalm 97:11"], ["docT", "Blessed are those who mourn, for they will be comforted. Matthew 5:4"], ["prayer", "Christ, you are the great king! Even as we mourn, we take comfort in your everlasting promise to join you in your kingdom. Help us to be still and know that you are God! Amen."]], "329": [["dateVerse", "Monday, November 25", "Psalm 134", "Daniel 12:8–Hosea 2:15", "Revelation 2:1–11"], ["watchD", "God said to Abraham, “As for you, you shall keep my covenant, you and your offspring after you throughout their generations.” Genesis 17:9"], ["docT", "God has made us competent to be ministers of a new covenant. 2 Corinthians 3:6"], ["prayer", "God, for generations from Abraham to us, you have kept your covenant. Help us remember that we are ministers of a new covenant with you! Amen."]], "330": [["dateVerse", "Tuesday, November 26", "Psalm 135:1–12", "Hosea 2:16–4:19", "Revelation 2:12–23"], ["watchD", "You show me the path of life. Psalm 16:11"], ["docT", "But this one thing I do: forgetting what lies behind and straining forward to what lies ahead. Philippians 3:13"], ["prayer", "Light of the world, you light up our path of life. Help us to focus on the path ahead of us and not on what has passed. Amen."]], "331": [["dateVerse", "Wednesday, November 27", "Psalm 135:13–21", "Hosea 5,6,7", "Revelation 2:24–3:6"], ["watchD", "You shall be holy, for I the Lord your God am holy. Leviticus 19:2"], ["docT", "In fulfillment of his own purpose he gave us birth by the word of truth, so that we would become a kind of first fruits of his creatures. James 1:18"], ["prayer", "Lord, you are holy! We are born from the word of your truth, and the first fruits of your creatures. Let us take time to be still and know that you are holy. Amen."]], "332": [["dateVerse", "Thursday, November 28", "Psalm 136", "Hosea 8,9", "Revelation 3:7–18"], ["watchD", "Turn, O Lord, save my life; deliver me for the sake of your steadfast love. Psalm 6:4"], ["docT", "If you then, who are evil, know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask him! Matthew 7:11"], ["prayer", "Father, your steadfast love saves us! Your gifts abound! Help us to come to you with our true needs. We pray in the name of Jesus. Amen."]], "333": [["dateVerse", "Friday, November 29", "Psalm 137", "Hosea 10,11,12", "Revelation 3:19–4:8"], ["watchD", "As a father has compassion for his children, so the Lord has compassion for those who fear him. Psalm 103:13"], ["docT", "Jesus says, “I tell you, many will come from east and west and will eat with Abraham and Isaac and Jacob in the kingdom of heaven.” Matthew 8:11"], ["prayer", "Lord, we rejoice in the compassion you have for your children. We revel in the day your people come from the east and west to dine in the kingdom of heaven with Abraham, Isaac, and Jacob. Amen."]], "334": [["dateVerse", "Saturday, November 30", "Psalm 138:1–5", "Hosea 13,14", "Revelation 4:9–5:10"], ["watchD", "You will know that I am the Lord; those who wait for me shall not be put to shame. Isaiah 49:23"], ["docT", "Rejoice in hope, be patient in suffering, persevere in prayer. Romans 12:12"], ["prayer", "Lord of Hope, you are always with us through all times. Help us be patient when we suffer, persevere in prayer, and never forget to rejoice in hope! Amen."]], "335": [["info", "First Sunday of Advent "], ["watchO", "Watchword for the week — Come, let us walk in the light of the Lord! Isaiah 2:5"], ["dateVerse", "Sunday, December 1", "Isaiah 2:1-5", "Psalm 122", "Romans 13:11-14", "Matthew 24:36-44"], ["watchD", "Lord, who would not fear you, O King of the nations? For that is your due. Jeremiah 10:7"], ["docT", "May the God of peace make you complete in everything good so that you may do his will, working among us that which is pleasing in his sight, through Jesus Christ. Hebrews 13:20,21"], ["prayer", "King of peace, we praise you in wonder and gratitude. Continue your work of grace and power in all our nations, for your glory, according to your will. Amen."]], "336": [["dateVerse", "Monday, December 2", "Psalm 138:6–8", "Joel 1:1–2:14", "Revelation 5:11–6:8"], ["watchD", "Do not fear or be dismayed! Joshua 8:1"], ["docT", "There is no fear in love, but perfect love casts out fear. 1 John 4:18"], ["prayer", "Gracious God, we thank you for the church—not the buildings or structures, but the people and relationships that foster love and courage through your Spirit’s leading. Amen."]], "337": [["dateVerse", "Tuesday, December 3", "Psalm 139:1–6", "Joel 2:15–3:21", "Revelation 6:9–7:8"], ["watchD", "Help us, O Lord our God, for we rely on you. 2 Chronicles 14:11"], ["docT", "Everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. Matthew 7:8"], ["prayer", "Ever-present God, we thank you that you dwell within us, and are always with us. Teach us and help us to rely on you each day, in matters both great and small. Amen."]], "338": [["dateVerse", "Wednesday, December 4", "Psalm 139:7–12", "Amos 1,2", "Revelation 7:9–17"], ["watchD", "The Lord said, “I will defend this city to save it, for my own sake.” 2 Kings 19:34"], ["docT", "Meanwhile the church throughout Judea, Galilee, and Samaria had peace and was built up. Living in the fear of the Lord and in the comfort of the Holy Spirit, it increased in numbers. Acts 9:31"], ["prayer", "We praise and thank you, almighty God, for your providential protection that brings us peace. Help us to proclaim this good news and to turn to you each day, trusting in your mighty hand to save. Amen."]], "339": [["dateVerse", "Thursday, December 5", "Psalm 139:13–16", "Amos 3,4", "Revelation 8"], ["watchD", "Now there was a great wind, so strong that it was splitting mountains and breaking rocks in pieces before the Lord, but the Lord was not in the wind; and after the wind an earthquake, but the Lord was not in the earthquake; and after the earthquake a fire, but the Lord was not in the fire; and after the fire a sound of sheer silence. 1 Kings 19:11-12"], ["docT", "God is spirit, and those who worship him must worship in spirit and truth. John 4:24"], ["prayer", "God of truth, we thank you, that in the midst of our world’s chaos, you come to us day after day in unique and special ways. Grant us eyes and ears that see and hear you moving in our lives. Amen."]], "340": [["dateVerse", "Friday, December 6", "Psalm 139:17–24", "Amos 5", "Revelation 9:1–11"], ["watchD", "Blessed be the Lord, who daily loads us with benefits, the God of our salvation! Psalm 68:19 NKJV"], ["docT", "We know that all things work together for good for those who love God. Romans 8:28"], ["prayer", "Loving Lord, your grace is poured out to us every morning. Forgive us when we focus so much on the difficulties of life that we miss your merciful goodness. Amen."]], "341": [["dateVerse", "Saturday, December 7", "Psalm 140:1–5", "Amos 6,7", "Revelation 9:12–21"], ["watchD", "O send out your light and your truth; let them lead me to your dwelling. Psalm 43:3"], ["docT", "This is the message we have heard from him and proclaim to you, that God is light and in him there is no darkness at all. 1 John 1:5"], ["prayer", "O God, the living truth, we find our dwelling place in your light. Empower us to proclaim to all the world that you are at the end of all questions and searching. In Jesus’ name we pray. Amen."]], "342": [["info", "Second Sunday of Advent "], ["watchO", "Watchword for the week — Repent, for the kingdom of heaven has come near. Matthew 3:2"], ["dateVerse", "Sunday, December 8", "Isaiah 11:1-10", "Psalm 72", "Romans 15:4-13", "Matthew 3:1-12"], ["watchD", "You shall be like a watered garden, like a spring of water, whose waters never fail. Isaiah 58:11"], ["docT", "Jesus said in a loud voice, “Whoever believes in me, as Scripture has said, rivers of living water will flow from within them.” John 7:38 NIV"], ["prayer", "Water of Life, you lead us to a place of nourishment and care. When life’s thirst leads us elsewhere, and we seek relief in shallow wells, draw us back to your deep and abiding rest. Amen. "]], "343": [["dateVerse", "Monday, December 9", "Psalm 140:6–13", "Amos 8,9", "Revelation 10"], ["watchD", "You must not be partial in judging: hear out the small and the great alike; you shall not be intimidated by anyone, for the judgment is God’s. Deuteronomy 1:17"], ["docT", "With the judgment you make you will be judged, and the measure you give will be the measure you get. Matthew 7:2"], ["prayer", "Righteous Judge, we confess our inclination to often jump to conclusions. If your attitude to the world is love—you who know all—then help us to be more loving in our opinions. Amen."]], "344": [["dateVerse", "Tuesday, December 10", "Psalm 141:1–4", "Obadiah 1", "Jonah 1,2", "Revelation 11:1–14"], ["watchD", "The Lord said to Moses, “All the people among whom you live shall see the work of the Lord.” Exodus 34:10"], ["docT", "Jesus went throughout Galilee, teaching in their synagogues and proclaiming the good news of the kingdom and curing every disease and every sickness among the people. Matthew 4:23"], ["prayer", "All-present Creator, we praise you for making yourself known to us in many wondrous ways. We thank you that in your grace, you welcome us into your kingdom. Amen."]], "345": [["dateVerse", "Wednesday, December 11", "Psalm 141:5–10", "Jonah 3,4", "Revelation 11:15–12:6"], ["watchD", "Noah found favor in the sight of the Lord. Genesis 6:8"], ["docT", "Just as you received Christ Jesus as Lord, continue to live your lives in him, rooted and built up in him, strengthened in the faith. Colossians 2:6-7 NIV"], ["prayer", "Eternal God, we give thanks that we may count ourselves as part of the heritage of faith. We praise you for your favor bestowed on generations that came before, as well as on those that will come after. Amen."]], "346": [["dateVerse", "Thursday, December 12", "Psalm 142", "Micah 1– 3:7", "Revelation 12:7–18"], ["watchD", "Guard your steps as you go to the house of God and draw near to listen. Ecclesiastes 5:1 NASB"], ["docT", "When you are praying, do not heap up empty phrases as the Gentiles do; for they think that they will be heard because of their many words. Matthew 6:7"], ["prayer", "O God of our worship, we thank you for places in our lives that provide us opportunities to prayerfully center ourselves on you. May we utilize these sacred spaces in order to be led more truly by you. Amen."]], "347": [["dateVerse", "Friday, December 13", "Psalm 143:1–6", "Micah 3:8–5:15", "Revelation 12:19–13:10"], ["watchD", "The Lord will not forsake his people; he will not abandon his heritage. Psalm 94:14"], ["docT", "Our citizenship is in heaven, and it is from there that we are expecting a Savior, the Lord Jesus Christ. Philippians 3:20"], ["prayer", "God of all, we thank you that our identity is in you. We rejoice that we are part of your family, and we marvel that your wide embrace encompasses us all. Amen."]], "348": [["dateVerse", "Saturday, December 14", "Psalm 143:7–12", "Micah 6,7", "Revelation 13:11–14:5"], ["watchD", "You, Lord, brought me up from the realm of the dead; you spared me from going down to the pit. Psalm 30:3 NIV"], ["docT", "The free gift of God is eternal life in Christ Jesus our Lord. Romans 6:2"], ["prayer", "Merciful God, we thank you for the hope and future that is ours in Christ. Gracious God, we thank you for the life and freedom that is ours in Christ. Amen."]], "349": [["info", "Third Sunday of Advent "], ["watchO", "Watchword for the week — Be strong, do not fear! Here is your God. Isaiah 35:4"], ["dateVerse", "Sunday, December 15", "Isaiah 35:1-10", "Psalm 146:5-10", "James 5:7-10", "Matthew 11:2-11"], ["watchD", "When deeds of iniquity overwhelm us, you forgive our transgressions. Psalm 65:3"], ["docT", "Zechariah said, “And you, child, will be called the prophet of the Most High; for you will go before the Lord to prepare his ways, to give knowledge of salvation to his people by the forgiveness of their sins. By the tender mercy of our God, the dawn from on high will break upon us.” Luke 1:76-78"], ["prayer", "When we believe that all is lost, O Lord, you reach out to us in love. We rejoice in the surprising good news that all is not lost. Your forgiveness is new every morning. Amen."]], "350": [["dateVerse", "Monday, December 16", "Psalm 144:1–4", "Nahum 1,2", "Revelation 14:6–16"], ["watchD", "Can a woman forget her nursing-child, or show no compassion for the child of her womb? Even these may forget, yet I will not forget you. Isaiah 49:15"], ["docT", "I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord. Romans 8:38-39"], ["prayer", "Heavenly Nurturer, your loving regard for us is so great that nothing will keep us from you. We humbly thank you for the fierce and protective love you have for us. Amen."]], "351": [["dateVerse", "Tuesday, December 17", "Psalm 144:5–8", "Nahum 3", "Habakkuk 1", "Revelation 14:17–15:8"], ["watchD", "I will betroth you to me forever; yes, I will betroth you to me in righteousness and in justice, in loving kindness and in compassion. Hosea 2:19 NASB"], ["docT", "For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["prayer", "As a lover cherishes their beloved, so you cherish us, O God. We give you praise that in Christ we are made worthy of your extravagant and eternal love. Amen."]], "352": [["dateVerse", "Wednesday, December 18", "Psalm 144:9–15", "Habakkuk 2,3", "Revelation 16:1–11"], ["watchD", "I will counsel you with my eye upon you. Psalm 32:8"], ["docT", "The angel said to her, “Do not be afraid, Mary, for you have found favor with God.” Luke 1:30"], ["prayer", "O God, you are a benevolent and wise God. Your favor is shown in your regard for the lowest, the least, and the lost. You include all your children in your gracious work. Amen."]], "353": [["dateVerse", "Thursday, December 19", "Psalm 145:1–7", "Zephaniah 1,2", "Revelation 16:12–21"], ["watchD", "I lift up my eyes to the hills—from where will my help come? My help comes from the Lord, who made heaven and earth. Psalm 121:1-2"], ["docT", "You also must be patient. Strengthen your hearts, for the coming of the Lord is near. James 5:8"], ["prayer", "Rock of Ages, you are consistent, constant, and sure. You will not rush your plans, nor will you abandon them. Help us to trust in your providence and your strength. Amen."]], "354": [["dateVerse", "Friday, December 20", "Psalm 145:8–16", "Zephaniah 3", "Haggai 1", "Revelation 17:1–8"], ["watchD", "Is my hand shortened, that it cannot redeem? Or have I no power to deliver? Isaiah 50:2"], ["docT", "I pray that the eyes of your heart may be enlightened in order that you may know the hope to which he has called you, the riches of his glorious inheritance in his holy people, and his incomparably great power for us. Ephesians 1:18-19 NIV"], ["prayer", "Forgive us when we allow worry or fear to lead us to hurtful or divisive actions. May we return to you, O God, and be reminded once again that your power is all we need. Amen."]], "355": [["dateVerse", "Saturday, December 21", "Psalm 145:17–21", "Haggai 2", "Zechariah 1-3", "Revelation 17:9–18"], ["watchD", "Do not be far from me, for trouble is near and there is no one to help. Psalm 22:11"], ["docT", "The sisters sent a message to Jesus, “Lord, he whom you love is ill.” John 11:3"], ["prayer", "Compassionate Lord, you know the paths we walk. You know the pain we face. Even in the midst of deepest darkness, you are there with us to lead us home. Amen."]], "356": [["info", "Fourth Sunday of Advent "], ["watchO", "Watchword for the week — Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["dateVerse", "Sunday, December 22", "Isaiah 7:10-16", "Psalm 80:1-7,10-14", "Romans 1:1-7", "Matthew 1:18-25"], ["watchD", "Give liberally and be ungrudging when you do so, for on this account the Lord your God will bless you in all your work and in all that you undertake. Deuteronomy 15:10 "], ["docT", "Let your gentleness be known to everyone. The Lord is near. Philippians 4:5"], ["prayer", "God of grace and beauty, may we look to your example in Christ that we may learn how to be generous and gentle with everyone. Amen."]], "357": [["dateVerse", "Monday, December 23", "Psalm 146", "Zechariah 4,5", "Revelation 18:1–10"], ["watchD", "I will cleanse them from all the guilt of their sin against me, and I will forgive. Jeremiah 33:8"], ["docT", "The angel said to Joseph, “She will bear a son, and you are to name him Jesus, for he will save his people from their sins.” Matthew 1:21"], ["prayer", "Loving God, you entered into human history to show us your love, to be with us, and to wash us clean. We are made new through Jesus, and we rejoice. Amen."]], "358": [["dateVerse", "Tuesday, December 24", "Psalm 147:1–6", "Zechariah 6,7", "Revelation 18:11–24"], ["watchD", "Lift up your heads, O gates! And be lifted up, O ancient doors! That the King of glory may come in. Psalm 24:7"], ["docT", "Behold the Man! John 19:5 NKJV"], ["prayer", "Heavenly Father, all creation awaits with hopeful expectation for your promise to be fulfilled. King of glory, our hearts are ready to welcome you anew. Amen."]], "359": [["info", "Nativity of the Lord (Christmas) "], ["watchO", "Watchword for Christmas Day — The law was given through Moses; grace and truth came through Jesus Christ. John 1:17"], ["specialVerse", "Nativity of the Lord", "Isaiah 52:7-10", "Psalm 98", "Hebrews 1:1-4,(5-12)", "John 1:1-14"], ["dateVerse", "Wednesday, December 25", "Psalm 147:7–14", "Zechariah 8,9", "Revelation 19:1-8"], ["watchD", "My people have committed two evils: they have forsaken me, the fountain of living water, and dug out cisterns for themselves, cracked cisterns that can hold no water. Jeremiah 2:13"], ["docT", "In this is love, not that we loved God but that he loved us and sent his Son to be the atoning sacrifice for our sins. 1 John 4:10"], ["prayer", "God, our arid and empty lives are refreshed and given purpose this day. We rejoice that we have been given new life and have been shown what love is. Amen."]], "360": [["dateVerse", "Thursday, December 26", "Psalm 147:15–20", "Zechariah 10,11", "Revelation 19:9-21"], ["watchD", "Hear, O kings; give ear, O princes; to the Lord I will sing, I will make melody to the Lord, the God of Israel. Judges 5:3"], ["docT", "When the shepherds saw this, they made known what had been told them about this child; and all who heard it were amazed at what the shepherds told them. Luke 2:17-18"], ["prayer", "God of song, you call us to share of your word and your works in all the world. Help us claim our voice and proclaim your grace. Amen."]], "361": [["dateVerse", "Friday, December 27", "Psalm 148:1–6", "Zechariah 12-13:6", "Revelation 20-21:8"], ["watchD", "O that today you would listen to his voice! Do not harden your hearts. Psalm 95:7-8"], ["docT", "Be filled with the Spirit. Ephesians 5:18"], ["prayer", "Life-giving Lord, you graciously come to us day after day. May we be open to what you would teach, and who you would have us serve. Amen."]], "362": [["dateVerse", "Saturday, December 28", "Psalm 148:7–14", "Zechariah 13:7-14:21", "Revelation 21:9-21"], ["watchD", "They shall know that I am the Lord, when I break the bars of their yoke and save them. Ezekiel 34:27"], ["docT", "Where the Spirit of the Lord is, there is freedom. 2 Corinthians 3:17"], ["prayer", "We see our chains, O Lord; we see our bondage. We are prisoners of our own making. But you have burst the bonds of sin and death and have set us free. Alleluia! Amen."]], "363": [["info", "First Sunday after Christmas Day "], ["watchO", "Watchword for the week — I will recount the gracious deeds of the Lord, the praiseworthy acts of the Lord, because of all that the Lord has done for us. Isaiah 63:7"], ["dateVerse", "Sunday, December 29", "Isaiah 63:7-9", "Psalm 148", "Hebrews 2:10-18", "Matthew 2:13-23"], ["watchD", "Even youths will faint and be weary, and the young will fall exhausted; but those who wait for the Lord shall renew their strength, they shall mount up with wings like eagles, they shall run and not be weary. Isaiah 40:30-31"], ["docT", "God did not give us a spirit of cowardice, but rather a spirit of power and of love and of self-discipline. 2 Timothy 1:7"], ["prayer", "When we are open to your spirit, O God, we find reservoirs of strength and power to love and to serve. Help us to not rely on our own devices, but to wait and trust in you. Amen."]], "364": [["dateVerse", "Monday, December 30", "Psalm 149", "Malachi 1,2", "Revelation 21:22-22:7"], ["watchD", "This assembly may know that the Lord does not save by sword and spear. 1 Samuel 17:47"], ["docT", "A harvest of righteousness is sown in peace for those who make peace. James 3:18"], ["prayer", "God of peace, teach us your ways. Our ways lead to conflict and mistrust. Guide us to see the path forward that brings your kingdom on earth. Amen."]], "365": [["dateVerse", "Tuesday, December 31", "Psalm 150", "Malachi 3, 4", "Revelation 22:8-21"], ["watchD", "Keep far from a false charge. Exodus 23:7"], ["docT", "Whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is pleasing, whatever is commendable, if there is any excellence and if there is anything worthy of praise, think about these things. Philippians 4:8"], ["prayer", "God of truth, help us to move away from the things of this world and towards the godly virtues that embody a follower of your way. Amen."]]}