{"1": [["dateVerse", "Saturday, January 1", "Psalm 1", "Genesis 1:1–2:3", "Matthew 1:1–17"], ["watchD", "If anyone secretly entices you—even if it is your brother, your father’s son or your mother’s son, or your own son or daughter, or the wife you embrace, or your most intimate friend— saying, “Let us go worship other gods,” you must not yield to or heed any such persons. Deuteronomy 13:6,8"], ["docT", "Jesus said, “Whoever does the will of God is my brother and sister and mother.” Mark 3:35"], ["prayer", "Faithful God, we greet this new year with hopefulness. Keep us steadfast upon your will, regardless of what may come our way, for you are our guide and our certainty—our truth and our love. Amen."]], "2": [["info", "Second Sunday after Christmas Day"], ["watchO", "Watchword for the week — God has made known to us the mystery of his will, according to his good pleasure that he set forth in Christ. Ephesians 1:9"], ["dateVerse", "Sunday, January 2", "Jeremiah 31:7-14", "Psalm 147:12-20", "Ephesians 1:3-14", "John 1:(1-9),10-18"], ["watchD", "See now that I, even I, am he; there is no god beside me. I kill and I make alive; I wound and I heal; and no one can deliver from my hand. Deuteronomy 32:39"], ["docT", "If we live, we live to the Lord, and if we die, we die to the Lord; so then, whether we live or whether we die, we are the Lord’s. Romans 14:8"], ["prayer", "What have we to fear? Our lives are tethered to your heart, O Christ, our friend and redeemer. May we remain in the knowledge of your presence and your grace, so that all our living may be for you. Amen."]], "3": [["dateVerse", "Monday, January 3", "Psalm 2", "Genesis 2:4–25", "Matthew 1:18–25"], ["watchD", "You, O Lord, are in the midst of us, and we are called by your name; do not forsake us! Jeremiah 14:9"], ["docT", "With the eyes of your heart enlightened, you may know what is the hope to which he has called you. Ephesians 1:18"], ["prayer", "Ever-present God, you have come into our midst through the precious gift of your Son, Jesus Christ. He is our hope and certainty in this world. May Christ dispel our fear and bring us light forevermore. Amen."]], "4": [["dateVerse", "Tuesday, January 4", "Psalm 3", "Genesis 3,4", "Matthew 2:1–12"], ["watchD", "Be merciful to me, O God, be merciful to me, for in you my soul takes refuge. Psalm 57:1"], ["docT", "From his fullness we have all received, grace upon grace. John 1:16"], ["prayer", "Gracious God, we thank you for life. We may feel alone, frightened or lost at times, but we know of your presence. Your grace and mercy follow us all the days of our lives. Amen."]], "5": [["dateVerse", "Wednesday, January 5", "Psalm 4", "Genesis 5", "Matthew 2:13–23"], ["watchD", "The Lord said, “I will be gracious to whom I will be gracious, and will show mercy on whom I will show mercy.” Exodus 33:19"], ["docT", "You know the generous act of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, so that by his poverty you might become rich. 2 Corinthians 8:9"], ["prayer", "Immanuel, you chose to act on our behalf. You left your heavenly throne to be with us on earth, so that we could attain the richness of your hope. Be always with us, Lord Jesus Christ. Amen."]], "6": [["info", "Epiphany of the Lord"], ["watchO", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["specialVerse", "Epiphany of the Lord", "Isaiah 60:1-6", "Psalm 72:1-7,10-14", "Ephesians 3:1-12", "Matthew 2:1-12"], ["dateVerse", "Thursday, January 6", "Psalm 5", "Genesis 6:1–7:10", "Matthew 3"], ["watchD", "I will cleanse them from all the guilt of their sin against me, and I will forgive. Jeremiah 33:8"], ["docT", "Jesus Christ is the atoning sacrifice for our sins, and not for ours only but also for the sins of the whole world. 1 John 2:2"], ["prayer", "O Morning Star, you are our true light that enlivens our nights and days. Let us turn from the sin that hinders our relationship with you and each other, so that you may fill our hearts with light forevermore. Amen."]], "7": [["dateVerse", "Friday, January 7", "Psalm 6", "Genesis 7:11–8:22", "Matthew 4:1–11"], ["watchD", "So acknowledge today and take to heart that the Lord is God in heaven above and on the earth beneath; there is no other. Deuteronomy 4:39"], ["docT", "God was pleased to have all his fullness dwell in him, and through him to reconcile to himself all things, whether things on earth or things in heaven. Colossians 1:19-20 NIV"], ["prayer", "Christ in God, you are the creator of heaven and earth. You created us in your image, and you came to redeem us. Equip us to respond to your goodness in actions of faith, love, and hope. Amen."]], "8": [["dateVerse", "Saturday, January 8", "Psalm 7:1-9", "Genesis 9", "Matthew 4:12–25"], ["watchD", "Even now, in fact, my witness is in heaven, and he that vouches for me is on high. Job 16:19"], ["docT", "Faith is the assurance of things hoped for, the conviction of things not seen. Hebrews 11:1"], ["prayer", "O God, our witness and redeemer, we thank you for the gift of grace that you have given to us through your Son, Jesus Christ. May we continue to trust in your abundant faithfulness and love. In Jesus’ name, we pray. Amen."]], "9": [["watchO", "First Sunday after the Epiphany Watchword for the week — God says, “Do not fear, for I have"], ["info", "redeemed you; I have called you by name, you are mine.” Isaiah 43:1"], ["dateVerse", "Sunday, January 9", "Isaiah 43:1-7", "Psalm 29", "Acts 8:14-17", "Luke 3:15-17,21-22"], ["watchD", "Alas for those who rely on horses, who trust in chariots because they are many, but do not consult the Lord! Isaiah 31:1"], ["docT", "Therefore we must pay greater attention to what we have heard, so that we do not drift away from it. Hebrews 2:1"], ["prayer", "Rock of our salvation, we turn to your word of truth for guidance in this life. Despite the temptations around us, keep us steadfast in your wisdom that has been revealed to us in the words of scripture. Amen."]], "10": [["dateVerse", "Monday, January 10", "Psalm 7:10-17", "Genesis 10:1–11:9", "Matthew 5:1–16"], ["watchD", "But who can detect their errors? Clear me from hidden faults. Psalm 19:12"], ["docT", "The Lord will bring to light the things now hidden in darkness and will disclose the purposes of the heart. Then each one will receive commendation from God. 1 Corinthians 4:5"], ["prayer", "Gracious God, we thank you for the gift of Holy Scripture. Through the word of the cross, we are shown how to live and are given the assurance of your great salvation through Jesus Christ, our Lord. Amen."]], "11": [["dateVerse", "Tuesday, January 11", "Psalm 8", "Genesis 11:10–12:9", "Matthew 5:17–26"], ["watchD", "For in many dreams and in many words there is emptiness. Rather, fear God. Ecclesiastes 5:7 NASB"], ["docT", "Do not allow yourselves to be condemned by anyone who claims to be superior because of special visions and who insists on false humility and the worship of angels. For no reason at all, such people are all puffed up by their human way of thinking and have stopped holding on to Christ. Colossians 2:18-19 GNT"], ["prayer", "O Lamb of God, we are faced with moments of pride, ambition, and selfishness in this life. When those moments arise, remind us of your generosity and grace, so that we may offer these blessings to others and follow you humbly and selflessly. In Jesus’ name, we pray. Amen."]], "12": [["dateVerse", "Wednesday, January 12", "Psalm 9:1-10", "Genesis 12:10–13:18", "Matthew 5:27–42"], ["watchD", "But the Lord is the true God; he is the living God and the everlasting King. Jeremiah 10:10"], ["docT", "Jesus said, “I thank you, Father, Lord of heaven and earth, because you have hidden these things from the wise and the intelligent and have revealed them to infants.” Matthew 11:25"], ["prayer", "Loving God, we need no special knowledge to know you. We need not pass a test to receive your grace. The only thing you ask of us is to believe and trust in you, our Lord, Creator, and King. Amen."]], "13": [["dateVerse", "Thursday, January 13", "Psalm 9:11-20", "Genesis 14,15", "Matthew 5:43–6:4"], ["watchD", "Let those who love your salvation say evermore, ‘God is great!’ Psalm 70:4"], ["docT", "May the God of steadfastness and encouragement grant you to live in harmony with one another, in accordance with Christ Jesus, so that together you may with one voice glorify God. Romans 15:5-6"], ["prayer", "Gracious God, you created us as unique individuals with differing opinions, ideas, and convictions about this life. Even though our differences may remain, unite us in Christ so that we may be your Church. Amen."]], "14": [["dateVerse", "Friday, January 14", "Psalm 10:1-11", "Genesis 16,17", "Matthew 6:5–18"], ["watchD", "The Lord has done great things for us, and we rejoiced. Psalm 126:3"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly places. Ephesians 1:3"], ["prayer", "Thank you, loving Father, for all the many blessings that you have bestowed upon us, especially your Son, Jesus Christ, for Christ is our joy and our life. Amen."]], "15": [["dateVerse", "Saturday, January 15", "Psalm 10:12-18", "Genesis 18", "Matthew 6:19–34"], ["watchD", "He was wounded for our transgressions, crushed for our iniquities. Isaiah 53:5"], ["docT", "God made him who had no sin to be sin for us, so that in him we might become the righteousness of God. 2 Corinthians 5:21 NIV"], ["prayer", "Saving God, we do not deserve the grace you have given to us in Jesus Christ. Yet, you offer it to us freely, which moves us to respond in faith, love, and hope. Amen."]], "16": [["info", "Second Sunday after the Epiphany"], ["watchO", "Watchword for the week — Now there are varieties of gifts, but the same Spirit; and there are varieties of services, but the same Lord. 1 Corinthians 12:4–5"], ["dateVerse", "Sunday, January 16", "Isaiah 62:1-5", "Psalm 36:5-10", "1 Corinthians 12:1-11", "John 2:1-11"], ["watchD", "Seek the Lord and his strength; seek his presence continually. Psalm 105:4"], ["docT", "Everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. Luke 11:10"], ["prayer", "Lord, we find our home in you. When we lose our way in this life, all we must do is come home and knock on the door. You are there beckoning us to stay. Help us to listen. Amen."]], "17": [["dateVerse", "Monday, January 17", "Psalm 11", "Genesis 19:1–29", "Matthew 7:1–12"], ["watchD", "Praise the Lord! How good it is to sing praises to our God. Psalm 147:1"], ["docT", "Sing psalms and hymns and spiritual songs among yourselves, singing and making melody to the Lord in your hearts. Ephesians 5:19"], ["prayer", "Lord of all being, we praise you for your goodness, faithfulness, and love. May our hearts, our souls, minds, and our voices offer continuous praise to you. Amen."]], "18": [["dateVerse", "Tuesday, January 18", "Psalm 12", "Genesis 19:30–20:18", "Matthew 7:13–23"], ["watchD", "Shepherd your people with your staff. Micah 7:14"], ["docT", "The sheep follow the shepherd because they know his voice. John 10:4"], ["prayer", "Loving Shepherd, how blessed it is to be your sheep. You know us, and we know your voice. No matter where we go or what we do, your love gently guides us all the way. How blessed are we! Amen."]], "19": [["dateVerse", "Wednesday, January 19", "Psalm 13", "Genesis 21", "Matthew 7:24–8:4"], ["watchD", "Those who mock the poor insult their Maker; those who are glad at calamity will not go unpunished. Proverbs 17:5"], ["docT", "Blessed are the merciful, for they will receive mercy. Matthew 5:7"], ["prayer", "Lord Jesus, keep us from being blinded by worldly distractions of power and wealth. May we share your gifts of love and mercy to all, even the guilty, the poor, and the oppressed. We pray that we live our lives to reflect all the goodness and grace you offer us each day. In Jesus’ name, we pray. Amen."]], "20": [["dateVerse", "Thursday, January 20", "Psalm 14", "Genesis 22", "Matthew 8:5–22"], ["watchD", "The heavens are telling the glory of God. Psalm 19:1"], ["docT", "Worship him who made heaven and earth, the sea and the springs of water. Revelation 14:7"], ["prayer", "Creator of all, what beauty is seen around us. The skies, the earth, the sea, all attest to your glorious power and handiwork. We praise you day and night for all that you have done for us. Amen."]], "21": [["dateVerse", "Friday, January 21", "Psalm 15", "Genesis 23:1–24:25", "Matthew 8:23–34"], ["watchD", "Yet, O Lord, you are our Father; we are the clay, and you are our potter; we are all the work of your hand. Isaiah 64:8"], ["docT", "You did not choose me but I chose you. And I appointed you to go and bear fruit, fruit that will last. John 15:16"], ["prayer", "Faithful Potter, you shape us and form us, yet we move and work through our own free will. Let our work and lives reflect you, our one true light. Amen."]], "22": [["dateVerse", "Saturday, January 22", "Psalm 16:1-6", "Genesis 24:26–67", "Matthew 9:1–13"], ["watchD", "All the boots of the tramping warriors and all the garments rolled in blood shall be burned as fuel for the fire. Isaiah 9:5"], ["docT", "By the tender mercy of our God, the dawn from on high will break upon us, to give light to those who sit in darkness and in the shadow of death, to guide our feet into the way of peace. Luke 1:78-79"], ["prayer", "Gracious God, we know that you are the ruler of the universe. Too often, our earthly pilgrimage is clouded by injustices of the rich and powerful. Keep us mindful in these challenges to stay within your truth and goodness. Amen."]], "23": [["watchO", "Third Sunday after the Epiphany Watchword for the week — Let the words of my mouth and the meditation of my heart be acceptable to you, O Lord, my rock and my redeemer. Psalm 19:14"], ["dateVerse", "Sunday, January 23", "Nehemiah 8:1-3,5-6,8-10", "Psalm 19", "1 Corinthians 12:12-31a", "Luke 4:14-21"], ["watchD", "I will sing to the Lord as long as I live; I will sing praise to my God while I have being. Psalm 104:33"], ["docT", "Are any among you suffering? They should pray. Are any cheerful? They should sing songs of praise. James 5:13"], ["prayer", "Gracious God, our days are filled with joys and sorrows. Sometimes, we may find it difficult to speak the right words, but you have given us song and music when words are insufficient. May we always sing of your goodness. Amen."]], "24": [["dateVerse", "Monday, January 24", "Psalm 16:7-11", "Genesis 25", "Matthew 9:14–26"], ["watchD", "If I say, “Surely the darkness shall cover me, and the light around me become night,” even the darkness is not dark to you; the night is as bright as the day. Psalm 139:11-12"], ["docT", "As the sun was setting, all those who had any who were sick with various kinds of diseases brought them to him; and he laid his hands on each of them and cured them. Luke 4:40"], ["prayer", "Great Physician, you bring healing without medicines. You bring healing by seeking out those in the shadows and touching them with your loving embrace. Reach out to us, so that we may be your hands in the world today. Amen."]], "25": [["dateVerse", "Tuesday, January 25", "Psalm 17:1-7", "Genesis 26", "Matthew 9:27–38"], ["watchD", "Correct me, O Lord, but in just measure; not in your anger, or you will bring me to nothing. Jeremiah 10:24"], ["docT", "God has destined us not for wrath but for obtaining salvation through our Lord Jesus Christ. 1 Thessalonians 5:9"], ["prayer", "Ever-loving God, you have created us in your image. We are a part of your good creation, yet we sometimes falter in life’s journey. In those times of struggle, lead us back to you and to your truth. Amen."]], "26": [["dateVerse", "Wednesday, January 26", "Psalm 17:8-15", "Genesis 27:1–29", "Matthew 10:1–16"], ["watchD", "Let your work be manifest to your servants, and your glorious power to their children. Psalm 90:16"], ["docT", "The Word became flesh and lived among us, and we have seen his glory, the glory as of a father’s only son, full of grace and truth. John 1:14"], ["prayer", "Lord, the beauty, glory, and love that surround us affirm your universal power. With all that mighty power, you chose to come to us and live with us, to give us life abundant. Thank you, God, for that gift. Amen."]], "27": [["dateVerse", "Thursday, January 27", "Psalm 18:1-6", "Genesis 27:30–28:9", "Matthew 10:17–25"], ["watchD", "The steadfast love of the Lord is from everlasting to everlasting on those who fear him, and his righteousness to children’s children, to those who keep his covenant. Psalm 103:17-18"], ["docT", "Jesus Christ is the same yesterday and today and forever. Hebrews 13:8"], ["prayer", "Christ, Saranam. You are always the same, yet we seek to learn more of you every day. Guide us in the way, so that our lives show us to be the people whom you have called us to be. Amen."]], "28": [["dateVerse", "Friday, January 28", "Psalm 18:7-15", "Genesis 28:10–29:14", "Matthew 10:26–42"], ["watchD", "For God alone my soul waits in silence, for my hope is from him. Psalm 62:5"], ["docT", "Let anyone with ears listen! Matthew 11:15"], ["prayer", "God, as Elijah could not find you in the wind or fire, sometimes we cannot find you in the noise of this world. Help us to listen to the silence. It is there that we can find you speaking to us. Amen."]], "29": [["dateVerse", "Saturday, January 29", "Psalm 18:16-24", "Genesis 29:15–30:24", "Matthew 11:1–10"], ["watchD", "I will save them from all the apostasies into which they have fallen, and will cleanse them. Then they shall be my people. Ezekiel 37:23"], ["docT", "Do you not know that you are God’s temple and that God’s Spirit dwells in you? 1 Corinthians 3:16"], ["prayer", "Merciful God, our sins are many. We turn from you and follow our own way, especially when life’s burdens weigh us down. Yet, you continue to live within us. You continue to call us by your grace to happiness. Let us ever be grateful. Amen."]], "30": [["info", "Fourth Sunday after the Epiphany"], ["watchO", "Watchword for the week — For now we see in a mirror, dimly, but then we will see face to face. 1 Corinthians 13:12"], ["dateVerse", "Sunday, January 30", "Jeremiah 1:4-10", "Psalm 71:1-6", "1 Corinthians 13:1-13", "Luke 4:21-30"], ["watchD", "We will say no more, “Our God,” to the work of our hands. Hosea 14:3"], ["docT", "What good is it for someone to gain the whole world, yet forfeit their soul? Mark 8:36 NIV"], ["prayer", "Our God, how do you guide our lives daily? We may struggle to answer that question, but we know that you are there. You are faithful. It is you who leads us through this world to happiness. Amen."]], "31": [["dateVerse", "Monday, January 31", "Psalm 18:25-29", "Genesis 30:25–31:21", "Matthew 11:11–24"], ["watchD", "Return, O faithless children, I will heal your faithlessness. “Here we come to you; for you are the Lord our God.” Jeremiah 3:22"], ["docT", "You were going astray like sheep, but now you have returned to the shepherd and guardian of your souls. 1 Peter 2:25"], ["prayer", "Loving Shepherd, we may go astray in our life’s journey. We may be burdened by despair and grief. We may be lost in the maze of this world. Fold us to your arms. Never let us go, and lead the way! Amen."]], "32": [["dateVerse", "Tuesday, February 1", "Psalm 18:30-36", "Genesis 31:22–55", "Matthew 11:25–12:8"], ["watchD", "The surviving remnant of the house of Judah shall again take root downwards, and bear fruit upwards. 2 Kings 19:30"], ["docT", "If the root is holy, then the branches also are holy. Romans 11:16"], ["prayer", "Father, we pray that as we take root in knowing you as our protector and sovereign Lord, we may seek to live the life you have chosen for us to live. Amen."]], "33": [["dateVerse", "Wednesday, February 2", "Psalm 18:37-45", "Genesis 32:1–21", "Matthew 12:9–21"], ["watchD", "I will bless the Lord at all times; his praise shall continually be in my mouth. Psalm 34:1"], ["docT", "Rejoice always, pray without ceasing, give thanks in all circumstances. 1 Thessalonians 5:16-18"], ["prayer", "We thank you, Lord, for the gift of being able to freely pray, praise, and worship you. May we continue to pray without ceasing in happy times, but also during the hard times. May our mouths be vessels of your love. In Jesus’ name. Amen."]], "34": [["dateVerse", "Thursday, February 3", "Psalm 18:46-50", "Genesis 32:22–33:20", "Matthew 12:22–32"], ["watchD", "Save us, O God of our salvation, and gather us, that we may give thanks to your holy name. 1 Chronicles 16:35"], ["docT", "Jesus prayed, “Holy Father, protect them in your name that you have given me, so that they may be one, as we are one.” John 17:11"], ["prayer", "Heavenly Father, we thank you for our salvation and your protection in all our battles. You are worthy of all glory and praise, and so by faith, we run to you for safety. All glory be to you, in Jesus’ name. Amen."]], "35": [["dateVerse", "Friday, February 4", "Psalm 19:1-6", "Genesis 34", "Matthew 12:33–45"], ["watchD", "You shall rise up before the grayheaded and honor the aged. Leviticus 19:32 NASB"], ["docT", "Outdo one another in showing honor. Romans 12:10"], ["prayer", "Abba Father, there is much wisdom that comes from the respect of our elders. From that wisdom, we learn of love, have faith, and trust. Forgive us for not fully relating to our elders, be they of our church, family, or friends. Encourage us to listen to the stories they have to tell to guide us closer to your love. Amen."]], "36": [["dateVerse", "Saturday, February 5", "Psalm 19:7-14", "Genesis 35:1–36:8", "Matthew 12:46–13:9"], ["watchD", "Happy is the nation whose God is the Lord, the people whom he has chosen as his heritage. Psalm 33:12"], ["docT", "And because you are children, God has sent the spirit of his son into our hearts, crying, “Abba! Father!” So you are no longer a slave but a child, and if a child then also an heir, through God. Galatians 4:6-7"], ["prayer", "Sovereign God, we praise you for your blessing and protection upon our nation. Help us, Lord, to seek you daily. May you reign supreme and reign alone in our lives. We give all honor and glory to you, in Jesus’ name. Amen."]], "37": [["info", "Fifth Sunday after the Epiphany"], ["watchO", "Watchword for the week — The Lord will fulfill his purpose for me; your steadfast love, O Lord, endures forever. Psalm 138:8"], ["dateVerse", "Sunday, February 6", "Isaiah 6:1-8(9-13)", "Psalm 138", "1 Corinthians 15:1-11", "Luke 5:1-11"], ["watchD", "He shall stand and feed his flock in the strength of the Lord. Micah 5:4"], ["docT", "When Jesus saw the crowds, he had compassion for them, because they were harassed and helpless, like sheep without a shepherd. Matthew 9:36"], ["prayer", "Lord God, you are the great shepherd. We, like lost sheep, often wander and stray, but we are never out of your watchful eye, nor your loving heart. Through the Holy Spirit, fill us with wisdom and strength, and guide us safely through this day. We humbly come to you, in Jesus’ name. Amen."]], "38": [["dateVerse", "Monday, February 7", "Psalm 20", "Genesis 36:9–43", "Matthew 13:10–23"], ["watchD", "He will cover you with his pinions, and under his wings you will find refuge. Psalm 91:4"], ["docT", "And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus. Philippians 4:7"], ["prayer", "Heavenly Father, thank you for the people you put into our lives to take us under their wings, to offer us examples of how to become better disciples, and to show us the peace that flows from your unconditional love. For this, O Lord, we give you praise and thanksgiving, in Jesus’ name. Amen."]], "39": [["dateVerse", "Tuesday, February 8", "Psalm 21", "Genesis 37", "Matthew 13:24–35"], ["watchD", "Do not fear the reproach of others, and do not be dismayed when they revile you. Isaiah 51:7"], ["docT", "Fight the good fight of the faith; take hold of the eternal life, to which you were called and for which you made the good confession in the presence of many witnesses. 1 Timothy 6:12"], ["prayer", "Our heavenly Father, surround us today with a renewed sense of your presence. In those times of distress and discouragement, fill us with your sustaining strength that we may continue the good fight of the faith, knowing that you are Emmanuel—God with us! May you be glorified this day, in Jesus’ name. Amen."]], "40": [["dateVerse", "Wednesday, February 9", "Psalm 22:1-8", "Genesis 38", "Matthew 13:36–46"], ["watchD", "His dominion shall be from sea to sea, and to the ends of the earth. Zechariah 9:10"], ["docT", "God gave Jesus the name that is above every name, so that at the name of Jesus every knee should bend, in heaven and on earth and under the earth. Philippians 2:9-10"], ["prayer", "Lord God, your son is the savior of the world, your eternal word, by whom and for whom all things were made, and for this we praise you! May all that we do glorify you as we go through each day. In Jesus’ name, we pray. Amen."]], "41": [["dateVerse", "Thursday, February 10", "Psalm 22:9-21", "Genesis 39", "Matthew 13:47–58"], ["watchD", "The heavens are the Lord’s heavens, but the earth he has given to human beings. Psalm 115:16"], ["docT", "From everyone to whom much has been given, much will be required; and from the one to whom much has been entrusted, even more will be demanded. Luke 12:48"], ["prayer", "Almighty God, help us to be good stewards of this world that you have created for us. You have given us the responsibility of cherishing it as a precious gift. Please help us to preserve the earth and all that is in it to honor and glorify you. Amen."]], "42": [["dateVerse", "Friday, February 11", "Psalm 22:22-28", "Genesis 40:1–41:16", "Matthew 14:1–14"], ["watchD", "Be very careful, therefore, to love the Lord your God. Joshua 23:11"], ["docT", "Jesus said, “Those who love me will keep my word, and my Father will love them, and we will come to them and make our home with them.” John 14:23"], ["prayer", "Dear Lord, thank you for loving us first. How can we not love you? Please help us to reach out to all of your children to show them the love only you can give. In Jesus’ name, we pray. Amen."]], "43": [["dateVerse", "Saturday, February 12", "Psalm 22:29-31", "Genesis 41:17–57", "Matthew 14:15–24"], ["watchD", "My mouth is filled with your praise and with your glory all day long. Psalm 71:8"], ["docT", "For the mouth speaks what the heart is full of. Matthew 12:34 NIV"], ["prayer", "Gracious God, thank you for this human form that you have given us. We especially thank you for our mouths that can praise you and share your Gospel. Please forgive us when we use the gift of voice for evil instead of good. Amen."]], "44": [["info", "Sixth Sunday after the Epiphany"], ["watchO", "Watchword for the week — Blessed are those who trust in the Lord, whose trust is the Lord. Jeremiah 17:7"], ["dateVerse", "Sunday, February 13", "Jeremiah 17:5-10", "Psalm 1", "1 Corinthians 15:12-20", "Luke 6:17-26"], ["watchD", "But who can endure the day of his coming, and who can stand when he appears? Malachi 3:2"], ["docT", "Listen! I am standing at the door, knocking; if you hear my voice and open the door, I will come in to you and eat with you, and you with me. Revelation 3:20"], ["prayer", "Dear Savior Jesus, prepare us for your coming. May we be ready to open the door of our hearts when you stand and knock. We praise you for your saving grace. In the name of Jesus. Amen."]], "45": [["dateVerse", "Monday, February 14", "Psalm 23", "Genesis 42", "Matthew 14:25–15:9"], ["watchD", "My heart is steadfast, O God, my heart is steadfast; I will sing and make melody. Awake, my soul! Psalm 108:1"], ["docT", "Joyfully give thanks to the Father, who has enabled you to share in the inheritance of the saints in the light. Colossians 1:11-12"], ["prayer", "Our loving Father, we give thanks to you for the eternal inheritance that you’ve bestowed upon us. Lord, please keep us steadfast and strong in our love for you. We pray this in Jesus’ holy name. Amen."]], "46": [["dateVerse", "Tuesday, February 15", "Psalm 24", "Genesis 43", "Matthew 15:10–20"], ["watchD", "Fools say in their hearts, “There is no God.” Psalm 14:1"], ["docT", "We know that the Son of God has come and has given us understanding so that we may know him who is true. 1 John 5:20"], ["prayer", "O holy God, we can know wisdom and truth as it comes only from you. Thank you, Holy Spirit, for opening our eyes and hearts to the truth that will set us free. May you be glorified. In Jesus’ precious name. Amen."]], "47": [["dateVerse", "Wednesday, February 16", "Psalm 25:1-7", "Genesis 44", "Matthew 15:21–28"], ["watchD", "Blessed are those whose strength is in you, whose hearts are set on pilgrimage. Psalm 84:5 NIV"], ["docT", "Keep alert, stand firm in your faith, be courageous, be strong. 1 Corinthians 16:13"], ["prayer", "Dear Lord, you are our strength, our redeemer, and our life. Please help us to stay alert and stand firm in our faith. By the power of the Holy Spirit, may we be courageous as we travel our life’s quest for your eternal kingdom. Praising you, in the name of Jesus. Amen."]], "48": [["dateVerse", "Thursday, February 17", "Psalm 25:8-22", "Genesis 45", "Matthew 15:29–16:4"], ["watchD", "Lead me in your truth, and teach me. Psalm 25:5"], ["docT", "Jesus said, “If you continue in my word, you are truly my disciples; and you will know the truth, and the truth will make you free.” John 8:31-32"], ["prayer", "Dear Lord and Teacher, lead us and teach us, so that we may grow as your disciples. Direct us to your word, that we may know and proclaim to others the truth that sets us free. May we never take that freedom lightly, and help us remain diligent in the study of your word. Amen."]], "49": [["dateVerse", "Friday, February 18", "Psalm 26", "Genesis 46:1–27", "Matthew 16:5–20"], ["watchD", "The Lord said to Moses, “You cannot see my face; for no one shall see me and live.” Exodus 33:20"], ["docT", "God’s love was revealed among us in this way: God sent his only Son into the world so that we might live through him. 1 John 4:9"], ["prayer", "Gracious God, thank you for sending your son, our savior, to show us your love. He was sent into a once perfect world to one filled with hate and discord. Thank you for sending love to those who seek him. We humbly praise you for your everlasting power and love. Amen."]], "50": [["dateVerse", "Saturday, February 19", "Psalm 27:1-6", "Genesis 46:28–47:31", "Matthew 16:21–28"], ["watchD", "Do not now be stiff-necked, but yield yourselves to the Lord and come to his sanctuary. 2 Chronicles 30:8"], ["docT", "One of the dinner guests said to Jesus, “Blessed is anyone who will eat bread in the kingdom of God!” Luke 14:15"], ["prayer", "Dear God, forgive our stiff-necked ways. Please help us to yield ourselves to you. Thank you for the invitation to enter your sanctuary and share bread in your kingdom. In Jesus’ most precious name. Amen."]], "51": [["info", "Seventh Sunday after the Epiphany"], ["watchO", "Watchword for the week — Jesus said, “Be merciful, just as your Father is merciful.” Luke 6:36"], ["dateVerse", "Sunday, February 20", "Genesis 45:3-11,15", "Psalm 37:1-11,39-40", "1 Corinthians 15:35-38,42-50", "Luke 6:27-38"], ["watchD", "The Lord said to Isaac, “Through your offspring all nations on earth will be blessed.” Genesis 26:4 NIV"], ["docT", "Now you, brothers and sisters, like Isaac, are children of promise. Galatians 4:28 NIV"], ["prayer", "O, merciful Father, thank you for the blessings you have graciously given us. Thank you for opening up your inheritance to allow us to be your children. With praise and adoration, we lift up the name of Jesus! Amen."]], "52": [["dateVerse", "Monday, February 21", "Psalm 27:7-14", "Genesis 48", "Matthew 17:1–13"], ["watchD", "After he has suffered, he will see the light of life and be satisfied. Isaiah 53:11 NIV"], ["docT", "And you have come to fullness in Christ, who is the head of every ruler and authority. Colossians 2:10"], ["prayer", "Dear heavenly Father, what a joy it is to know that we are spiritually complete because of the suffering you endured for us. You teach us that, like you, we too can find joy in the suffering we face. Show us, through the power of the Holy Spirit, what we need to know to become more like you each day, that we may walk in your light for others to see you in us. We praise you, in Jesus’ holy name. Amen."]], "53": [["dateVerse", "Tuesday, February 22", "Psalm 28", "Genesis 49", "Matthew 17:14–27"], ["watchD", "Hear, O kings; give ear, O princes; to the Lord I will sing, I will make melody to the Lord, the God of Israel. Judges 5:3"], ["docT", "Let your gentleness be known to everyone. The Lord is near. Philippians 4:5"], ["prayer", "Abba Father, what a wonderful blessing to sing your praises. Help us to walk in faith and watchfulness as we await your glorious return. Help us to ward off evil that may come between us. Let us rejoice in all things and share the light of your countenance as we go forth to serve you, in Jesus’ name. Amen."]], "54": [["dateVerse", "Wednesday, February 23", "Psalm 29", "Genesis 50", "Matthew 18:1–14"], ["watchD", "I shall not be put to shame, having my eyes fixed on all your commandments. Psalm 119:6"], ["docT", "Jesus said, “My food is to do the will of him who sent me and to complete his work.” John 4:34"], ["prayer", "Almighty and sovereign Lord, teach us to love in truth, and to honor and respect those around us. Through your word and the leading of the Holy Spirit, gracious God, empower and enable us to love as you love, and do as you would do. Amen."]], "55": [["dateVerse", "Thursday, February 24", "Psalm 30:1-5", "Exodus 1:1–2:10", "Matthew 18:15–35"], ["watchD", "The Lord God will take away the disgrace of his people from all the earth. Isaiah 25:8"], ["docT", "With a solemn oath to our ancestor Abraham he promised to rescue us from our enemies and allow us to serve him without fear. Luke 1:73-74 GNT"], ["prayer", "Sovereign Lord, we come to you from a broken world of sin and disgrace. Like Abraham, grant us courage and wisdom to turn away from our enemies and serve you with all glory and honor. We give thanks to you, in Jesus’ name. Amen."]], "56": [["dateVerse", "Friday, February 25", "Psalm 30:6-12", "Exodus 2:11–3:22", "Matthew 19:1–12"], ["watchD", "The Lord will vindicate his people, and have compassion on his servants. Psalm 135:14"], ["docT", "Blessed are those who hunger and thirst for righteousness, for they will be filled. Matthew 5:6"], ["prayer", "Merciful Savior, we come to you in hunger and thirst to see your righteousness prevail. Renew us through the power of your holy spirit. Give us boldness and wisdom to acknowledge our sinful ways, and turn again our hearts to you. Bless and keep us, gracious Lord and God. Amen."]], "57": [["dateVerse", "Saturday, February 26", "Psalm 31:1-5", "Exodus 4:1–5:9", "Matthew 19:13–22"], ["watchD", "The Lord is my light and my salvation; whom shall I fear? Psalm 27:1"], ["docT", "Jesus said, “Whoever follows me will never walk in darkness but will have the light of life.” John 8:12"], ["prayer", "Jehovah God, light of all light, who shines through darkness and makes the night as day, transform us into vessels of light, walking toward you and dispelling all darkness. May all see your light and know the salvation that comes only through the blood of Jesus Christ! May all glory be yours, in his majestic name. Amen."]], "58": [["info", "Last Sunday after the Epiphany"], ["watchO", "Watchword for the week — And when they looked up, they saw no one except Jesus alone. Matthew 17:8"], ["dateVerse", "Sunday, February 27", "Exodus 34:29-35", "Psalm 99", "2 Corinthians 3:12-4:2", "Luke 9:28-36,(37-43)"], ["watchD", "Wait for the Lord; be strong, and let your heart take courage; wait for the Lord! Psalm 27:14"], ["docT", "Paul wrote: Our hope for you is unshaken; for we know that as you share in our sufferings, so also you share in our consolation. 2 Corinthians 1:7"], ["prayer", "Gentle, loving Shepherd, we wait patiently for you. Silence our lips and open our hearts, that we may hear you speak. Show us the pathway you would have us take, so we may walk humbly before you. Remove those things which take our attention from you and let us be wholly and totally committed to you. We pray, in the powerful name of Jesus. Amen."]], "59": [["dateVerse", "Monday, February 28", "Psalm 31:6-9", "Exodus 5:10–6:12", "Matthew 19:23–30"], ["watchD", "Who is like you, O Lord, among the gods? Who is like you, majestic in holiness, awesome in splendor, doing wonders? Exodus 15:11"], ["docT", "We have seen it and testify to it, and declare to you the eternal life that was with the Father and was revealed to us. 1 John 1:2"], ["prayer", "Lord of the apostles and prophets, we thank you for their words of testimony and guidance, and for their faithfulness. We are in awe of your unconditional love and favor for us. You are the bread of life; your love is above all things in heaven and on earth. We thank you, we praise you, and we magnify you, most gracious Lord and God. Alleluia  and Amen."]], "60": [["info", "March 1, 1457:"], ["info", "Beginning of the Unity of the Brethren in Bohemia"], ["dateVerse", "Tuesday, March 1", "Psalm 31:10-20", "Exodus 6:13–7:24", "Matthew 20:1–16"], ["watchD", "May all who seek you rejoice and be glad in you. Psalm 40:16"], ["docT", "Day by day, as they spent much time together in the temple, they broke bread at home and ate their food with glad and generous hearts, praising God and having the goodwill of all the people Acts 2:46-47"], ["prayer", "Good Lord, we rejoice not only because you call us, but because you call us together. As eager as we are to share our songs and your story, may we so gladly and generously share our bread and your table. Amen."]], "61": [["specialVerse", "Ash Wednesday", "Joel 2:1-2,12-17", "Psalm 51:1-17", "2 Corinthians 5:20b-6:10", "Matthew 6:1-6,16-21"], ["dateVerse", "Wednesday, March 2", "Psalm 31:21-24", "Exodus 8", "Matthew 20:17–28"], ["watchD", "If you obey the Lord your God: Blessed shall you be in the city, and blessed shall you be in the field. Deuteronomy 28:2-3"], ["docT", "Jesus responded, “Blessed rather are those who hear the word of God and obey it!” Luke 11:28"], ["prayer", "O just and righteous God, may our obedience be moved by an understanding of your heart and what you hold as precious. Bless your word which we receive by faith, and bless the faith by which we walk. Amen."]], "62": [["dateVerse", "Thursday, March 3", "Psalm 32", "Exodus 9", "Matthew 20:29–21:11"], ["watchD", "God will send forth his steadfast love and his faithfulness. Psalm 57:3"], ["docT", "God has not left himself without a witness in doing good—giving you rains from heaven and fruitful seasons, and filling you with food and your hearts with joy. Acts 14:17"], ["prayer", "God, you are the bread of heaven, living water, and life abundant: heal and deliver us from fearful want. May we trust and honor your generosity, rely on your grace and goodness, and give ourselves in loving service to others. Amen."]], "63": [["dateVerse", "Friday, March 4", "Psalm 33:1-5", "Exodus 10", "Matthew 21:12–22"], ["watchD", "My eyes are fixed on you, Sovereign Lord; in you I take refuge—do not give me over to death. Psalm 141:8 NIV"], ["docT", "Jesus said, “I live, you also will live.” John 14:19"], ["prayer", "At your word and by your holy will, let us rise each day to run with perseverance the race set before us. And may our running always be with you and to you, O Jesus, we pray. Amen."]], "64": [["dateVerse", "Saturday, March 5", "Psalm 33:6-11", "Exodus 11:1–12:20", "Matthew 21:23–32"], ["watchD", "Where morning dawns and evening fades you call forth songs of joy. Psalm 65:8 NIV"], ["docT", "Jesus went on through cities and villages, proclaiming and bringing the good news of the kingdom of God. Luke 8:1"], ["prayer", "Breath of heaven, Lord of our hearts, may the joyful declaration of God’s love ring burnished and bright in our living today. And, in Christ, may the good news we boast of be matched by the good news we bring. Amen."]], "65": [["info", "First Sunday in Lent"], ["watchO", "Watchword for week — No one who believes in Christ will be put to shame. Romans 10:11"], ["dateVerse", "Sunday, March 6", "Deuteronomy 26:1-11", "Psalm 91:1-2,9-16", "Romans 10:8b-13", "Luke 4:1-13"], ["watchD", "The Lord is in his holy temple; let all the earth keep silence before him! Habakkuk 2:20"], ["docT", "The wise men said, “We have come to worship him.” Matthew 2:2 NKJV"], ["prayer", "God of wonders, we stand astonished and lower our eyes in awe. Heaven and earth are filled with your glory, yet you walk to Jerusalem. Prepare us for the journey ahead and the steps we take in faith this day. Amen."]], "66": [["dateVerse", "Monday, March 7", "Psalm 33:12-22", "Exodus 12:21–51", "Matthew 21:33–46"], ["watchD", "See, the Lord God comes with might, and his arm rules for him. Isaiah 40:10"], ["docT", "Stand up and raise your heads, because your redemption is drawing near. Luke 21:28"], ["prayer", "To the far-off hills, forever we run and raise our prayers, O God. In your name, high and holy, and in the hope of your help, we rejoice in knowing your presence is near. In Jesus’ name, we pray. Amen."]], "67": [["dateVerse", "Tuesday, March 8", "Psalm 34:1-7", "Exodus 13:1–14:18", "Matthew 22:1–14"], ["watchD", "There is no rock like our God. 1 Samuel 2:2"], ["docT", "For no one can lay any foundation other than the one that has been laid; that foundation is Jesus Christ. 1 Corinthians 3:11"], ["prayer", "Lord, forgive us for boasting about the terra firma of our lives that are castles made of sand. Your truth and your grace—your perfect love alone—are the true footings of our faith and without them we labor in vain. Amen."]], "68": [["dateVerse", "Wednesday, March 9", "Psalm 34:8-18", "Exodus 14:19–15:21", "Matthew 22:15–22"], ["watchD", "The fear of the Lord is hatred of evil. Proverbs 8:13"], ["docT", "We are what he has made us, created in Christ Jesus for good works. Ephesians 2:10"], ["prayer", "Maker of all things great and small, we celebrate the care by which you forge our hearts and fashion in us like-mindedness. May we love as you love and be built together into a true house of prayer. Amen."]], "69": [["dateVerse", "Thursday, March 10", "Psalm 34:19-22", "Exodus 15:22–16:36", "Matthew 22:23–40"], ["watchD", "I have put my words in your mouth, and hidden you in the shadow of my hand. Isaiah 51:16"], ["docT", "I know your works. Look, I have set before you an open door, which no one is able to shut. I know that you have but little power, and yet you have kept my word and have not denied my name. Revelation 3:8"], ["prayer", "Help us, dear Lord, to perceive the heart of matters and the truth of things. Let us neither be deceived nor fool ourselves. And yet, may our dreaming be charitable and generous enough to hold the hope of heaven. Amen."]], "70": [["dateVerse", "Friday, March 11", "Psalm 35:1-10", "Exodus 17:1–18:6", "Matthew 22:41–23:12"], ["watchD", "No one has power over the day of death. Ecclesiastes 8:8"], ["docT", "And can any of you by worrying add a single hour to your span of life? Matthew 6:27"], ["prayer", "God of hope, living word that makes us free, deliver us from the fear of grief and grave. Let our hearts endeavor, instead, to look trustingly to you and lovingly to our neighbors. Amen."]], "71": [["dateVerse", "Saturday, March 12", "Psalm 35:11-18", "Exodus 18:7–19:9", "Matthew 23:13–22"], ["watchD", "By the word of the Lord the heavens were made, and all their host by the breath of his mouth. Psalm 33:6"], ["docT", "God is not served by human hands, as if he needed anything. Rather, he himself gives everyone life and breath and everything else. Acts 17:25 NIV"], ["prayer", "Spirit of God, loving and holy, let our prayer today be for others: for their needs, their struggles, for your merciful intercession. Help us see how we may be used by you as instruments of care and grace. Amen."]], "72": [["info", "Second Sunday in Lent"], ["watchO", "Watchword for the week — The Lord is my light and my salvation; whom shall I fear? Psalm 27:1"], ["dateVerse", "Sunday, March 13", "Genesis 15:1-12,17-18", "Psalm 27", "Philippians 3:17-4:1", "Luke 13:31-35"], ["watchD", "A king is not saved by his great army; a warrior is not delivered by his great strength. Psalm 33:16"], ["docT", "But many who are first will be last, and the last will be first. Mark 10:31"], ["prayer", "Your gospel, precious Jesus, challenges us to review our priorities and assumptions. It makes demands of our loyalties and allegiances; it calls us to humility and sacrifice. Call us, by the message of salvation, to new life today. Amen."]], "73": [["dateVerse", "Monday, March 14", "Psalm 35:19-28", "Exodus 19:10–20:21", "Matthew 23:23–32"], ["watchD", "You shall go out in joy, and be led back in peace. Isaiah 55:12"], ["docT", "The good shepherd calls his own sheep by name and leads them out. John 10:3"], ["prayer", "Find us always ready, Lamb of God and shepherding Lord, to go, to move, to follow you. Lead us. Put our faith in motion, and let us always remember that you are the life, the truth, and the way. Amen."]], "74": [["dateVerse", "Tuesday, March 15", "Psalm 36", "Exodus 20:22–21:27", "Matthew 23:33–39"], ["watchD", "Thus says the Lord, “I have heard your prayer, I have seen your tears; indeed, I will heal you.” 2 Kings 20:5"], ["docT", "Knock, and the door will be opened for you. Matthew 7:7"], ["prayer", "O God who hears, we name you and know you to be near. May the cry of every burdened heart find its answer and comfort in you. Make us a people who hear and answer with love. Amen."]], "75": [["dateVerse", "Wednesday, March 16", "Psalm 37:1-6", "Exodus 21:28–22:24", "Matthew 24:1–25"], ["watchD", "Serve God with single mind and willing heart; for the Lord searches every mind. 1 Chronicles 28:9"], ["docT", "Now may the God of peace working among us that which is pleasing in his sight, through Jesus Christ, to whom be the glory forever and ever. Hebrews 13:20,21"], ["prayer", "Of your many names, O Lord, we thank you for the name of Jesus, that we may speak it, call you by this name, trust and share its power with others. For all that the name Jesus teaches us about your love, we give you thanks. Amen."]], "76": [["dateVerse", "Thursday, March 17", "Psalm 37:7-15", "Exodus 22:25–23:26", "Matthew 24:26–35"], ["watchD", "Remember the long way that the Lord your God has led you these forty years in the wilderness, in order to humble you, testing you to know what was in your heart. Deuteronomy 8:2"], ["docT", "Jesus said, “Take my yoke upon you, and learn from me; for I am gentle and humble in heart, and you will find rest for your souls.” Matthew 11:29"], ["prayer", "Nourishing God, almighty protector and provider, may we be so secure, so confident, so assured of your grace, as to bear your very likeness in our every act of mercy, blessing, and peace. Amen."]], "77": [["dateVerse", "Friday, March 18", "Psalm 37:16-22", "Exodus 23:27–25:9", "Matthew 24:36–44"], ["watchD", "Why, O Lord, do you stand far off? Why do you hide yourself in times of trouble? Psalm 10:1"], ["docT", "Jesus was in the stern, asleep on the cushion; and they woke him up and said to him, “Teacher, do you not care that we are perishing?” Mark 4:38"], ["prayer", "Gentle Persuader, fanning to flame our little faith, we do not doubt your power to rescue and redeem, only ours to walk together and work the Father’s will in your name. Help us see and trust in the good you see in us. Amen."]], "78": [["dateVerse", "Saturday, March 19", "Psalm 37:23-26", "Exodus 25:10–40", "Matthew 24:45–51"], ["watchD", "You brought up my life from the Pit, O Lord my God. Jonah 2:6"], ["docT", "God’s firm foundation stands, bearing this inscription: “The Lord knows those who are his,” 2 Timothy 2:19"], ["prayer", "Strong Deliverer, you are always bringing us from death to life! From glory to glory, your love grows brighter and shines in all you do. Though your saving work is finished, please renew us more each day. Amen."]], "79": [["info", "Third Sunday in Lent"], ["watchO", "Watchword for the week — Seek the Lord while he may be found, call upon him while he is near. Isaiah 55:6"], ["dateVerse", "Sunday, March 20", "Isaiah 55:1-9", "Psalm 63:1-8", "1 Corinthians 10:1-13", "Luke 13:1-9"], ["watchD", "Put my tears in your bottle. Are they not in your record? Psalm 56:8"], ["docT", "Blessed are those who mourn, for they will be comforted. Matthew 5:4"], ["prayer", "Almighty God, ever-present and all-knowing, we cannot thank you enough for being ALL to us. We thank you for your kindness, bearing our sorrows, and holding us in your heart. For that, we are forever grateful. Amen."]], "80": [["dateVerse", "Monday, March 21", "Psalm 37:27-33", "Exodus 26", "Matthew 25:1–13"], ["watchD", "Teach me the way I should go, for to you I lift up my soul. Psalm 143:8"], ["docT", "There is great gain in godliness combined with contentment; for we brought nothing into the world, so that we can take nothing out of it. 1 Timothy 6:6-7"], ["prayer", "Hovering Spirit, holy and here, make us gentle and tender towards your creation. Resuscitate in us the gifts of wonder, amazement, and delight. May we treat with utmost care all you have called good and shown that you love. Amen."]], "81": [["dateVerse", "Tuesday, March 22", "Psalm 37:34-40", "Exodus 27:1–28:14", "Matthew 25:14–30"], ["watchD", "This is the day that the Lord has made; let us rejoice and be glad in it. Psalm 118:24"], ["docT", "Jesus said, “Zacchaeus, hurry and come down; for I must stay at your house today.” So he hurried down and was happy to welcome him. Luke 19:5-6"], ["prayer", "Generous Giver, from the first moment of each day, we recognize our relationship with you. As a yoke, it is easy; as a burden, it is light. We would learn from you, Jesus, to generously receive the weary and heavy laden. Amen."]], "82": [["dateVerse", "Wednesday, March 23", "Psalm 38:1-8", "Exodus 28:15–43", "Matthew 25:31–46"], ["watchD", "The Lord is my rock, my fortress, and my deliverer. 2 Samuel 22:2"], ["docT", "Jesus said, “In this world you will have trouble. But take heart! I have overcome the world.” John 16:33 NIV"], ["prayer", "You are our rock, O God—we fear no worldly trouble. May we be swift to help and comfort the troubled, just as you do for us. May our faith demonstrate to the world that you give us the strength to weather the storms of this life, that we are in your hands. Amen."]], "83": [["dateVerse", "Thursday, March 24", "Psalm 38:9-16", "Exodus 29:1–30", "Matthew 26:1–13"], ["watchD", "I remember the days of long ago; I meditate on all your works and consider what your hands have done. Psalm 143:5 NIV"], ["docT", "Mary said, “He has helped his servant Israel, in remembrance of his mercy, according to the promise he made to our ancestors, to Abraham and to his descendants forever.” Luke 1:54-55"], ["prayer", "May memory serve, dear Lord, to bring us continuously in wonder, love, and praise before you. For all you have done, for everything you are, and, remembering such amazing things, may we know and do your will. Amen."]], "84": [["dateVerse", "Friday, March 25", "Psalm 38:17-22", "Exodus 29:31–30:16", "Matthew 26:14–30"], ["watchD", "The Lord said, “When they call to me, I will answer them.” Psalm 91:15"], ["docT", "The same Lord is Lord of all and is generous to all who call on him. Romans 10:12"], ["prayer", "Sending Savior, bless our feet with good news, and send us to preach by faithful word and loving service. May all who hear, believe—and all who believe, call on you, that they may share life in your name and perfect will. Amen."]], "85": [["dateVerse", "Saturday, March 26", "Psalm 39:1-6", "Exodus 30:17–31:11", "Matthew 26:31–35"], ["watchD", "The Lord will send his angel before you. Genesis 24:7"], ["docT", "The angel said to Peter, “Fasten your belt and put on your sandals.” He did so. Then he said to him, “Wrap your cloak around you and follow me.” Peter went out and followed him; he did not realize that what was happening with the angel’s help was real. Acts 12:8-9"], ["prayer", "God of wonders, whose holy message is carried on arms of wind and flame, whose marvelous works surround us even when unseen, let us sing aloud the praise of your help and ever-watchful care. In Jesus’ name, we pray. Amen."]], "86": [["info", "Fourth Sunday in Lent"], ["watchO", "Watchword for the week — If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["dateVerse", "Sunday, March 27", "Joshua 5:9-12", "Psalm 32", "2 Corinthians 5:16-21", "Luke 15:1-3,11b-32"], ["watchD", "Those who oppress the poor insult their Maker. Proverbs 14:31"], ["docT", "Jesus said, “Truly I tell you, just as you did it to one of the least of these who are members of my family, you did it to me.” Matthew 25:40"], ["prayer", "Jesus, dear and closest brother to all who struggle, help us get over our attitude of entitlement and fragile sense of superiority. Forgive us the insults and injuries we inflict on you by failing to love and honor our brothers and sisters in Christ. Amen."]], "87": [["dateVerse", "Monday, March 28", "Psalm 39:7-13", "Exodus 31:12–32:29", "Matthew 26:36–46"], ["watchD", "Now there was a great wind, so strong that it was splitting mountains and breaking rocks in pieces before the Lord, but the Lord was not in the wind; and after the wind an earthquake, but the Lord was not in the earthquake; and after the earthquake a fire, but the Lord was not in the fire; and after the fire a sound of sheer silence. 1 Kings 19:11-12"], ["docT", "Jesus said to Nicodemus, “Do not be astonished that I said to you, ‘You must be born from above.’ The wind blows where it chooses, and you hear the sound of it, but you do not know where it comes from or where it goes.” John 3:7-8"], ["prayer", "Life and Light and Maker of all, turn our hearts to you and to one another. Fulfill the promise of your word—the voice given to your dream—of a world radiant and running over with the knowledge of you. Amen."]], "88": [["dateVerse", "Tuesday, March 29", "Psalm 40:1-8", "Exodus 32:30–33:23", "Matthew 26:47–58"], ["watchD", "Balam said, “Must I not take care to say what the Lord puts into my mouth?” Numbers 23:12"], ["docT", "We cannot keep from speaking about what we have seen and heard. Acts 4:20"], ["prayer", "Lord and living Word, we have the right to remain silent and are free to speak. Life and death are in the power of the tongue. Hold us to a deep concern and greater care for words that ring true and full of grace. Amen."]], "89": [["dateVerse", "Wednesday, March 30", "Psalm 40:9-17", "Exodus 34", "Matthew 26:59–75"], ["watchD", "Our God turned the curse into a blessing. Nehemiah 13:2"], ["docT", "God was reconciling the world to himself in Christ, not counting people’s sins against them. And he has committed to us the message of reconciliation. 2 Corinthians 5:19 NIV"], ["prayer", "Blessed Jesus, we pray for change—real change and true transformation of our hearts and of the world we work to build every day. May your loving purposes and your holy will be done, as in heaven, so on earth and in our lives. Amen."]], "90": [["dateVerse", "Thursday, March 31", "Psalm 41", "Exodus 35", "Matthew 27:1–10"], ["watchD", "You were like a brand snatched from the fire; yet you did not return to me, says the Lord. Amos 4:11"], ["docT", "If we are faithless, he remains faithful—for he cannot deny himself. 2 Timothy 2:13"], ["prayer", "Precious Lord, make us prayerful and ready. Find us watchful and at work, hopeful, loving, and walking by faith to meet you in the faces of our neighbors and in the needs of the world. Amen."]], "91": [["dateVerse", "Friday, April 1", "Psalm 42", "Exodus 36", "Matthew 27:11–31"], ["watchD", "O Lord, open my lips, and my mouth will declare your praise. Psalm 51:15"], ["docT", "We declare to you what we have seen and heard. 1 John 1:3"], ["prayer", "Generous God, as the heavens declare your glory, the unwise whisper, “There is no god.” But you are Lord of all the earth. Come now and ignite in us a sweet stirring of praise to you. Amen."]], "92": [["dateVerse", "Saturday, April 2", "Psalm 43", "Exodus 37", "Matthew 27:32–44"], ["watchD", "So God led the people by the roundabout way of the wilderness towards the Red Sea. Exodus 13:18"], ["docT", "We know that all things work together for good for those who love God. Romans 8:28"], ["prayer", "Divine Trail-Blazer and Guide, your clear-eyed way is not always the way in which we would naturally go. May we focus on you each day so that we stay on the path to everlasting life. Amen."]], "93": [["info", "Fifth Sunday in Lent"], ["watchO", "Watchword for the week — Forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal for the prize of the heavenly call of God in Christ Jesus. Philippians 3:13,14"], ["dateVerse", "Sunday, April 3", "Isaiah 43:16-21", "Psalm 126", "Philippians 3:4b-14", "John 12:1-8"], ["watchD", "The angel of God called to Hagar from heaven, and said to her, “What troubles you, Hagar? Do not be afraid; for God has heard the voice of the boy where he is. Come, lift up the boy and hold him fast with your hand, for I will make a great nation of him.” Genesis 21:17-18"], ["docT", "Lift your drooping hands and strengthen your weak knees, and make straight paths for your feet. Hebrews 12:12-13"], ["prayer", "Merciful God, you hear the cries of the disenfranchised, abandoned, and bone-dry. In the good measure of your wondrous love, strengthen and inspire us to press onward with courage and hope for the sake of justice and peace. Amen."]], "94": [["dateVerse", "Monday, April 4", "Psalm 44:1-8", "Exodus 38", "Matthew 27:45–56"], ["watchD", "He makes me lie down in green pastures; he leads me beside still waters; he restores my soul. Psalm 23:2-3"], ["docT", "Jesus said, “My sheep hear my voice. I know them, and they follow me. I give them eternal life, and they will never perish. No one will snatch them out of my hand.” John 10:27-28"], ["prayer", "Shepherd of our souls, you search us and know us, and attend to what’s necessary ever so completely. Your steady staff nudges and nurtures, comforts and challenges. In the assurances of your pastures, help us to want nothing. Amen."]], "95": [["dateVerse", "Tuesday, April 5", "Psalm 44:9-16", "Exodus 39:1–31", "Matthew 27:57–66"], ["watchD", "They sang responsively, praising and giving thanks to the Lord, “For he is good, for his steadfast love endures forever.” Ezra 3:11"], ["docT", "When they had sung the hymn, they went out to the Mount of Olives. Mark 14:26"], ["prayer", "Steadfast Savior, prepare us for the Passion Week to come. Prepare our hearts to sing of your merciful ways, your humble walk before God, and proclaim your sacrificial act given for us and for the sins of the world. Amen."]], "96": [["dateVerse", "Wednesday, April 6", "Psalm 44:17-26", "Exodus 39:32–40:23", "Matthew 28"], ["watchD", "Who has directed the spirit of the Lord, or as his counselor has instructed him? Isaiah 40:13"], ["docT", "O the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how inscrutable his ways! Romans 11:33"], ["prayer", "Spirit of wisdom, we lay our all before you—our minds, senses, and perceptions; our hearts, emotions, and attitudes. Take us. Mold us. Make us. Use us to accomplish your holy purposes. Amen."]], "97": [["dateVerse", "Thursday, April 7", "Psalm 45:1-9", "Exodus 40:24–Leviticus 1:17", "Mark 1:1–8"], ["watchD", "God will help you, the Almighty will bless you. Genesis 49:25"], ["docT", "By this we will know that we are from the truth and will reassure our hearts before him whenever our hearts condemn us; for God is greater than our hearts, and he knows everything. 1 John 3:19-20"], ["prayer", "Almighty Love, when we spiral downward toward disbelief, help us in our unbelief. Drive our thoughts to doubt our doubts, and turn our hearts to proclaim, “Our God is bigger!” Amen."]], "98": [["dateVerse", "Friday, April 8", "Psalm 45:10-17", "Leviticus 2,3", "Mark 1:9–20"], ["watchD", "David said to Nathan, “I have sinned against the Lord.” Nathan said to David, “Now the Lord has put away your sin; you shall not die.” 2 Samuel 12:13"], ["docT", "God made you alive together with Christ, when he forgave us all our trespasses. Colossians 2:13"], ["prayer", "Gracious Lord, we thank you for forgiving our sins. At times, we forget you and become selfish and give in to our temptations. Lord, remind us that you are the one to turn to, for you are a kind and forgiving God. We pray this, in Jesus’ name. Amen."]], "99": [["dateVerse", "Saturday, April 9", "Psalm 46", "Leviticus 4", "Mark 1:21–34"], ["watchD", "The Lord is king! Let the earth rejoice; let the many coastlands be glad! Psalm 97:1"], ["docT", "The kingdom of God is not food and drink but righteousness and peace and joy in the Holy Spirit. Romans 14:17"], ["prayer", "Still small Voice, you entreat us to quiet down and know that you are God. Wherever we go or stay, help us to listen for the applause of creation and the everlasting signs of your security and peace. Amen."]], "100": [["info", "Palm Sunday"], ["watchO", "Watchword for the week — Let those who fear the Lord say, “His steadfast love endures forever.” Psalm 118:14"], ["dateVerse", "Sunday, April 10", "Isaiah 50:4-9a", "Psalm 118:1-2,19-29", "Philippians 2:5-11", "Luke 19:28-40"], ["watchD", "I will wait for the Lord, who is hiding his face from the house of Jacob. Isaiah 8:17"], ["docT", "We wait for the blessed hope and the manifestation of the glory of our great God and Savior, Jesus Christ. He it is who gave himself for us that he might redeem us from all iniquity. Titus 2:13-14"], ["prayer", "Wondrous Lord, we are stunned by your courageous entrance, your costly sacrifice, and your extraordinary love. In return, we offer palms streaming with our love and affection, our time and  treasures, our awe and all. Amen."]], "101": [["dateVerse", "Monday, April 11", "Psalm 47", "Leviticus 5:1–6:13", "Mark 1:35–45"], ["watchD", "Be strong, and let your heart take courage, all you who wait for the Lord. Psalm 31:24"], ["docT", "Through Jesus Christ we have gained access by faith into this grace in which we now stand. Romans 5:2 NIV"], ["prayer", "O God, infuse a measure of patience in us, a confident expectation of your promises. Strengthen us—body, mind, and spirit—and bring us comfort, Lord, with your unending love. Amen."]], "102": [["dateVerse", "Tuesday, April 12", "Psalm 48", "Leviticus 6:14–7:21", "Mark 2:1–12"], ["watchD", "Declare this with a shout of joy, proclaim it, send it forth to the end of the earth; say, “The Lord has redeemed his servant Jacob!” Isaiah 48:20"], ["docT", "He has rescued us from the power of darkness and transferred us into the kingdom of his beloved Son. Colossians 1:13"], ["prayer", "We are waiting, Lord, for the redemption you promise us in your word. We are just days away from the greatest display of your love for your kingdom. We must go through the darkness to see the light of hope and love that will be before us in just a few short days. May our Holy Week experience be a transformational one, where we deepen our faith in you, O Lord. We pray this in the name of the One who came before us. Amen."]], "103": [["dateVerse", "Wednesday, April 13", "Psalm 49:1-12", "Leviticus 7:22–8:17", "Mark 2:13–28"], ["watchD", "He shall be great to the ends of the earth. Micah 5:4"], ["docT", "Jesus said, “Unless a grain of wheat falls into the earth and dies, it remains just a single grain; but if it dies, it bears much fruit.” John 12:24"], ["prayer", "Father God, you are the great “I AM” who has given us your son to show us the attitude of sacrificial love—to do justice, love mercy, and walk ever so humbly before you. Amen."]], "104": [["info", "Maundy Thursday"], ["info", "Maundy Thursday — He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4"], ["dateVerse", "Thursday, April 14", "Psalm 49:13-40", "Leviticus 8:18–9:11", "Mark 3:1–12"], ["watchD", "To me every knee shall bow, every tongue shall swear. Only in the Lord, it shall be said of me, are righteousness and strength. Isaiah 45:23-24"], ["docT", "Jesus said, “I am the living bread that came down from heaven. Whoever eats of this bread will live forever.” John 6:51"], ["prayer", "Lamb of God, come and instill your merciful ways in us, so that we might love others as you have loved us. Place the towel and basin in our hands, and call us to your humble service. Amen."]], "105": [["info", "Good Friday"], ["info", "Good Friday — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["dateVerse", "Friday, April 15", "Psalm 50:1-6", "Leviticus 9:12–10:20", "Mark 3:13–19"], ["watchD", "Turn my heart to your decrees, and not to selfish gain. Psalm 119:36"], ["docT", "Jesus Christ humbled himself and became obedient to the point of death—even death on a cross. Philippians 2:8"], ["prayer", "Suffering Servant, in the dark night, be our rock, our refuge, and our strength. Assure us once again that darkness cannot overtake your eternal light. Have mercy, O Lord, on us and our offenses. Sustain us, Spirit. Amen."]], "106": [["info", "Great Sabbath "], ["dateVerse", "Saturday, April 16", "Psalm 50:7-15", "Leviticus 11:1–28", "Mark 3:20–35"], ["watchD", "Give us life, and we will call on your name. Psalm 80:18"], ["docT", "Christ Jesus abolished death and brought life and immortality to light through the gospel. 2 Timothy 1:10"], ["prayer", "Father God, resound your joyful burst of song! Hearten us in this time of waiting. Ready your church on earth to proclaim afresh the new life germinating in, and through, and all round us. Amen."]], "107": [["info", "Easter"], ["watchO", "Watchword for the week — Why do you look for the living among the dead? Jesus is not here, but has risen. Luke 24:5"], ["dateVerse", "Sunday, April 17", "Acts 10:34-43", "Psalm 118:1-2,14-24", "1 Corinthians 15:19-26", "Luke 24:1-12"], ["watchD", "When David’s time to die drew near, he charged his son Solomon, saying: “I am about to go the way of all the earth. Be strong and keep the charge of the Lord your God.” 1 Kings 2:1-2.3"], ["docT", "Jesus, the risen Lord, said, “Peace be with you. As the Father has sent me, so I send you.” John 20:21"], ["prayer", "Glorious God! You revealed the emptiness of the tomb to all of the created order. Alleluia! We rejoice in the precious and holy gift of your presence forever and ever through our risen Lord and Savior, Jesus Christ. Amen."]], "108": [["dateVerse", "Easter Monday Monday, April 18", "Psalm 50:16-23", "Leviticus 11:29–13:8", "Mark 4:1–20"], ["watchD", "May your eyes be open toward this temple night and day, this place of which you said, ‘My name shall be there.’ 1 Kings 8:29 NIV"], ["docT", "When it was evening on that day, the first day of the week, and the doors of the house where the disciples had met were locked for fear of the Jews, Jesus came and stood among them and said, “Peace be with you.” John 20:19"], ["prayer", "Christ Jesus, as we enter wildernesses of fear, selfishness, and domination, keep us focused on your holy will and our call to share the Good News. Steady us and ready us to be directed toward the path of peace. Amen."]], "109": [["dateVerse", "Tuesday, April 19", "Psalm 51:1-6", "Leviticus 13:9–46", "Mark 4:21–29"], ["watchD", "I stretch out my hands to you; my soul thirsts for you like a parched land. Psalm 143:6"], ["docT", "Let everyone who is thirsty come. Let anyone who wishes take the water of life as a gift. Revelation 22:17"], ["prayer", "Living Water, fountain of life, flowing stream, buoy our vessels. May your blessings equip us to be “agents of your transforming love in the world… through spiritual growth, community, and mission.” Amen."]], "110": [["dateVerse", "Wednesday, April 20", "Psalm 51:7-12", "Leviticus 13:47–14:18", "Mark 4:30–41"], ["watchD", "He who scattered Israel will gather them and will watch over his flock like a shepherd. Jeremiah 31:10 NIV"], ["docT", "Jesus prayed, “I ask not only on behalf of these, but also on behalf of those who will believe in me through their word, that they may all be one.” John 17:20-21"], ["prayer", "Christ Jesus, how often have you gathered us together “as a mother hen gathers her brood under her wings?” How often have you given us the vision of the great throng surrounding God’s throne? Thank you for your persistence. Amen."]], "111": [["dateVerse", "Thursday, April 21", "Psalm 51:13-19", "Leviticus 14:19–57", "Mark 5:1–20"], ["watchD", "Hate evil and love good, and establish justice in the gate; it may be that the Lord, the God of hosts, will be gracious. Amos 5:15"], ["docT", "Live as children of light—for the fruit of the light is found in all that is good and right and true. Ephesians 5:8-9"], ["prayer", "Lord of hosts, when the difference between right and wrong becomes unclear, bring to light the injustices that keep us from a true and heartfelt worship of you. Amen."]], "112": [["dateVerse", "Friday, April 22", "Psalm 52", "Leviticus 15:1–24", "Mark 5:21–43"], ["watchD", "Now begin the work, and the Lord be with you. 1 Chronicles 22:16"], ["docT", "With great power the apostles gave their testimony to the resurrection of the Lord Jesus, and great grace was upon them all. Acts 4:33"], ["prayer", "Creator and Renewer, the earth is yours and all within it. Lead us to fallow ground where we may cultivate varieties of resurrection gardens for the sake of creation. Amen."]], "113": [["dateVerse", "Saturday, April 23", "Psalm 53", "Leviticus 15:25–16:25", "Mark 6:1–6"], ["watchD", "You shall be like a watered garden, like a spring of water, whose waters never fail. Isaiah 58:11"], ["docT", "Jesus said, “Those who drink of the water that I will give them will never be thirsty. The water that I will give will become in them a spring of water gushing up to eternal life.” John 4:14"], ["prayer", "God of abundance, we thank you for your promise of eternal life. We know we will never thirst, for you supply us with an unending spring of water. Amen."]], "114": [["info", "Second Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Peace be with you. As the Father has sent me, so I send you.” John 20:21"], ["dateVerse", "Sunday, April 24", "Acts 5:27-32", "Psalm 150", "Revelation 1:4-8", "John 20:19-31"], ["watchD", "I will rejoice in the Lord; I will exult in the God of my salvation. Habakkuk 3:18"], ["docT", "Rejoice that your names are written in heaven. Luke 10:20"], ["prayer", "Faithful God, trouble is all around—shadows in the valleys and movement on the periphery. Lord, let us hear your voice! Help us delight in recounting the times you have guided us to trusted people and places. Amen."]], "115": [["dateVerse", "Monday, April 25", "Psalm 54", "Leviticus 16:26–18:5", "Mark 6:7–13"], ["watchD", "Let the heavens be glad, and let the earth rejoice, and let them say among the nations, “The Lord is king!” 1 Chronicles 16:31"], ["docT", "Jesus said, “All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything that I have commanded you.” Matthew 28:18-20"], ["prayer", "Gracious Lord and God, “…keep your bishops and ministers sound in doctrine and holy in life. May everyone who serves the church be faithful, not only in great matters, but also in the smallest  things…to our life’s end.” Amen."]], "116": [["dateVerse", "Tuesday, April 26", "Psalm 55:1-8", "Leviticus 18:6–19:11", "Mark 6:14–29"], ["watchD", "Who can live and never see death? Who can escape the power of Sheol? Psalm 89:48"], ["docT", "The wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord. Romans 6:23"], ["prayer", "O God, in what ways can we do more of what you want than what we want? Rather than doing what is right in our own eyes, lead us to be an answer to this prayer, for Jesus’ sake. Amen."]], "117": [["dateVerse", "Wednesday, April 27", "Psalm 55:9-15", "Leviticus 19:12–20:8", "Mark 6:30–44"], ["watchD", "Hold fast to the Lord your God, as you have done to this day. Joshua 23:8"], ["docT", "Not that we are competent of ourselves to claim anything as coming from us; our competence is from God. 2 Corinthians 3:5"], ["prayer", "Lord God, you have called us “in faith to serve humanity by proclaiming the gospel of Jesus Christ.” Today, we pledge to turn to you anew as “the source of our being and the inspiration of our service.” Amen."]], "118": [["dateVerse", "Thursday, April 28", "Psalm 55:16-19", "Leviticus 20:9–21:12", "Mark 6:45–56"], ["watchD", "The Lord shall arbitrate for many peoples; they shall beat their swords into plowshares, and their spears into pruning-hooks. Isaiah 2:4"], ["docT", "You know the message he sent to the people of Israel, preaching peace by Jesus Christ—he is Lord of all. Acts 10:36"], ["prayer", "Lord Christ, in the intimacy of this prayer, show us the prejudice we harbor in our hearts. Lord, what are you asking us to do in response to this revelation? Amen."]], "119": [["dateVerse", "Friday, April 29", "Psalm 55:20-23", "Leviticus 21:13–22:16", "Mark 7:1–8"], ["watchD", "Do not devise evil in your hearts against one another, and love no false oath; for all these are things that I hate, says the Lord. Zechariah 8:17"], ["docT", "Be kind to one another, tenderhearted, forgiving one another, as God in Christ has forgiven you. Ephesians 4:32"], ["prayer", "Friend to sinners, forgive us our trespasses as we forgive the trespasses of others. Bring forth a full measure of your peace—“pressed down, shaken together, running over”—refreshing, reviving, and restoring. Amen."]], "120": [["dateVerse", "Saturday, April 30", "Psalm 56:1-8", "Leviticus 22:17–23:22", "Mark 7:9–23"], ["watchD", "The Lord said to Moses, “You have found favor in my sight, and I know you by name.” Exodus 33:17"], ["docT", "Jesus said: “I am the good shepherd. I know my own and my own know me.” John 10:14"], ["prayer", "Lord, our way, our truth, our life, thank you for the gift of your presence! Thank you for the fellowship we share with one another as “we live and move and have our being” in you. Amen."]], "121": [["info", "Third Sunday of Easter"], ["watchO", "Watchword for the week — Worthy is the Lamb that was slain to receive power and wealth and wisdom and might and honor and glory and blessing! Revelation 5:12"], ["dateVerse", "Sunday, May 1", "Acts 9:1-6,(7-20)", "Psalm 30", "Revelation 5:11-14", "John 21:1-19"], ["watchD", "For as the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts. Isaiah 55:9"], ["docT", "We know only in part, and we prophesy only in part; but when the complete comes, the partial will come to an end. 1 Corinthians 13:9-10"], ["prayer", "Heavenly God, although we cannot understand everything that you do, nor everything that you are, guide us to emulate your ways. We are an imperfect people, but we can set our eyes and hearts on you. Amen."]], "122": [["dateVerse", "Monday, May 2", "Psalm 56:9-13", "Leviticus 23:23–24:9", "Mark 7:24–37"], ["watchD", "O Lord, you have plans formed of old, faithful and sure. Isaiah 25:1"], ["docT", "God destined us for adoption as his children through Jesus Christ, according to the good pleasure of his will. Ephesians 1:5"], ["prayer", "Almighty Father, we are grateful for our place in our Christian family. Lord, help us to welcome all of our brothers and sisters in Christ, especially to those who are lonely, disenfranchised, and in need of your presence on earth. Amen."]], "123": [["dateVerse", "Tuesday, May 3", "Psalm 57:1-6", "Leviticus 24:10–25:17", "Mark 8:1–13"], ["watchD", "Sing to the Lord a new song, his praise from the end of the earth! Isaiah 42:10"], ["docT", "Do not move from the hope held out in the gospel. This is the gospel that you heard and that has been proclaimed to every creature under heaven. Colossians 1:23 NIV"], ["prayer", "Holy Redeemer, thank you for the gift of your son, Jesus Christ. May we worship you with pure and grateful hearts. Lead us to place our faith, love, and hope in you. Amen."]], "124": [["dateVerse", "Wednesday, May 4", "Psalm 57:7-11", "Leviticus 25:18–55", "Mark 8:14–21"], ["watchD", "Behold, children are a gift of the Lord. Psalm 127:3 NASB"], ["docT", "Jesus took a little child and put it among them; and taking it in his arms, he said to them, “Whoever welcomes one such child in my name welcomes me, and whoever welcomes me welcomes not me but the one who sent me.” Mark 9:36-37"], ["prayer", "Dearest Lord, the sounds of new life in our church and in our families bring us joy and the weight of responsibility. Help us to welcome all of your children into our hearts as you welcome us into your heart. Amen."]], "125": [["dateVerse", "Thursday, May 5", "Psalm 58", "Leviticus 26:1–35", "Mark 8:22–38"], ["watchD", "I am the Lord, I have called you in righteousness, I have taken you by the hand and kept you. Isaiah 42:6"], ["docT", "In Christ Jesus our Lord, we have access to God in boldness. Ephesians 3:12"], ["prayer", "Righteous Lord, we truly appreciate the power of prayer. Open our ears to listen to your call to go into the world and share your love. Help us to be bold for you. Amen."]], "126": [["dateVerse", "Friday, May 6", "Psalm 59:1-9", "Leviticus 26:36–27:15", "Mark 9:1–10"], ["watchD", "God will bring every deed into judgment, including every secret thing, whether good or evil. Ecclesiastes 12:14"], ["docT", "Each of us will be accountable to God. Let us therefore no longer pass judgment on one another. Romans 14:12-13"], ["prayer", "Holy Judge, we are an imperfect people, prone to sin and error. Thank you for sending your son to wash away our iniquities. Make our hearts free of judgement toward others. Amen."]], "127": [["dateVerse", "Saturday, May 7", "Psalm 59:10-17", "Leviticus 27:16–Numbers 1:16", "Mark 9:11–29"], ["watchD", "Lord, save us! Lord, grant us success! Psalm 118:25 NIV"], ["docT", "May the God of peace make you complete in everything good so that you may do his will. Hebrews 13:20,21"], ["prayer", "Perfect Leader, your disciples desire to do your will. We want to serve you through service to others. Lead us to do your work on earth. Allow us to hear your command, so that we can share your love with those who do not yet know it. Amen."]], "128": [["info", "Fourth Sunday of Easter"], ["watchO", "Watchword for the week — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Sunday, May 8", "Acts 9:36-43", "Psalm 23", "Revelation 7:9-17", "John 10:22-30"], ["watchD", "I will lead the blind by a road they do not know, by paths they have not known I will guide them. Isaiah 42:16"], ["docT", "God called you out of darkness into his marvelous light. 1 Peter 2:9"], ["prayer", "Awesome God, without Christ, we would be trapped in the dark. Thank you for bringing light into the darkness of earth. When we feel like the darkness envelops us, remind us that you are always with us. Amen."]], "129": [["dateVerse", "Monday, May 9", "Psalm 60", "Numbers 1:17–54", "Mark 9:30–37"], ["watchD", "The Lord is righteous, He loves righteousness. Psalm 11:7 NKJV"], ["docT", "Be renewed in the spirit of your minds, and clothe yourselves with the new self, created according to the likeness of God in true righteousness and holiness. Ephesians 4:23-24"], ["prayer", "Righteous Savior, through Christ’s sacrifice, we are cleansed of our sins. We can look to his actions and words and model our lives on his example. Help us to discern the righteous path through our study of scripture. Amen."]], "130": [["dateVerse", "Tuesday, May 10", "Psalm 61", "Numbers 2", "Mark 9:38–50"], ["watchD", "No longer shall they teach one another, or say to each other, “Know the Lord”, for they shall all know me, from the least of them to the greatest, says the Lord. Jeremiah 31:34"], ["docT", "Then they said to him, “What must we do to perform the works of God?” Jesus answered them, “This is the work of God, that you believe in him whom he has sent.” John 6:28-29"], ["prayer", "True God, we believe in the Father, the Son, and the Holy Spirit. We want to know you better and to have a closer relationship with you. Quiet our hearts so we can be with you in the stillness and hear your word. Amen."]], "131": [["dateVerse", "Wednesday, May 11", "Psalm 62", "Numbers 3:1–32", "Mark 10:1–12"], ["watchD", "The Lord was with Samuel and let none of his words fall to the ground. 1 Samuel 3:19"], ["docT", "Jesus said, “Whoever listens to you listens to me.” Luke 10:16"], ["prayer", "Holy Lord, our actions are your voice in this noisy world. We reflect your love, so that others will know your word. We pray that you will help direct our deeds to your purpose. Amen."]], "132": [["dateVerse", "Thursday, May 12", "Psalm 63", "Numbers 3:33–4:14", "Mark 10:13–31"], ["watchD", "You have granted me life and steadfast love, and your care has preserved my spirit. Job 10:12"], ["docT", "You have heard of the endurance of Job, and you have seen the purpose of the Lord, how the Lord is compassionate and merciful. James 5:11"], ["prayer", "Compassionate Father, thank you for holding us in your arms when we are in pain. Although we cannot avoid suffering in this life, we are comforted by your presence. Remind us to lean on you when we feel lost. Amen."]], "133": [["dateVerse", "Friday, May 13", "Psalm 64", "Numbers 4:15–49", "Mark 10:32–45"], ["watchD", "O Lord my God, I cried to you for help, and you have healed me. Psalm 30:2"], ["docT", "Jesus said to him, “Go home to your friends, and tell them how much the Lord has done for you, and what mercy he has shown you.” Mark 5:19"], ["prayer", "Divine Healer, you listen to our prayers when we are hurting. Sometimes it is hard to listen to your voice amidst our fears and anxieties. Open our ears and our hearts to your response, and accept our grateful praise. Amen."]], "134": [["dateVerse", "Saturday, May 14", "Psalm 65:1-8", "Numbers 5", "Mark 10:46–52"], ["watchD", "The Lord’s mercies never come to an end, they are new every morning, great is your faithfulness. Lamentations 3:22-23"], ["docT", "So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 2 Corinthians 4:16"], ["prayer", "Heavenly Father, every day, we make choices that do not reflect our calling as Christians. We need your constant compassion and forgiveness so that we can live faithfully and abundantly. Thank you for purifying our hearts and souls. Amen."]], "135": [["info", "Fifth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “I am the Alpha and the Omega, the beginning and the end. To the thirsty I will give water as a gift from the spring of the water of life.” Revelation 21:6"], ["dateVerse", "Sunday, May 15", "Acts 11:1-18", "Psalm 148", "Revelation 21:1-6", "John 13:31-35"], ["watchD", "Everyone who calls on the name of the Lord shall be saved. Joel 2:32"], ["docT", "Peter said about Jesus, “There is salvation in no one else, for there is no other name under heaven given among mortals by which we must be saved.” Acts 4:12"], ["prayer", "Eternal Savior, sometimes we feel adrift in life, drowning in sorrow. We look to you for rescue and deliverance when the waves get too high. We need your steady arms to hold us and provide us with comfort. Amen."]], "136": [["dateVerse", "Monday, May 16", "Psalm 65:9-13", "Numbers 6", "Mark 11:1–11"], ["watchD", "When Job’s three friends heard of all these troubles that had come upon him, they sat with him on the ground for seven days and seven nights, and no one spoke a word to him, for they saw that his suffering was very great. Job 2:11,13"], ["docT", "Bear one another’s burdens, and in this way you will fulfill the law of Christ. Galatians 6:2"], ["prayer", "Greatest Lord, thank you for our friends who are here on the earth to lessen our burdens and increase our joy. May we be friends to others when they need a shoulder to cry on or a smile of celebration. Amen."]], "137": [["dateVerse", "Tuesday, May 17", "Psalm 66:1-7", "Numbers 7:1–35", "Mark 11:12–26"], ["watchD", "The Lord is wonderful in counsel and excellent in wisdom. Isaiah 28:29"], ["docT", "Christ came and proclaimed peace to you who were far off and peace to those who were near. Ephesians 2:17"], ["prayer", "Prince of peace, two thousand years ago, your arrival brought peace to a violent world. When we get caught up in the hostility of our present-day world, calm our hearts. We want to focus on the serenity and goodwill in our lives. Amen."]], "138": [["dateVerse", "Wednesday, May 18", "Psalm 66:8-15", "Numbers 7:36–71", "Mark 11:27–12:12"], ["watchD", "The pillars of the earth are the Lord’s, and on them he has set the world. 1 Samuel 2:8"], ["docT", "In the beginning was the Word, and the Word was with God, and the Word was God. John 1:1"], ["prayer", "Creator God, we praise you for the creation of our beautiful world. Thank you for loving us so much that you gave your son, Jesus Christ. Hear our gratitude, and may it be good to your ears. Amen."]], "139": [["dateVerse", "Thursday, May 19", "Psalm 66:16-20", "Numbers 7:72–8:4", "Mark 12:13–17"], ["watchD", "Has God forgotten to be gracious? Has he in anger shut up his compassion? Psalm 77:9"], ["docT", "Where sin increased, grace abounded all the more. Romans 5:20"], ["prayer", "Forgiving God, our hearts are filled with gratitude because you will always forgive us when we stray from you. All we need to do is pray and ask for your forgiveness. Your constant grace is a beacon of light in a world that is so often filled with darkness. Amen."]], "140": [["dateVerse", "Friday, May 20", "Psalm 67", "Numbers 8:5–9:14", "Mark 12:18–34"], ["watchD", "My iniquities have gone over my head; they weigh like a burden too heavy for me. Psalm 38:4"], ["docT", "Christ canceled the unfavorable record of our debts with its binding rules and did away with it completely by nailing it to the cross. Colossians 2:14 GNT"], ["prayer", "Blameless God, thank you for lessening our burden by removing the weight of sin from our lives. When we feel overwhelmed by sin, remind us that we can reach out to you in prayer. Lifting up our troubles to you will always lighten our hearts. Amen."]], "141": [["dateVerse", "Saturday, May 21", "Psalm 68:1-6", "Numbers 9:15–10:36", "Mark 12:35–44"], ["watchD", "Whoever loves money never has enough; whoever loves wealth is never satisfied with their income. Ecclesiastes 5:10 NIV"], ["docT", "If we have food and clothing, we will be content with these. But those who want to be rich fall into temptation and are trapped by many senseless and harmful desires. 1 Timothy 6:8-9"], ["prayer", "Dearest Lord, our hearts often desire earthly treasures rather than heavenly riches. We choose to gather wealth instead of giving our resources freely. Help us to let go of material gains and share what we have with our neighbors. Amen."]], "142": [["info", "Sixth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Peace I leave with you; my peace I give to you.” John 14:27"], ["dateVerse", "Sunday, May 22", "Acts 16:9-15", "Psalm 67", "Revelation 21:10,22-22:5", "John 14:23-29"], ["watchD", "I will bring them through the fire, will refine them as silver is refined, and test them as gold is tested. They will call on my name, and I will answer them. Zechariah 13:9 NKJV"], ["docT", "In this you rejoice, even if now for a little while you have had to suffer various trials, so that the genuineness of your faith—being more precious than gold that, though perishable, is tested by fire—may be found to result in praise and glory and honor when Jesus Christ is revealed. 1 Peter 1:6-7"], ["prayer", "Loving God, we ask that you hold our hands as we go through trials and temptations. We need your guidance to help us walk through ordeals and troubles that are so common in our lives. Through you, we can do this. Amen."]], "143": [["dateVerse", "Monday, May 23", "Psalm 68:7-18", "Numbers 11", "Mark 13:1–13"], ["watchD", "Sing aloud to God our strength. Psalm 81:1"], ["docT", "As servants of God we have commended ourselves in every way: as sorrowful, yet always rejoicing; as poor, yet making many rich; as having nothing, and yet possessing everything. 2 Corinthians 6:4,10"], ["prayer", "Almighty God, when we walk through life’s hills and valleys, keep our eyes fixed on you and on your word. We can see your might and power when overcoming difficulties through your love and support. Amen."]], "144": [["dateVerse", "Tuesday, May 24", "Psalm 68:19-27", "Numbers 12:1–13:16", "Mark 13:14–27"], ["watchD", "Do not be exceedingly angry, O Lord, and do not remember iniquity forever. Now consider we are all your people. Isaiah 64:9"], ["docT", "My little children, I am writing these things to you so that you may not sin. But if anyone does sin, we have an advocate with the Father, Jesus Christ the righteous. 1 John 2:1"], ["prayer", "Savior Jesus, we try so hard to follow your teachings, but we so often fall short of your commands. We pray to you for forgiveness, so that we may regain our close relationship with you. We thank you for the Holy Spirit who advocates for us sinners. Amen."]], "145": [["dateVerse", "Wednesday, May 25", "Psalm 68:28-35", "Numbers 13:17–33", "Mark 13:28–37"], ["watchD", "Yours, O Lord, are the greatness, the power, the glory, the victory, and the majesty; for all that is in the heavens and on the earth is yours. 1 Chronicles 29:11"], ["docT", "There is one God; there is also one mediator between God and humankind, Christ Jesus, himself human, who gave himself a ransom for all. 1 Timothy 2:5-6"], ["prayer", "Majestic Lord, we worship you with our voices raised for the creation of our world. In your infinite wisdom, you gave your only son to us, an imperfect and sinful people. Through Christ, we are reconciled to you. Amen."]], "146": [["info", "Ascension Day"], ["watchO", "Watchword for Ascension Day — Christ said, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32"], ["specialVerse", "Ascension of the Lord", "Acts 1:1-11", "Psalm 47", "Ephesians 1:15-23", "Luke 24:44-53"], ["dateVerse", "Thursday, May 26", "Psalm 69:1-12", "Numbers 14", "Mark 14:1–11"], ["watchD", "Those who are planted in the house of the Lord shall flourish in the courts of our God. They shall still bear fruit in old age; they shall be fresh and flourishing. Psalm 92:13-14 NKJV"], ["docT", "Jesus said, “I will see you again, and your hearts will rejoice, and no one will take your joy from you.” John 16:22"], ["prayer", "Christ Jesus, as we celebrate your ascension into heaven, we give thanks for the sacrifice of your life for the forgiveness of our sins. May our lives be reflections of the love that you have for us. Amen."]], "147": [["dateVerse", "Friday, May 27", "Psalm 69:13-21", "Numbers 15:1–31", "Mark 14:12–31"], ["watchD", "Go, and may the Lord be with you! 1 Samuel 17:37"], ["docT", "Whoever serves must do so with the strength that God supplies. 1 Peter 4:11"], ["prayer", "Gracious God, our hearts yearn to follow you and to do your will. Open our ears so that we can recognize the opportunities for service in our local and worldwide communities. We find the strength for service to others through our relationship with you. Amen."]], "148": [["dateVerse", "Saturday, May 28", "Psalm 69:22-29", "Numbers 15:32–16:27", "Mark 14:32–42"], ["watchD", "Do not put your trust in princes, in mortals, in whom there is no help. Psalm 146:3"], ["docT", "Jesus Christ, the faithful witness, the firstborn of the dead, and the ruler of the kings of the earth. Revelation 1:5"], ["prayer", "Constant God, when we are afraid and lonely, help us remember to place all of our trust in you. You walk with us on every path we tread. Thank you for your endless presence in our lives. Amen."]], "149": [["info", "Ascension of the Lord"], ["watchO", "Watchword for the week — Rejoice in the Lord, O you righteous, and give thanks to his holy name! Psalm 97:12"], ["dateVerse", "Sunday, May 29", "Acts 16:16-34", "Psalm 97", "Revelation 22:12-14,16-17,20-21", "John 17:20-26"], ["watchD", "Solomon said, “Even heaven and the highest heaven cannot contain you, much less this house that I have built!” 1 Kings 8:27"], ["docT", "No one has ever seen God; if we love one another, God lives in us, and his love is perfected in us. 1 John 4:12"], ["prayer", "Loving God, your church on earth is so much more than a collection of buildings; it is a collection of souls, united in love for Christ and for each other. Lead us to be more perfect followers for you. Amen."]], "150": [["dateVerse", "Monday, May 30", "Psalm 69:30-36", "Numbers 16:28–17:13", "Mark 14:43–52"], ["watchD", "I am poor and needy, but the Lord takes thought for me. Psalm 40:17"], ["docT", "Hope does not disappoint us. Romans 5:5"], ["prayer", "Dearest Lord Jesus, your people are unworthy of your perfect love, but we receive forgiveness through your sacrifice. Through you, we have hope that we will fulfill your purpose here on earth: to love others as you love us. Amen."]], "151": [["dateVerse", "Tuesday, May 31", "Psalm 70", "Numbers 18:1–24", "Mark 14:53–65"], ["watchD", "Remember me, O Lord, when you show favor to your people; help me when you deliver them. Psalm 106:4"], ["docT", "Each of us was given grace according to the measure of Christ’s gift. Ephesians 4:7"], ["prayer", "Divine Redeemer, we only receive grace and forgiveness due to the death of Christ, our blameless savior. Help us to be ever-thankful for his sacrifice and the mercy that you give us because of him. May our good deeds show our gratitude. Amen."]], "152": [["dateVerse", "Wednesday, June 1", "Psalm 71:1-8", "Numbers 18:25–19:22", "Mark 14:66–72"], ["watchD", "The Lord judges the peoples. Psalm 7:8"], ["docT", "All of us must appear before the judgment seat of Christ, so that each may receive recompense for what has been done in the body, whether good or evil. 2 Corinthians 5:10"], ["prayer", "Merciful God, search us, and remove from our lives everything that would seek to prevent us from living in unity with you and with each other, so that when we stand before your judgement seat, we will be found faithful. This we pray, in Jesus’ name. Amen."]], "153": [["dateVerse", "Thursday, June 2", "Psalm 71:9-18a", "Numbers 20:1–21:9", "Mark 15:1–20"], ["watchD", "The Lord has been mindful of us; he will bless us. Psalm 115:12"], ["docT", "What do you have that you did not receive? 1 Corinthians 4:7"], ["prayer", "Loving God, you have demonstrated your unconditional love, faithfulness, and care for humanity through the giving of yourself. May we ever be conscious of the reality that all our blessings come from your hands. Amen."]], "154": [["dateVerse", "Friday, June 3", "Psalm 71:18b-24", "Numbers 21:10–22:6", "Mark 15:21–32"], ["watchD", "Those who bring thanksgiving as their sacrifice honor me; to those who go the right way I will show the salvation of God. Psalm 50:23"], ["docT", "Keep your roots deep in Christ Jesus, build your lives on him, and become stronger in your faith, as you were taught. And be filled with thanksgiving. Colossians 2:7 GNT"], ["prayer", "Lord, we look to you for our salvation as we give thanks for your mighty works in our lives. May we be rooted in Christ, praising you for all that you have done for us. We do this faithfully in Jesus’ name. Amen."]], "155": [["dateVerse", "Saturday, June 4", "Psalm 72:1-11", "Numbers 22:7–41", "Mark 15:33–47"], ["watchD", "The Lord went in front of them in a pillar of cloud by day, to lead them along the way, and in a pillar of fire by night, to give them light. Exodus 13:21"], ["docT", "Whatever was written in former days was written for our instruction, so that by steadfastness and by the encouragement of the scriptures we might have hope. Romans 15:4"], ["prayer", "Gracious God, you continue to lead your people through the various stages and challenges of life. It is our prayer that we remain anchored in hope and steadfast in the studying of your word. Amen."]], "156": [["info", "Day of Pentecost"], ["watchO", "Watchword for the week — For all who are led by the Spirit of God are children of God. Romans 8:14"], ["dateVerse", "Sunday, June 5", "Acts 2:1-21", "Psalm 104:24-34,35b", "Romans 8:14-17", "John 14:8-17,(25-27)"], ["watchD", "My flesh and my heart may fail, but God is the strength of my heart and my portion forever. Psalm 73:26"], ["docT", "We ourselves, who have the first fruits of the spirit, groan inwardly while we wait for adoption, the redemption of our bodies. For in hope we were saved. Romans 8:23-24"], ["prayer", "Omniscient Father, you created us with all our emotions. We find joy in knowing that you can relate to us and that you understand our inner groans. Teach us to wait upon you patiently, prayerfully, and purposefully. This we ask, in Jesus’ name. Amen."]], "157": [["dateVerse", "Monday, June 6", "Psalm 72:12-20", "Numbers 23", "Mark 16:1–13"], ["watchD", "The Lord searches every mind, and understands every plan and thought. 1 Chronicles 28:9"], ["docT", "By this we know that we abide in him and he in us, because he has given us of his Spirit. 1 John 4:13"], ["prayer", "Gracious God, our inner thoughts are known by you. May your Holy Spirit consume every selfish desire. Direct our every thought, which so often turns into action, so you will be glorified in and through us. Amen."]], "158": [["dateVerse", "Tuesday, June 7", "Psalm 73:1-12", "Numbers 24,25", "Mark 16:14–Luke 1:4"], ["watchD", "Serve the Lord with all your heart; and do not turn aside after useless things that cannot profit or save, for they are useless. 1 Samuel 12:20-21"], ["docT", "Whoever serves me must follow me, and where I am, there will my servant be also. John 12:26"], ["prayer", "Sustaining God, it is in you we live, move, and have our being. Keep our minds focused on you and keep our feeble feet from slipping. Lord, help us to understand that it is through service to others that we serve you. Amen."]], "159": [["dateVerse", "Wednesday, June 8", "Psalm 73:13-20", "Numbers 26:1–25", "Luke 1:5–25"], ["watchD", "The Lord makes poor and makes rich; he brings low, he also exalts. 1 Samuel 2:7"], ["docT", "As believers in our Lord Jesus Christ, the Lord of glory, you must never treat people in different ways according to their outward appearance. James 2:1 GNT"], ["prayer", "Creator God, although humanity’s colors and features look different, you have created us in your image to embrace, love, and serve each other. Help us to accept, love, and care for each other as you care for us. Amen."]], "160": [["dateVerse", "Thursday, June 9", "Psalm 73:21-28", "Numbers 26:26–56", "Luke 1:26–38"], ["watchD", "If you do well, will you not be accepted? And if you do not do well, sin is lurking at the door; its desire is for you, but you must master it. Genesis 4:7"], ["docT", "For freedom Christ has set us free. Galatians 5:1"], ["prayer", "Reconciling God, through your death, burial, resurrection, and ascension, you have liberated humanity from sin’s destruction. May we forever walk in the liberty of Christ, recognizing that who the Son sets free is free indeed. Amen."]], "161": [["dateVerse", "Friday, June 10", "Psalm 74:1-9", "Numbers 26:57–27:23", "Luke 1:39–45"], ["watchD", "A soft answer turns away wrath, but a harsh word stirs up anger. Proverbs 15:1"], ["docT", "Do not let the sun go down on your anger, and do not make room for the devil. Ephesians 4:26-27"], ["prayer", "Lord, let our words be seasoned with grace, so that whenever and whatever words we speak will heal and not hurt. Amen."]], "162": [["dateVerse", "Saturday, June 11", "Psalm 74:10-17", "Numbers 28:1–29:6", "Luke 1:46–56"], ["watchD", "In days to come, nation shall not lift up sword against nation, neither shall they learn war anymore. Isaiah 2:2,4"], ["docT", "The soldiers asked John, saying, “And what shall we do?” So he said to them, “Do not intimidate anyone or accuse falsely, and be content with your wages.” Luke 3:14 NKJV"], ["prayer", "Gracious God, we confess that we have been selfish and self-centered in our interaction with those we considered different from us. Please forgive us and open our spiritual eyes, so that we are able to see others through the eyes of Christ. Amen."]], "163": [["info", "Trinity Sunday"], ["watchO", "Watchword for the week — Since we are justified by faith, we have peace with God through our Lord Jesus Christ. Romans 5:1"], ["dateVerse", "Sunday, June 12", "Proverbs 8:1-4,22-31", "Psalm 8", "Romans 5:1-5", "John 16:12-15"], ["watchD", "You shall not follow a majority in wrongdoing. Exodus 23:2"], ["docT", "Speaking the truth in love, we must grow up in every way into him who is the head, into Christ. Ephesians 4:15"], ["prayer", "Redeeming God, bind us to your side, and keep our eyes and hearts steadfast on you as we seek to live in the fulness of your grace. Amen."]], "164": [["dateVerse", "Monday, June 13", "Psalm 74:18-23", "Numbers 29:7–40", "Luke 1:57–66"], ["watchD", "By awesome deeds you answer us in righteousness, O God of our salvation. Psalm 65:5 NASB"], ["docT", "Jesus said, “If in my name you ask me for anything, I will do it.” John 14:14"], ["prayer", "Eternal God, you are our source, and we rest completely in you. Lord, it gives us joy in knowing that you answer our prayers that are prayed in Jesus’ name. We thank you that there is power and authority in the wonderful name of Jesus. Amen."]], "165": [["dateVerse", "Tuesday, June 14", "Psalm 75", "Numbers 30:1–31:12", "Luke 1:67–80"], ["watchD", "Unless the Lord guards the city, the guard keeps watch in vain. Psalm 127:1"], ["docT", "I am confident of this, that the one who began a good work among you will bring it to completion by the day of Jesus Christ. Philippians 1:6"], ["prayer", "Sovereign God, you are the guardian of our souls. We thank you for the confidence we have in you, and for the assurance that you will fulfill your good and perfect will in our lives. We give you honor, glory, and praise. Amen."]], "166": [["dateVerse", "Wednesday, June 15", "Psalm 76", "Numbers 31:13–47", "Luke 2:1–20"], ["watchD", "The Lord will keep your going out and your coming in from this time on and forevermore. Psalm 121:8"], ["docT", "The Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3"], ["prayer", "Faithful God, in you we find strength and protection. We rejoice in the reality that the enemy cannot defeat us because we are constantly guarded by you. We truly thank you for your encompassing greatness and love towards us. Amen."]], "167": [["dateVerse", "Thursday, June 16", "Psalm 77:1-9", "Numbers 31:48–32:27", "Luke 2:21–32"], ["watchD", "You shall worship the Lord your God, and he will bless your bread and your water. Exodus 23:25"], ["docT", "Therefore do not worry, saying, ‘What will we eat?’ or ‘What will we drink?’ or ‘What will we wear?’ Your heavenly Father knows that you need all these things. Matthew 6:31,32"], ["prayer", "Indeed, God, you are our provider. We confess our dependence upon you for sustenance, both physical and spiritual. When we become overwhelmed, remind us that you know our needs and will always make provision for us. May our hearts be constantly filled with thankful praise. Amen."]], "168": [["dateVerse", "Friday, June 17", "Psalm 77:10-15", "Numbers 32:28–42", "Luke 2:33–40"], ["watchD", "O Lord my God, you are very great. You are clothed with honor and majesty, wrapped in light as with a garment. Psalm 104:1-2"], ["docT", "You may proclaim the mighty acts of him who called you out of darkness into his marvelous light. 1 Peter 2:9"], ["prayer", "God, through your precious son, you have called us out of darkness into your marvelous light. Inspire us to shine our light in the darkest places, so that others may find their way to you. May you be glorified in and through us. Amen."]], "169": [["dateVerse", "Saturday, June 18", "Psalm 77:16-20", "Numbers 33", "Luke 2:41–52"], ["watchD", "He satisfies the thirsty, and the hungry he fills with good things. Psalm 107:9"], ["docT", "My God will fully satisfy every need of yours according to his riches in glory in Christ Jesus. Philippians 4:19"], ["prayer", "All-sufficient God, may your people come to the full realization that you are more than enough. When we are hungry and thirsty, help us to draw from you, the source of all good things. We love you Lord. Amen."]], "170": [["info", "Second Sunday after Pentecost"], ["watchO", "Watchword for the week — For dominion belongs to the Lord, and he rules over the nations. Psalm 22:28"], ["dateVerse", "Sunday, June 19", "Isaiah 65:1-9", "Psalm 22:19-28", "Galatians 3:23-29", "Luke 8:26-39"], ["watchD", "Some give freely, yet grow all the richer; others withhold what is due, and only suffer want. Proverbs 11:24"], ["docT", "Paul said, “In all this I have given you an example that by such work we must support the weak, remembering the words of the Lord Jesus, for he himself said, ‘It is more blessed to give than to receive.’” Acts 20:35"], ["prayer", "Lord, you gave your all for humanity; teach us to give sacrificially, so that the message of hope and reconciliation can reach all peoples. Amen."]], "171": [["dateVerse", "Monday, June 20", "Psalm 78:1-8", "Numbers 34", "Luke 3:1–20"], ["watchD", "You shall have no other gods besides me. Exodus 20:3"], ["docT", "Simon Peter answered him, “Lord, to whom can we go? You have the words of eternal life. We have come to believe and know that you are the Holy One of God.” John 6:68-69"], ["prayer", "Holy Lamb of God, like Peter, we declare that you have the word of eternal life; you are the word. Fill us with more of you until we overflow. Jesus, we need you. Amen."]], "172": [["dateVerse", "Tuesday, June 21", "Psalm 78:9-16", "Numbers 35:1–21", "Luke 3:21–38"], ["watchD", "Out of the mouths of babes and infants you have founded a bulwark. Psalm 8:2"], ["docT", "When the chief priests and the scribes saw the amazing things that he did, and heard the children crying out in the temple, “Hosanna to the Son of David,” they became angry and said to him, “Do you hear what these are saying?” Matthew 21:15-16"], ["prayer", "Dear Jesus, we long to approach you in childlike innocence. Help us to unmask ourselves in humility, so that we can experience the full joy that comes from you. We ask that you give us childlike faith. Amen."]], "173": [["dateVerse", "Wednesday, June 22", "Psalm 78:17-31", "Numbers 35:22-36:13", "Luke 4:1–13"], ["watchD", "Keep my commandments and live, keep my teachings as the apple of your eye. Proverbs 7:2"], ["docT", "Who is wise and understanding among you? Show by your good life that your works are done with gentleness born of wisdom. James 3:13"], ["prayer", "Lord, our desire is to honor you in all we do, but we confess that we often fall short of keeping your commandments; please forgive us. Teach us to walk in faithfulness and integrity according to your word. Amen."]], "174": [["dateVerse", "Thursday, June 23", "Psalm 78:32-39", "Deuteronomy 1", "Luke 4:14–21"], ["watchD", "Proclaim, give praise, and say, “Save, O Lord, your people.” Jeremiah 31:7"], ["docT", "Lord, grant to your servants to speak your word with all boldness. Acts 4:29"], ["prayer", "Holy God, through the death, burial, and resurrection of your dear son, Jesus Christ, we have been saved. Grant us the spirit of boldness to declare your undiluted word of truth, love, and hope, that others may come to have faith in you. Amen."]], "175": [["dateVerse", "Friday, June 24", "Psalm 78:40-55", "Deuteronomy 2", "Luke 4:22–30"], ["watchD", "The law of the Lord is perfect, reviving the soul. Psalm 19:7"], ["docT", "The crowds asked John, “What then should we do?” In reply he said to them, “Whoever has two coats must share with anyone who has none; and whoever has food must do likewise.” Luke 3:10-11"], ["prayer", "Caring Father, you have commanded us to be our sisters’ and brothers’ keeper. Help us to see others through your eyes and inspire us to respond to the needs of those around us in a practical way. Amen."]], "176": [["dateVerse", "Saturday, June 25", "Psalm 78:56-64", "Deuteronomy 3", "Luke 4:31–44"], ["watchD", "Know then in your heart that as a parent disciplines a child so the Lord your God disciplines you. Deuteronomy 8:5"], ["docT", "Jesus said, “I have set you an example, that you also should do as I have done to you.” John 13:15"], ["prayer", "God, we have often strayed from your presence, but in your infinite love and compassion, you gently lead us back to you. At times, your discipline seems harsh, but without such discipline where would we be? We thank you for the interest you have in us. Amen."]], "177": [["info", "Third Sunday after Pentecost"], ["watchO", "Watchword for the week — If we live by the Spirit, let us also be guided by the Spirit. Galatians 5:25"], ["dateVerse", "Sunday, June 26", "1 Kings 19: 15-16,19-21", "Psalm 16", "Galatians 5:1, 13-25", "Luke 9:51-62"], ["watchD", "God, you who have made me see many troubles and calamities will revive me again. Psalm 71:20"], ["docT", "Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled, and do not let them be afraid. John 14:27"], ["prayer", "God of peace, we have experienced trouble on every side, causing our hearts to bleed. But we are eternally grateful that even in the midst of our frustration, pain, and suffering, we can find rest in you. Amen."]], "178": [["dateVerse", "Monday, June 27", "Psalm 78:65-72", "Deuteronomy 4:1–31", "Luke 5:1–11"], ["watchD", "Your people say, “The way of the Lord is not just,” when it is their own way that is not just. Ezekiel 33:17"], ["docT", "Try to find out what is pleasing to the Lord. Ephesians 5:10"], ["prayer", "Righteous God, although our desire is to please you, we often fall short by failing to acknowledge our personal weaknesses. By your Holy Spirit, open our eyes to the reality of who we are, and teach us how to walk aright. Amen."]], "179": [["dateVerse", "Tuesday, June 28", "Psalm 79:1-8", "Deuteronomy 4:32–5:21", "Luke 5:12–26"], ["watchD", "The Lord is at my right hand, I shall not be moved. Psalm 16:8"], ["docT", "Paul said, “To this day I have had help from God, and so I stand here, testifying.” Acts 26:22"], ["prayer", "Lord, we are so grateful to you for upholding and protecting us through the storms of life. As we seek to faithfully live out our calling, remind us that you are our help and shield, and we are never alone. We pray in Jesus’ name. Amen."]], "180": [["dateVerse", "Wednesday, June 29", "Psalm 79:9-13", "Deuteronomy 5:22–6:25", "Luke 5:27–39"], ["watchD", "I have set before you life and death, blessings and curses. Choose life. Deuteronomy 30:19"], ["docT", "This is eternal life, that they may know you, the only true God, and Jesus Christ whom you have sent. John 17:3"], ["prayer", "Giver of life immortal, to know Christ is to know you and the Holy Spirit. Continue to reign in our lives as we await the day when we shall see you face to face. Amen."]], "181": [["dateVerse", "Thursday, June 30", "Psalm 80:1-7", "Deuteronomy 7", "Luke 6:1–11"], ["watchD", "The Lord is my strength and my might, and he has become my salvation. Exodus 15:2"], ["docT", "Mary said, “The Mighty One has done great things for me, and holy is his name.” Luke 1:49"], ["prayer", "Mighty God, strong to save, holy is your name. Amen."]], "182": [["dateVerse", "Friday, July 1", "Psalm 80:8-11", "Deuteronomy 8:1–9:6", "Luke 6:12–26"], ["watchD", "Turn, O Lord, save my life; deliver me for the sake of your steadfast love. Psalm 6:4"], ["docT", "Jesus turned, and seeing her he said, “Take heart, daughter; your faith has made you well.” And instantly the woman was made well. Matthew 9:22"], ["prayer", "Dear Lord, thank you for protecting and healing us. Thank you for reminding us, each and every day, that our faith in you gives us strength to tackle our daily routines and issues. We pray that you continue to watch over us daily. Amen."]], "183": [["dateVerse", "Saturday, July 2", "Psalm 80:12-19", "Deuteronomy 9:7–10:22", "Luke 6:27–38"], ["watchD", "If I take the wings of the morning and settle at the farthest limits of the sea, even there your hand shall lead me, and your right hand shall hold me fast. Psalm 139:9-10"], ["docT", "Jesus said, “I am with you always, to the end of the age.” Matthew 28:20"], ["prayer", "Heavenly Father, you have proven to us countless times that you hold our hands in our darkest hours and in our brightest days. Help us to radiate the love of God to all, including our enemies, so that all may see you in us. Amen."]], "184": [["info", "Fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — So let us not grow weary in doing what is right. Galatians 6:9"], ["dateVerse", "Sunday, July 3", "Isaiah 66:10-14", "Psalm 66:1-9", "Galatians 6:(1-6),7-16", "Luke 10:1-11,16-20"], ["watchD", "Come and hear, all you who fear God, and I will tell what he has done for me. Psalm 66:16"], ["docT", "I live by faith in the Son of God, who loved me and gave himself for me. Galatians 2:20"], ["prayer", "Dear Lord, we give thanks for all that you have done in our lives, for the lessons and the blessings. We rejoice in the gifts that have blossomed from focusing on our relationship with you. We pray for continual growth and discernment. Amen."]], "185": [["dateVerse", "Monday, July 4", "Psalm 81:1-5", "Deuteronomy 11", "Luke 6:39–49"], ["watchD", "All these things my hand has made, and so all these things are mine, says the Lord. But this is the one to whom I will look, to the humble and contrite in spirit, who trembles at my word. Isaiah 66:2"], ["docT", "Jesus prayed: Sanctify them in the truth; your word is truth. John 17:17"], ["prayer", "Most gracious Lord and God, we pray that you look upon your people and help us in identifying with your truth. Allow us to unite and marvel at your creation, praising you in one accord for all that you have done for us. In your name, we pray. Amen."]], "186": [["dateVerse", "Tuesday, July 5", "Psalm 81:6-10", "Deuteronomy 12", "Luke 7:1–17"], ["watchD", "Abram believed the Lord; and the Lord reckoned it to him as righteousness. Genesis 15:6"], ["docT", "Those who believe are the descendants of Abraham. Galatians 3:7"], ["prayer", "O Lord our God, God of Abraham, God who delivers and saves, God who lifts our burdens, may you give us restoration and a stronger sense of connection to you. Amen."]], "187": [["specialVerse", "John Hus Festival†", "Isaiah 49:1-7", "Psalm 135:1-13", "1 Corinthians 1:18-24", "Mark 8:34-38"], ["dateVerse", "Wednesday, July 6", "Psalm 81:11-16", "Deuteronomy 13:1–14:21", "Luke 7:18–30"], ["watchD", "The Lord will be your everlasting light, and your God will be your glory. Isaiah 60:19"], ["docT", "This is the message we have heard from him and proclaim to you, that God is light and in him there is no darkness at all. 1 John 1:5"], ["prayer", "Lord, you are the beacon that brings us from darkness. We know that sometimes we get distracted by things that hold us back, but Lord, we pray that we follow your light into your glory and live a life that gives you praise, all the days of our lives. Amen."], ["info", "† On July 6, 1415, John Hus was martyred at the Council of Constance."]], "188": [["dateVerse", "Thursday, July 7", "Psalm 82:1-4", "Deuteronomy 14:22–15:18", "Luke 7:31–38"], ["watchD", "O Lord, it is in your hand to make great and to give strength to all. 1 Chronicles 29:12"], ["docT", "Jesus took the children up in his arms, laid his hands on them, and blessed them. Mark 10:16"], ["prayer", "Gracious Father, give us endurance. Give us the strength to mount up with wings like eagles. Watch over our loved ones and allow us to grow in our daily walk with you. May your abundant love drown our doubt, so we become full with your ways. Amen."]], "189": [["dateVerse", "Friday, July 8", "Psalm 82:5-8", "Deuteronomy 15:19–17:7", "Luke 7:39–50"], ["watchD", "I will punish you according to the fruit of your doings, says the Lord. Jeremiah 21:14"], ["docT", "So let us not grow weary in doing what is right, for we will reap at harvest time, if we do not give up. Galatians 6:9"], ["prayer", "Dearest Father, help us remain on the path. Help us to maintain our Christian walk, though life may be difficult at times. Allow us to walk through our journeys and keep our heads high in anticipation of being with you in perfect peace. Amen."]], "190": [["dateVerse", "Saturday, July 9", "Psalm 83:1-8", "Deuteronomy 17:8–18:22", "Luke 8:1–15"], ["watchD", "They did not thirst when he led them through the deserts; he made water flow for them from the rock. Isaiah 48:21"], ["docT", "Jesus said, “Let anyone who is thirsty come to me and drink.” John 7:37 NIV"], ["prayer", "Lord, we turn to you to quench our thirst. We know that the water that flows from your rock gives us new life, that we may never thirst again. May we share your blessings with others, so that they too, will no longer be thirsty. We pray this in Jesus’ name. Amen."]], "191": [["info", "Fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — Make me to know your ways, O Lord; teach me your paths. Psalm 25:4"], ["dateVerse", "Sunday, July 10", "Deuteronomy 30:9-14", "Psalm 25:1-10", "Colossians 1:1-14", "Luke 10:25-37"], ["watchD", "Just like the clay in the potter’s hand, so are you in my hand. Jeremiah 18:6"], ["docT", "It is God who is at work in you, enabling you both to will and to work for his good pleasure. Philippians 2:13"], ["prayer", "Dearest Lord, we pray that you walk with us today. As we go through the motions of riding through life, may you remove the figurative training wheels, so that we rely on our faith for balance. Be the still voice in our ears, we pray. Amen."]], "192": [["dateVerse", "Monday, July 11", "Psalm 83:9-12", "Deuteronomy 19:1–20:9", "Luke 8:16–25"], ["watchD", "O Lord, my strength and my stronghold, my refuge on the day of trouble. Jeremiah 16:19"], ["docT", "We are afflicted in every way, but not crushed; perplexed, but not driven to despair. 2 Corinthians 4:8"], ["prayer", "God, we cling to you. We know that, although we sin and fall short of you glory, you have patience with us. May you help us learn patience with one another and become more and more like you, regardless of how strenuous it may be. Amen."]], "193": [["dateVerse", "Tuesday, July 12", "Psalm 83:13-18", "Deuteronomy 20:10–21:23", "Luke 8:26–39"], ["watchD", "The Lord is my strength. Habakkuk 3:19"], ["docT", "For to this end we toil and struggle, because we have our hope set on the living God. 1 Timothy 4:10"], ["prayer", "Lord, we are trying our best to live like you. We are doing the work in order to be rewarded with a seat in your kingdom, but the trials and tribulations weigh us down. Help us to keep our eyes on you and push through. We pray in Jesus’ name. Amen."]], "194": [["dateVerse", "Wednesday, July 13", "Psalm 84:1-7", "Deuteronomy 22", "Luke 8:40–56"], ["watchD", "I will send survivors to the nations, that have not heard of my fame or seen my glory; and they shall declare my glory among the nations. Isaiah 66:19"], ["docT", "Jesus said, “Go into all the world and proclaim the good news to the whole creation.” Mark 16:15"], ["prayer", "Almighty Father, help us be witnesses of your amazing grace and mercy. Help us to scream from the mountaintops of your greatness! Give us the courage to walk boldly and claim you loudly! Amen."]], "195": [["dateVerse", "Thursday, July 14", "Psalm 84:8-12", "Deuteronomy 23:1–24:13", "Luke 9:1–11"], ["watchD", "The Lord is good to all, and his compassion is over all that he has made. Psalm 145:9"], ["docT", "He makes his sun rise on the evil and on the good, and sends rain on the righteous and on the unrighteous. Matthew 5:45"], ["prayer", "Dear Lord, we thank you for providing us with your never-ending love. You give us so much more than we feel that we deserve. Our cups runneth over, and we spread our abundance to one another. May we continue to experience joy and gladness as we minister to your people. Amen."]], "196": [["dateVerse", "Friday, July 15", "Psalm 85:1-7", "Deuteronomy 24:14–25:19", "Luke 9:12–27"], ["watchD", "Surely his salvation is at hand for those who fear him. Steadfast love and faithfulness will meet; righteousness and peace will kiss each other. Psalm 85:9,10"], ["docT", "Since we are justified by faith, we have peace with God through our Lord Jesus Christ. Romans 5:1"], ["prayer", "God, in the midst of our trials, you know it all. When we worry, you smile, wipe our tears, and remind us that you know what the future holds for us. We weep in the present, but you reassure us that we will smile in the end. Comfort us while we make our way to the happier moments. Amen."]], "197": [["dateVerse", "Saturday, July 16", "Psalm 85:8-13", "Deuteronomy 26:1–27:13", "Luke 9:28–36"], ["watchD", "Lord, though I walk in the midst of trouble, you will revive me. Psalm 138:7 NKJV"], ["docT", "As servants of God we have commended ourselves in every way: through great endurance, in afflictions, hardships, calamities. 2 Corinthians 6:4"], ["prayer", "Precious and most gracious Lord, you constantly help us realize that we are more than conquerors through you who love us. We pray that you lead us with your mighty hand into the way that we should go. Bless us with discernment and a better personal relationship with you. Amen."]], "198": [["info", "Sixth Sunday after Pentecost"], ["watchO", "Watchword for the week — Is anything too wonderful for the Lord? Genesis 18:14"], ["dateVerse", "Sunday, July 17", "Genesis 18:1-10a", "Psalm 15", "Colossians 1:15-28", "Luke 10:38-42"], ["watchD", "Set a guard over my mouth, O Lord; keep watch over the door of my lips. Psalm 141:3"], ["docT", "Let no evil talk come out of your mouths, but only what is useful for building up, as there is need, so that your words may give grace to those who hear. Ephesians 4:29"], ["prayer", "God, help us to control our tongues! Our human error allows us to spit harsh words in emotional moments, only to regret them within a few minutes. Bind our tongues and teach us to think before we speak. Amen."]], "199": [["dateVerse", "Monday, July 18", "Psalm 86:1-10", "Deuteronomy 27:14–28:24", "Luke 9:37–50"], ["watchD", "“For the hurt of the daughter of my people I am hurt. Is there no balm in Gilead? Is there no physician there?” Jeremiah 8:21,22 NKJV"], ["docT", "Jesus said to the disciples, “Whenever you enter a town and its people welcome you, eat what is set before you; cure the sick who are there, and say to them, ‘The kingdom of God has come near to you.’” Luke 10:8-9"], ["prayer", "Great Physician, we are calling upon you for healing. We are the sin-sick souls that need healing and replenishment. May you rejuvenate us and keep us whole. Amen."]], "200": [["dateVerse", "Tuesday, July 19", "Psalm 86:11-17", "Deuteronomy 28:25–57", "Luke 9:51–62"], ["watchD", "The angel of the Lord encamps around those who fear him, and delivers them. Psalm 34:7"], ["docT", "Suddenly an angel of the Lord appeared and a light shone in the cell. He tapped Peter on the side and woke him, saying, “Get up quickly.” And the chains fell off his wrists. Acts 12:7"], ["prayer", "Father, your angels are speaking to us. They are helping us align with the lifestyle you have chosen for us. Steer us in the right direction. Amen."]], "201": [["dateVerse", "Wednesday, July 20", "Psalm 87", "Deuteronomy 28:58–29:21", "Luke 10:1–16"], ["watchD", "You are my hiding-place and my shield; I hope in your word. Psalm 119:114"], ["docT", "The centurion answered, “Lord, I am not worthy to have you come under my roof; but only speak the word, and my servant will be healed.” Matthew 8:8"], ["prayer", "Lord, we turn our hearts to you in praise for the safety of your shield. We know we are safe in your presence and we are thankful for your protection. Our lives are dedicated to you in all that we do: sharing your love for us with the world, knowing that we are not worthy of such great love. May our words speak your truth to all who can hear. In Jesus’ name, we pray. Amen."]], "202": [["dateVerse", "Thursday, July 21", "Psalm 88:1-5", "Deuteronomy 29:22–31:8", "Luke 10:17–24"], ["watchD", "You will remember your ways, and be ashamed when I forgive you all that you have done, says the Lord God. Ezekiel 16:61,63"], ["docT", "Godly grief produces a repentance that leads to salvation and brings no regret. 2 Corinthians 7:10"], ["prayer", "Cleanse us, O God. Wash us clean of the world and its pleasures, pleasures that do not align with you. Rinse us of all unclean thoughts and make us fresh and right with you. In your name, we pray. Amen."]], "203": [["dateVerse", "Friday, July 22", "Psalm 88:6-12", "Deuteronomy 31:9–32:9", "Luke 10:25–42"], ["watchD", "Blessed be the Lord, who has given rest to his people Israel according to all that he promised. 1 Kings 8:56"], ["docT", "So then, a sabbath rest still remains for the people of God. Hebrews 4:9"], ["prayer", "Father, allow us to enjoy rest. We are grateful to make it through another week, protected by your saving grace. Give us peace and rejuvenation, so that our bodies are recharged, and we may continue our earthly journey. Amen."]], "204": [["dateVerse", "Saturday, July 23", "Psalm 88:13-18", "Deuteronomy 32:10–43", "Luke 11:1–13"], ["watchD", "Do not be frightened or dismayed, for the Lord your God is with you wherever you go. Joshua 1:9"], ["docT", "Therefore I am content with weaknesses, insults, hardships, persecutions, and calamities for the sake of Christ; for whenever I am weak, then I am strong. 2 Corinthians 12:10"], ["prayer", "Surround us, O Lord. Wrap us in your arms and give us comfort. We are weak as humans, but you are our source of knowledge and power. There are so many things we are unsure of, but you are all- knowing. We lay our troubles before you and allow you to move through our lives. We leave it all at your feet. Amen."]], "205": [["watchO", "Seventh Sunday after Pentecost Watchword for the week — Lord, teach us to pray. Luke 11:1 "], ["dateVerse", "Sunday, July 24", "Genesis 18:20-32", "Psalm 138", "Colossians 2:6-15,(16-19)", "Luke 11:1-13"], ["watchD", "There is a river whose streams make glad the city of God, the holy habitation of the Most High. God is in the midst of the city, it shall not be moved. Psalm 46:4-5"], ["docT", "Look! God’s dwelling place is now among the people, and he will dwell with them. They will be his people, and God himself will be with them and be their God. Revelation 21:3 NIV"], ["prayer", "We give you praise, Lord. You are magnificent; you fight for us, and you support us. You stretch out your hand so we do not fall, and we marvel at all that you have done for us. Thank you for being such a protecting and awesome God! Amen."]], "206": [["dateVerse", "Monday, July 25", "Psalm 89:1-8", "Deuteronomy 32:44–33:17", "Luke 11:14–28"], ["watchD", "David found strength in the Lord his God. 1 Samuel 30:6 NIV"], ["docT", "The apostles said to the Lord, “Increase our faith!” Luke 17:5"], ["prayer", "God, we hope to gain strength like David. When the times get dangerous and scary, may we not lean on our own understanding, but find courage in you. We pray that you drive the demons out of us and allow us to speak and walk right. May we be blessed to hear your word and obey. Amen."]], "207": [["dateVerse", "Tuesday, July 26", "Psalm 89:9-18", "Deuteronomy 33:18–34:12", "Luke 11:29–36"], ["watchD", "Make known his deeds among the nations; proclaim that his name is exalted. Isaiah 12:4"], ["docT", "Then I saw another angel flying in midheaven, with an eternal gospel to proclaim to those who live on the earth—to every nation and tribe and language and people. He said in a loud voice, “Fear God and give him glory.” Revelation 14:6-7"], ["prayer", "We stand in awe of you, King Jesus. We sing and cry songs of your greatness. You have shown us how much you love us, and we pray that we will share our testimony of what you’ve done for us. Amen."]], "208": [["dateVerse", "Wednesday, July 27", "Psalm 89:19-29", "Joshua 1,2", "Luke 11:37–54"], ["watchD", "O give thanks to the Lord of Lords, who alone does great wonders, for his steadfast love endures forever. Psalm 136:3,4"], ["docT", "Then one of them, when he saw that he was healed, turned back, praising God with a loud voice. He prostrated himself at Jesus’ feet and thanked him. Luke 17:15-16"], ["prayer", "Amazing and loving God—healer of wounds that not even we understand—may we approach life with unending faith that your mercy will heal the wounds that bind us. May we praise the name of Jesus as a witness to your great wonders. Amen."]], "209": [["dateVerse", "Thursday, July 28", "Psalm 89:30-37", "Joshua 3,4", "Luke 12:1–12"], ["watchD", "Those who cling to worthless idols turn away from God’s love for them. Jonah 2:8 NIV"], ["docT", "The world and its desire are passing away, but those who do the will of God live forever. 1 John 2:17"], ["prayer", "Lord, forgive us for worshiping modern idols, be it social media, technology, or other humans. Forgive us for cutting our devotion time short. Forgive us for idolizing people and human behaviors, rather than clinging to you and your word. Amen."]], "210": [["dateVerse", "Friday, July 29", "Psalm 89:38-45", "Joshua 5,6", "Luke 12:13–21"], ["watchD", "The path of the righteous is like the light of dawn, which shines brighter and brighter until full day. Proverbs 4:18"], ["docT", "Beloved, we are God’s children now; what we will be has not yet been revealed. What we do know is this: when he is revealed, we will be like him, for we will see him as he is. 1 John 3:2"], ["prayer", "Thank you, Father. You illuminate our lives with your unselfish ways. We anticipate your coming, and know that you are the blueprint for our lives. May we follow suit, so that we may dwell forever with you. Amen."]], "211": [["dateVerse", "Saturday, July 30", "Psalm 89:46-52", "Joshua 7", "Luke 12:22–34"], ["watchD", "The Lord our God we will serve, and him we will obey. Joshua 24:24"], ["docT", "Jesus answered Pilate, “For this I was born, and for this I came into the world, to testify to the truth. Everyone who belongs to the truth listens to my voice.” John 18:37"], ["prayer", "Gracious Father, you sent Jesus here for our sake, and we are so thankful. We cannot repay you for what you have done for us. We pray that, when we begin to witness to others, you give us the zeal to continue and inspire hearts. Amen."]], "212": [["info", "Eighth Sunday after Pentecost"], ["watchO", "Watchword for the week — Set your minds on things that are above, not on things that are on earth. Colossians 3:2"], ["dateVerse", "Sunday, July 31", "Ecclesiastes 1:2,12-14,2:18-23", "Psalm 49:1-12", "Colossians 3:1-11", "Luke 12:13-21"], ["watchD", "Do not be far from me, for trouble is near and there is no one to help. Psalm 22:11"], ["docT", "God is faithful, and he will not let you be tested beyond your strength. 1 Corinthians 10:13"], ["prayer", "Gracious God, we need you every hour, especially in times of great temptation. May we turn to you, Lord, to fill us with your peace, rather than our filling ourselves with things that tempt us and test our strength. Lord, please be close during these times of struggle, for it is you who strengthens us during our times of need. In your Son’s holy name, we pray. Amen."]], "213": [["dateVerse", "Monday, August 1", "Psalm 90", "Joshua 8:1–29", "Luke 12:35–48"], ["watchD", "Peace, peace, to the far and the near, says the Lord; and I will heal them. Isaiah 57:19"], ["docT", "The God of peace be with all of you. Romans 15:33"], ["prayer", "Prince of peace, as we begin our workweek, help us to take the grace, mercy, and peace of Sunday’s benediction into our offices, shops, schools, and factories, to extend those blessings to our colleagues and coworkers. Amen."]], "214": [["dateVerse", "Tuesday, August 2", "Psalm 91:1-8", "Joshua 8:30–9:27", "Luke 12:49–59"], ["watchD", "Have we not all one Father? Has not one God created us? Why do we deal treacherously with one another? Malachi 2:10 NKJV"], ["docT", "In humility regard others as better than yourselves. Philippians 2:3"], ["prayer", "Lord and Creator of all, help us regard others with open minds and hearts, and to see them as your children. Grant us humility, that we might see in all we meet a reflection of our Savior today. Amen."]], "215": [["dateVerse", "Wednesday, August 3", "Psalm 91:9-16", "Joshua 10:1–27", "Luke 13:1–17"], ["watchD", "Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["docT", "You are all children of light and children of the day. 1 Thessalonians 5:5"], ["prayer", "Light of the world, shine upon us and through us, that your light may dawn upon those in darkness, need, and despair. Amen."]], "216": [["dateVerse", "Thursday, August 4", "Psalm 92:1-8", "Joshua 10:28–11:23", "Luke 13:18–30"], ["watchD", "Hezekiah received the letter and read it; then he went up to the house of the Lord and spread it before the Lord. 2 Kings 19:14"], ["docT", "Do not worry about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. Philippians 4:6"], ["prayer", "O Wisdom from on high, as we have read about King Hezekiah, we pray today for leaders of governments around the world. We pray that they seek your face and work for justice and peace, for the welfare of the people they serve. Amen."]], "217": [["dateVerse", "Friday, August 5", "Psalm 92:9-15", "Joshua 12:1–13:7", "Luke 13:31–14:6"], ["watchD", "By my God I can leap over a wall. Psalm 18:29"], ["docT", "God did not give us a spirit of cowardice, but rather a spirit of power and of love and of self- discipline. 2 Timothy 1:7"], ["prayer", "Lord, by the end of a week we feel like we’ve hit a wall, rather than feel we can leap over one! We ask that the power of your Spirit re-energize us for the tasks set before us, that we may serve with joy. Amen."]], "218": [["dateVerse", "Saturday, August 6", "Psalm 93", "Joshua 13:8–14:5", "Luke 14:7–24"], ["watchD", "Only be careful, and watch yourselves closely so that you do not forget the things your eyes have seen. Deuteronomy 4:9 NIV"], ["docT", "Remember then what you received and heard; obey it, and repent. Revelation 3:3"], ["prayer", "Generous God, as we examine the moments of our days, we become ever more aware of your presence and blessings in our lives. Show us opportunities to share those experiences with others, and to help them see your love in their lives. Amen."]], "219": [["info", "Ninth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “Do not be afraid, little flock, for it is your Father’s good pleasure to give you the kingdom.” Luke 12:32"], ["dateVerse", "Sunday, August 7", "Genesis 15:1-6", "Psalm 33:12-22", "Hebrews 11:1-3,8-16", "Luke 12:32-40"], ["watchD", "O greatly beloved, fear not! Peace be to you; be strong, yes, be strong! Daniel 10:19 NKJV"], ["docT", "Your pain will turn into joy. John 16:20"], ["prayer", "Dear heavenly Father, we are faithful, but in times of great need, we turn to you for your peace. We ask that you remove what troubles us and teach us to fear not. You have the ability to turn pain into joy, and we ask that you do that now. Lord, remove the suffering we are experiencing and remind us of all you have done and will continue to do for us, for you are a loving and caring God. We pray all this in Jesus’ name. Amen."]], "220": [["dateVerse", "Monday, August 8", "Psalm 94:1-11", "Joshua 14:6–15:19", "Luke 14:25–35"], ["watchD", "He is named wonderful Counselor, mighty God, everlasting Father, Prince of Peace. Isaiah 9:6"], ["docT", "So we have known and believe the love that God has for us. God is love, and those who abide in love abide in God, and God abides in them. 1 John 4:16"], ["prayer", "Prince of Peace, in gratitude that you keep our hearts and minds as we abide in you, show us how to share that peace today, so that others may know the peace which surpasses understanding. Amen."]], "221": [["dateVerse", "Tuesday, August 9", "Psalm 94:12-23", "Joshua 15:20–63", "Luke 15:1–10"], ["watchD", "I am a companion of all who fear you, of those who keep your precepts. Psalm 119:63"], ["docT", "Philip asked the Ethiopian, “Do you understand what you are reading?” He replied, “How can I, unless someone guides me?” And he invited Philip to get in and sit beside him. Acts 8:30-31"], ["prayer", "Eternal Word, we thank you for the diversity of your disciples. Help us focus, not upon our differences, but on working side by side as we seek to know you better and to serve you together. Amen."]], "222": [["dateVerse", "Wednesday, August 10", "Psalm 95", "Joshua 16,17", "Luke 15:11–32"], ["watchD", "When you pass through the waters, I will be with you; and through the rivers, they shall not overwhelm you; when you walk through fire you shall not be burned, and the flame shall not consume you. Isaiah 43:2"], ["docT", "Why are you afraid, you of little faith? Matthew 8:26"], ["prayer", "You have promised, Lord, to be with us through flood, fire, and calamity. Today, we pray not only for those in need, but also for those who protect and serve people in need. Show how we can support the needy and help those who serve. Amen."]], "223": [["dateVerse", "Thursday, August 11", "Psalm 96:1-9", "Joshua 18:1–19:9", "Luke 16:1–15"], ["watchD", "Love the Lord, all you his saints. Psalm 31:23"], ["docT", "And now faith, hope, and love abide, these three; and the greatest of these is love.1 Corinthians 13:13"], ["prayer", "Heavenly Father, walk beside us today. Let us know and be sure of your love with every step. Then, by your grace, help us to reflect that love to a world in need. Amen."]], "224": [["dateVerse", "Friday, August 12", "Psalm 96:10-13", "Joshua 19:10–39", "Luke 16:16–31"], ["watchD", "The Lord executes justice for the oppressed; he gives food to the hungry. Psalm 146:7"], ["docT", "Jesus took the seven loaves, and after giving thanks he broke them and gave them to his disciples to distribute; and they distributed them to the crowd. Mark 8:6"], ["prayer", "God of justice, all around us, we see the effects of greed and injustice. We know we are citizens with the saints and also members of the household of God, but we are also citizens of our community and nation. May we show your love and justice throughout all our manifestations as citizens. Amen."]], "225": [["specialVerse", "August Thirteenth Festival†", "Joshua 24:16-24", "Psalm 133", "1 John 4:1-13", "John 17:1-2,6-19"], ["dateVerse", "Saturday, August 13", "Psalm 97:1-6", "Joshua 19:40–21:8", "Luke 17:1–10"], ["watchD", "The servant of God said, “I gave my back to those who struck me, and my cheeks to those who pulled out the beard; I did not hide my face from insult and spitting.” Isaiah 50:6"], ["docT", "Here is the Lamb of God who takes away the sin of the world! John 1:29"], ["prayer", "Today, Lord, we remember how a small community of believers humbled themselves before the Lamb of God in a celebration of communion, put aside their differences, and welcomed the power of your Holy Spirit to guide them to work together for your kingdom. Rekindle that spirit in us today, and revive us to serve you in dynamic ways. Amen."], ["info", "† On this date in 1727 in Berthelsdorf, Saxony (now Germany), a group of quarreling Christians experienced their unity in Christ through the power of the Holy Spirit. This new Pentecost marked the revival of the Unity of the Brethren, begun in 1457, and the beginning of the Renewed Moravian Church."]], "226": [["info", "Tenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let us run with perseverance the race that is set before us, looking to Jesus the pioneer and perfecter of our faith. Hebrews 12:2"], ["dateVerse", "Sunday, August 14", "Jeremiah 23:23-29", "Psalm 82", "Hebrews 11:29-12:2", "Luke 12:49-56"], ["watchD", "Who is like the Lord our God, who is seated on high, who looks far down on the heavens and the earth? He raises the poor from the dust. Psalm 113:5-7"], ["docT", "Jesus Christ, though he was in the form of God, did not regard equality with God as something to be exploited, but emptied himself, taking the form of a slave, being born in human likeness. Philippians 2:6-7"], ["prayer", "Most holy Lord and God, we are in awe of you! In worship today, we contemplate the mystery of your love, which was given to us in your beloved son. May we follow his example in giving ourselves in loving service to others. In Jesus’ name, we pray. Amen."]], "227": [["dateVerse", "Monday, August 15", "Psalm 97:7-12", "Joshua 21:9–45", "Luke 17:11–19"], ["watchD", "There are glad songs of victory in the tents of the righteous: “The right hand of the Lord is exalted; the right hand of the Lord does valiantly.” Psalm 118:15.16"], ["docT", "My soul magnifies the Lord, and my spirit rejoices in God my Savior. Luke 1:46-47"], ["prayer", "Exalted Lord, help us to see where your hand is moving in the lives of those around us, and how to respond with a caring act or a kind word. Amen."]], "228": [["dateVerse", "Tuesday, August 16", "Psalm 98", "Joshua 22", "Luke 17:20–25"], ["watchD", "We will tell to the coming generation the glorious deeds of the Lord, and his might, and the wonders that he has done. Psalm 78:4"], ["docT", "No one after lighting a lamp puts it under the bushel basket, but on the lampstand, and it gives light to all in the house. Matthew 5:15"], ["prayer", "Light of the world, we thank you for the opportunity to tell the rising generation about your deeds, love, and grace. May we reflect your light wherever we go. Amen."]], "229": [["dateVerse", "Wednesday, August 17", "Psalm 99", "Joshua 23:1–24:13", "Luke 17:26–37"], ["watchD", "Only fear the Lord, and serve him faithfully with all your heart; for consider what great things he has done for you. 1 Samuel 12:24"], ["docT", "Do not lag in zeal, be ardent in spirit, serve the Lord. Romans 12:11"], ["prayer", "Have mercy, Lord, when we allow the burdens and cares of the day to weigh us down. Remind us of your love, revive us with your spirit, and renew us for service in your name. Amen."]], "230": [["dateVerse", "Thursday, August 18", "Psalm 100", "Joshua 24:14–Judges 1:16", "Luke 18:1–17"], ["watchD", "The Lord loves justice. Psalm 37:28"], ["docT", "Then give to the emperor the things that are the emperor’s, and to God the things that are God’s. Luke 20:25"], ["prayer", "God of justice and hope, while as Christians we are not to be “of this world,” we are still “in this world.” We pray that leaders of states and nations, legislatures and parliaments, will seek your face and work for the welfare of all citizens. We long for the day when the kingdoms of this world become the kingdom of our Lord, in which Christ shall reign forever and ever. Show us how our decisions and actions may help advance that goal. Amen."]], "231": [["dateVerse", "Friday, August 19", "Psalm 101", "Judges 1:17–2:23", "Luke 18:18–30"], ["watchD", "My soul clings to you; your right hand upholds me. Psalm 63:8"], ["docT", "Paul wrote: I know the one in whom I have put my trust, and I am sure that he is able to guard until that day what I have entrusted to him. 1 Timothy 1:12"], ["prayer", "God of strength and comfort, we rely upon your steadfast love as a shelter to hide in when life is overwhelming, and as our motivation for the tasks of the day. Thank you for your wondrous grace. Amen."]], "232": [["dateVerse", "Saturday, August 20", "Psalm 102:1-11", "Judges 3", "Luke 18:31–43"], ["watchD", "God says, “I will be like the dew to Israel; he shall blossom like the lily.” Hosea 14:5"], ["docT", "I am the vine, you are the branches. Those who abide in me and I in them bear much fruit, because apart from me you can do nothing. John 15:5"], ["prayer", "Life-giving Creator, may we be deeply rooted in your love, growing in your grace, and yielding fruit of the Spirit for a world hungry to know your love and acceptance. Amen."]], "233": [["info", "Eleventh Sunday after Pentecost"], ["watchO", "Watchword for the week — The steadfast love of the Lord is from everlasting to everlasting on those who fear him. Psalm 103:17"], ["dateVerse", "Sunday, August 21†", "Isaiah 58:9b-14", "Psalm 103:1-8", "Hebrews 12:18-29", "Luke 13:10-17"], ["watchD", "Do not delay me, since the Lord has made my journey successful. Genesis 24:56"], ["docT", "As they were going along the road, they came to some water; and the eunuch said, “Look, here is water! What is to prevent me from being baptized?” Acts 8:36"], ["prayer", "Lamb of God, we come together as a community of believers from many different paths in life. Free us from the constraints that delay decisions for you, and the obstacles which delay service in your name. Speed us on our way to bring light and hope to every land and race. Amen."], ["info", "† On this day in 1732, the first missionaries departed from Herrnhut bound for St. Thomas."]], "234": [["dateVerse", "Monday, August 22", "Psalm 102:12-22", "Judges 4", "Luke 19:1–10"], ["watchD", "O Lord our God—we set our hope on you. Jeremiah 14:22"], ["docT", "Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Hebrews 4:16"], ["prayer", "Lord, as we keep our eyes and hearts fixed upon you this day, help us to be ready to explain the hope that we have in you to anyone who asks. Amen."]], "235": [["dateVerse", "Tuesday, August 23", "Psalm 102:23-28", "Judges 5", "Luke 19:11–27"], ["watchD", "I am the Lord your God, who brought you out of the land of Egypt, out of the house of slavery. Exodus 20:2"], ["docT", "Where the Spirit of the Lord is, there is freedom. 2 Corinthians 3:17"], ["prayer", "Lord, we thank you that life in you brings freedom, yet we realize it also calls for service to you. Guide us in ways to use our freedom responsibly, and to share your word of liberation to the oppressed. Amen."]], "236": [["dateVerse", "Wednesday, August 24", "Psalm 103:1-5", "Judges 6", "Luke 19:28–44"], ["watchD", "I shall walk at liberty, for I have sought your precepts. Psalm 119:45"], ["docT", "In all these things we are more than conquerors through him who loved us. Romans 8:37"], ["prayer", "Liberating Lord, on most days, we don’t feel like conquerors. Remind us of the power of your resurrection to empower us this day. Amen."]], "237": [["dateVerse", "Thursday, August 25", "Psalm 103:6-18", "Judges 7", "Luke 19:45–20:8"], ["watchD", "I call upon God, and the Lord will save me. Psalm 55:16"], ["docT", "On him we have set our hope that he will rescue us again, as you also join in helping us by your prayers. 2 Corinthians 1:10-11"], ["prayer", "Saving God, we call upon you this day, relying on your power to uphold us and strengthen us. Remind us that, as we pray, we are not alone; our brothers and sisters around the world pray with us and for us. Amen."]], "238": [["dateVerse", "Friday, August 26", "Psalm 103:19-22", "Judges 8", "Luke 20:9–19"], ["watchD", "Sing to the Lord, bless his name; tell of his salvation from day to day. Psalm 96:2"], ["docT", "Teach and admonish one another in all wisdom; and with gratitude in your hearts sing psalms, hymns, and spiritual songs to God. Colossians 3:16"], ["prayer", "Loosen our tongues, Lord, to sing your praise boldly. Liberate us to share your praise today. Amen."]], "239": [["dateVerse", "Saturday, August 27", "Psalm 104:1-9", "Judges 9:1–33", "Luke 20:20–26"], ["watchD", "Do not, O Lord, withhold your mercy from me; let your steadfast love and your faithfulness keep me safe forever. Psalm 40:11"], ["docT", "The one who calls you is faithful, and he will do this. 1 Thessalonians 5:24"], ["prayer", "Faithful God, we thank you for your unending mercy and love. Show us ways today to extend mercy and show your steadfast love to others. Amen."]], "240": [["info", "Twelfth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let mutual love continue. Hebrews 13:1"], ["dateVerse", "Sunday, August 28", "Proverbs 25:6-7", "Psalm 112", "Hebrews 13:1-8,15-16", "Luke 14:1,7-14"], ["watchD", "Declare his glory among the nations, his marvelous works among all the peoples. Psalm 96:3"], ["docT", "Paul wrote: Pray for us that God will open to us a door for the word. Colossians 4:3"], ["prayer", "Holy Lord, as we worship today, we praise you for your marvelous works. We thank you for your mercy and love. We confess our sin and missed opportunities for service. Show us open doors to declare your glory to our community, nation, and world. Amen."]], "241": [["dateVerse", "Monday, August 29", "Psalm 104:10-18", "Judges 9:34–10:18", "Luke 20:27–40"], ["watchD", "Rise up, O God, plead your cause. Psalm 74:22"], ["docT", "God has made known to us the mystery of his will, according to his good pleasure that he set forth in Christ, as a plan for the fullness of time, to gather up all things in Christ, things in heaven and things on earth. Ephesians 1:9-10"], ["prayer", "Righteous and mysterious God, we bow before you seeking your mercy. Thank you for the gift of your son who came to live among us, to lead us to you, and to provide the way to you through his life, death, and resurrection. Amen."]], "242": [["dateVerse", "Tuesday, August 30", "Psalm 104:19-23", "Judges 11:1–27", "Luke 20:41–21:4"], ["watchD", "Moses stretched out his hand over the sea. The Lord drove the sea back by a strong east wind. Exodus 14:21"], ["docT", "By faith the people passed through the Red Sea as if it were dry land. Hebrews 11:29"], ["prayer", "God of deliverance, we thank and praise you for making our way straight and level. Forgive us for thinking progress and security is our doing. Thank you for Jesus: the way, the truth, the life. Amen."]], "243": [["dateVerse", "Wednesday, August 31", "Psalm 104:24-30", "Judges 11:28–12:15", "Luke 21:5–28"], ["watchD", "O Israel, hope in the Lord! For with the Lord there is steadfast love, and with him is great power to redeem. Psalm 130:7"], ["docT", "God is able to provide you with every blessing in abundance, so that by always having enough of everything, you may share abundantly in every good work. 2 Corinthians 9:8"], ["prayer", "God of steadfast love, have mercy upon us. In gratitude for your care of us, help us to see the needs of others in our community. Out of our abundance, may we bless others, so they know the love of God through us. Amen."]], "244": [["dateVerse", "Thursday, September 1", "Psalm 104:31-35", "Judges 13", "Luke 21:29–38"], ["watchD", "You came near when I called on you; you said, ‘Do not fear!’ Lamentations 3:57"], ["docT", "Ask and you will receive, so that your joy may be complete. John 16:24"], ["prayer", "O gentle Savior, the one who takes fear away, draw near to us. In your mercy, clear our hearts and minds of the stresses of today, and grant us a small portion of your abundant joy. Amen."]], "245": [["dateVerse", "Friday, September 2", "Psalm 105:1-7", "Judges 14,15", "Luke 22:1–13"], ["watchD", "May God continue to bless us; let all the ends of the earth revere him. Psalm 67:7"], ["docT", "You are worthy, our Lord and God, to receive glory and honor and power, for you created all things, and by your will they existed and were created. Revelation 4:11"], ["prayer", "Creator God, through whom we live, and move, and have our being, we praise you. For your presence ever near, we thank you. Because your love knows no bounds, we adore you. Bless and keep us today and every day. Amen."]], "246": [["dateVerse", "Saturday, September 3", "Psalm 105:8-15", "Judges 16,17", "Luke 22:14–23"], ["watchD", "The secret things belong to the Lord our God, but the revealed things belong to us and to our children forever. Deuteronomy 29:29"], ["docT", "Jesus prayed: I made your name known to them, and I will make it known, so that the love with which you have loved me may be in them, and I in them. John 17:26"], ["prayer", "God incarnate, you revealed yourself to us out of your deep love for us. You humbled yourself and became obedient to the point of death, even death on a cross. Preserve us then, in this great love, and continue to make your will known to us, as we offer ourselves in service unto your purpose. Amen."]], "247": [["watchO", "Thirteenth Sunday after Pentecost Watchword for the week — Choose life so that you and your descendants may live, loving the Lord your God, obeying him, and holding fast to him. Deuteronomy 30:19,20"], ["dateVerse", "Sunday, September 4", "Proverbs 25:6-7", "Psalm 112", "Hebrews 13:1-8,15-16", "Luke 14:1,7-14"], ["watchD", "You, O Lord, do not be far away! O my help, come quickly to my aid! Psalm 22:19"], ["docT", "We know that he hears us. 1 John 5:15"], ["prayer", "Gracious Lamb, whom we have pledged to follow, we offer our hearts to you. We thank you, because in our most desperate hour, you have never left us. Still our hearts and help us remember that, even before we pray, your saving work has already begun. Amen."]], "248": [["dateVerse", "Monday, September 5", "Psalm 105:16-22", "Judges 18", "Luke 22:24–38"], ["watchD", "Can a woman forget her nursing-child, or show no compassion for the child of her womb? Even these may forget, yet I will not forget you. Isaiah 49:15"], ["docT", "So we can say with confidence, “The Lord is my helper; I will not be afraid.” Hebrews 13:6"], ["prayer", "God, our help in ages past, we praise you because you are faithful to us. We pray for help to remember that we should never be afraid, because you are always with us, until the end of the age. Amen."]], "249": [["dateVerse", "Tuesday, September 6", "Psalm 105:23-36", "Judges 19", "Luke 22:39–51"], ["watchD", "To the Lord our God belong mercy and forgiveness. Daniel 9:9"], ["docT", "All the tax collectors and sinners were coming near to listen to him. Luke 15:1"], ["prayer", "Christ Jesus, you came for us sinners; we offer our thanks to you. Keep us in everlasting fellowship with the Holy Trinity and open our ears to hear all of the blessings you have to offer. Amen."]], "250": [["dateVerse", "Wednesday, September 7", "Psalm 105:37-45", "Judges 20:1–31", "Luke 22:52–62"], ["watchD", "How lovely is your dwelling place, O Lord of hosts! Psalm 84:1"], ["docT", "Where two or three are gathered in my name, I am there among them. Matthew 18:20"], ["prayer", "Most gracious and loving Friend, in the assemblies of your body, you are there with us. Today we pray for a closer walk with you. Bless our gatherings with your Spirit, and dwell within our hearts wherever we go. Amen."]], "251": [["dateVerse", "Thursday, September 8", "Psalm 106:1-5", "Judges 20:32–21:25", "Luke 22:63–71"], ["watchD", "See, I am sending my messenger to prepare the way before me. Malachi 3:1"], ["docT", "And the Spirit immediately drove him out into the wilderness. He was in the wilderness forty days, tempted by Satan; and he was with the wild beasts; and the angels waited on him. Mark 1:12-13"], ["prayer", "In the coming of John the Baptist, the good news of our Savior was proclaimed. Spirit of the living God, come to us now. Help us to continue to proclaim and seek good news in our own lives and in the lives of others. Amen."]], "252": [["dateVerse", "Friday, September 9", "Psalm 106:6-12", "Ruth 1", "Luke 23:1–12"], ["watchD", "Heal me, O Lord, and I shall be healed; save me, and I shall be saved. Jeremiah 17:14"], ["docT", "Those who are well have no need of a physician, but those who are sick; I have come to call not the righteous but sinners. Mark 2:17"], ["prayer", "Forgiving God, have mercy on us sinners. We are all in need of your healing touch in every moment of our lives. May your presence be made more apparent today, and moving forward, as we seek to follow your loving example and forgive others as well. Amen."]], "253": [["dateVerse", "Saturday, September 10", "Psalm 106:13-23", "Ruth 2,3", "Luke 23:13–31"], ["watchD", "Daniel went home to his upstairs room where the windows opened toward Jerusalem. Three times a day he got down on his knees and prayed, giving thanks to his God. Daniel 6:10 NIV"], ["docT", "Rejoice in hope, be patient in suffering, persevere in prayer. Romans 12:12"], ["prayer", "God of comfort, God of care, in your mercy, hear our prayer. Grant us the courage to journey through life and grant us the wisdom to always keep in mind your haste in coming to our aid. Amen."]], "254": [["info", "Fourteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The sacrifice acceptable to God is a broken spirit; a broken and contrite heart, O God, you will not despise. Psalm 51:17"], ["dateVerse", "Sunday, September 11", "Exodus 32:7-14", "Psalm 51:1-10", "1 Timothy 1:12-17", "Luke 15:1-10"], ["watchD", "Saul said to David, “Who has ever found an enemy, and sent the enemy safely away? So may the Lord reward you with good for what you have done to me this day.” 1 Samuel 24:19"], ["docT", "Do not repay anyone evil for evil, but take thought for what is noble in the sight of all. Romans 12:17"], ["prayer", "Merciful and gracious God, slow to anger and abounding in steadfast love, may your presence grow nearer to us every day. In all that we say and do, may we reflect your will for peace, compassion, and care for all, even those who wrong us. Amen."]], "255": [["dateVerse", "Monday, September 12", "Psalm 106:24-31", "Ruth 4", "Luke 23:32–43"], ["watchD", "Things that we have heard and known, that our ancestors have told us—we will not hide them from their children. Psalm 78:3-4"], ["docT", "Freely you have received; freely give. Matthew 10:8 NIV"], ["prayer", "Lord of all, help us to serve you. May we never feel ashamed to share and spread your good news, as have those that have gone before us. Let our words and actions bring love and new life to those who need it. Amen."]], "256": [["dateVerse", "Tuesday, September 13", "Psalm 106:32-39", "1 Samuel 1:1–2:11", "Luke 23:44–56"], ["watchD", "The Lord is my strength and my song; and he has become my salvation. Psalm 118:14 NKJV"], ["docT", "May the God of hope fill you with all joy and peace in believing, so that you may abound in hope by the power of the Holy Spirit. Romans 15:13"], ["prayer", "God of salvation, hear our cry! In your love for us, bring us into the hope of believing, and the trust of knowing that you give us all that we need to keep moving. May we never forget the strength this fact offers. Amen."]], "257": [["dateVerse", "Wednesday, September 14", "Psalm 106:40-48", "1 Samuel 2:12–36", "Luke 24:1–12"], ["watchD", "God said, “In distress you called, and I rescued you.” Psalm 81:7"], ["docT", "But the Lord stood by me and gave me strength. 2 Timothy 4:17"], ["prayer", "Dearest Jesus, when we can no longer stand, you are there to hold us up. Dispel the fear from our hearts and strengthen us, so that we may once again walk on our own. May we not forget that you are always there to catch us. Amen."]], "258": [["dateVerse", "Thursday, September 15", "Psalm 107:1-9", "1 Samuel 3,4", "Luke 24:13–27"], ["watchD", "Rash words are like sword thrusts, but the tongue of the wise brings healing. Proverbs 12:18"], ["docT", "Let us then pursue what makes for peace and for mutual upbuilding. Romans 14:19"], ["prayer", "Lead us and guide us, O God, to beat our swords into plowshares and spears into pruning hooks. Make of us your peacemakers. Let all that we say and do be pleasing in your sight to form a healing stream for our neighbors and the world. Amen."]], "259": [["info", "Ministers’ Covenant Day† "], ["dateVerse", "Friday, September 16", "Psalm 107:10-16", "1 Samuel 5:1–7:1", "Luke 24:28–35"], ["watchD", "My people will abide in a peaceful habitation, in secure dwellings. Isaiah 32:18"], ["docT", "So then you are no longer strangers and aliens, but you are citizens with the saints and also members of the household of God, built upon the foundation of the apostles and prophets, with Christ Jesus himself as the cornerstone. Ephesians 2:19-20"], ["prayer", "Covenanting God, in your love for us, you have given us the opportunity to know you and each other. Help us to stay mindful of the foundation that has been built for us, and assist us as we continue construction toward the establishment of your kingdom. Amen."], ["info", "† During a synodal conference in London, Jesus Christ was recognized as chief elder of the Brethren’s Church. The day is observed as a covenanting day for servants of the church."]], "260": [["dateVerse", "Saturday, September 17", "Psalm 107:17-22", "1 Samuel 7:2–8:22", "Luke 24:36–53"], ["watchD", "Righteousness and justice are the foundation of your throne; steadfast love and faithfulness go before you. Psalm 89:14"], ["docT", "As God’s chosen ones, holy and beloved, clothe yourselves with compassion, kindness, humility, meekness, and patience. Colossians 3:12"], ["prayer", "Faithful God, we praise you because your mercy is never far from us. Fill our hearts, we pray, with your compassion, and direct us, so that we may move forward as messengers and vessels of your steadfast love. Amen."]], "261": [["info", "Fifteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — From the rising of the sun to its setting the name of the Lord is to be praised. Psalm 113:3"], ["dateVerse", "Sunday, September 18", "Amos 8:4-7", "Psalm 113", "1 Timothy 2:1-7", "Luke 16:1-13"], ["watchD", "At the command of the Lord the Israelites would set out, and at the command of the Lord they would camp. Numbers 9:18"], ["docT", "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him. Colossians 3:17"], ["prayer", "Glorious Savior, your name is above all others. Dedicate us today as we pray for a life committed to following you in both word and deed. Let our lives be a prayer of thanksgiving to God the Father, through you. Amen."]], "262": [["dateVerse", "Monday, September 19", "Psalm 107:23-32", "1 Samuel 9", "John 1:1–13"], ["watchD", "The Lord works vindication and justice for all who are oppressed. Psalm 103:6"], ["docT", "I have come as light into the world, so that everyone who believes in me should not remain in the darkness. John 12:46"], ["prayer", "Redeemer God, you came, not to embolden those in power, but to break the rod of the oppressor. Help us, we pray, to speak out against injustice, even if it does not affect us directly. May we always strive to care for the least of these alongside you. Amen."]], "263": [["dateVerse", "Tuesday, September 20", "Psalm 107:33-43", "1 Samuel 10", "John 1:14–28"], ["watchD", "I have put my spirit upon my servant; he will bring forth justice to the nations. Isaiah 42:1"], ["docT", "You know that among the Gentiles those whom they recognize as their rulers lord it over them, and their great ones are tyrants over them. But it is not so among you; but whoever wishes to become great among you must be your servant. Mark 10:42-43"], ["prayer", "Holy Spirit, advocate of the ages, we offer our most heartfelt thanks to you. You have been with all people in all times and shown your justice true. Lead us into the same service, for after your example, we pursue. Amen."]], "264": [["dateVerse", "Wednesday, September 21", "Psalm 108:1-5", "1 Samuel 11,12", "John 1:29–42"], ["watchD", "Sing praises to the Lord, for he has done gloriously; let this be known in all the earth. Isaiah 12:5"], ["docT", "When Paul and Barnabas arrived in Antioch, they called the church together and related all that God had done with them, and how he had opened a door of faith for the Gentiles. Acts 14:27"], ["prayer", "Glory to you, O God, for all of your works are worthy of praise! Help us, we pray, to always remember how you work in our lives and in the lives of others. Your compassion knows no bounds, and we offer our thanks unto you. Amen."]], "265": [["dateVerse", "Thursday, September 22", "Psalm 108:6-13", "1 Samuel 13", "John 1:43–51"], ["watchD", "Who is as mighty as you, O Lord? Your faithfulness surrounds you. Psalm 89:8"], ["docT", "I pray that the God of our Lord Jesus Christ, the Father of glory, may give you a spirit of wisdom and revelation as you come to know him. Ephesians 1:17"], ["prayer", "May we know you, O Lord. In you and through you all things exist and have come to be. Grant us courage to seek your face, we pray. May we always remember your faithfulness to us and all your creation. Amen."]], "266": [["dateVerse", "Friday, September 23", "Psalm 109:1-7", "1 Samuel 14:1–40", "John 2:1–11"], ["watchD", "It has pleased the Lord to make you a people for himself. 1 Samuel 12:22"], ["docT", "By grace you have been saved through faith, and this is not your own doing; it is the gift of God. Ephesians 2:8"], ["prayer", "Praise to you, Lord Jesus Christ, for through no merit of our own, we inherit the gift of life through your great sacrifice. Help us, we pray, today and every day, to live into such a glorious gift. Amen."]], "267": [["dateVerse", "Saturday, September 24", "Psalm 109:8-20", "1 Samuel 14:41–15:23", "John 2:12–25"], ["watchD", "I will punish the people who rest complacently on their dregs, those who say in their hearts, ‘The Lord will not do good, nor will he do harm.’ Zephaniah 1:12"], ["docT", "You say, ‘I am rich, I have prospered, and I need nothing.’ You do not realize that you are wretched, pitiable, poor, blind, and naked. Therefore I counsel you to buy from me gold refined by fire so that you may be rich; and white robes to clothe you and to keep the shame of your nakedness from being seen; and salve to anoint your eyes so that you may see. Revelation 3:17-18"], ["prayer", "God of forgiveness, when we miss the mark, your love makes room for our error. Because of your great compassion, we can keep trying, striving to live into your will. May we find new ways to do so today. Amen."]], "268": [["info", "Sixteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — There is great gain in godliness combined with contentment. 1 Timothy 6:6"], ["dateVerse", "Sunday, September 25", "Amos 6:1a,4-7", "Psalm 146", "1 Timothy 6:6-19", "Luke 16:19-31"], ["watchD", "The Lord will not let your foot slip—he who watches over you will not slumber. Psalm 121:3 NIV"], ["docT", "Our Lord Jesus Christ will also strengthen you to the end. 1 Corinthians 1:7-8"], ["prayer", "Guide our feet, Lord, while we run the race set before us. Help us to always trust in you, knowing that, even in the most difficult times, you will not let us stumble. Grant us the strength to move forward today and every day. Amen."]], "269": [["dateVerse", "Monday, September 26", "Psalm 109:21-31", "1 Samuel 15:24–16:13", "John 3:1–15"], ["watchD", "Restore me, and I will return, because you are the Lord my God. Jeremiah 31:18 NIV"], ["docT", "Jesus said to Thomas, “Put your finger here and see my hands. Reach out your hand and put it in my side. Do not doubt but believe.” John 20:27"], ["prayer", "Restoring God, source of harmony, we praise you! Every time we walk away from you, you invite us back with open arms. Keep us constant in our faith, we pray. Help us not to stray, but to obey your compassionate call. Amen."]], "270": [["dateVerse", "Tuesday, September 27", "Psalm 110", "1 Samuel 16:14–17:31", "John 3:16–26"], ["watchD", "The people who know their God will be strong and take action. Daniel 11:32 NASB"], ["docT", "By faith Moses, when he was grown up, refused to be called a son of Pharaoh’s daughter. Hebrews 11:24"], ["prayer", "Like Moses, Lord, grant us strength to do what is pleasing in your sight. Let us stand up for all of your children, and help to set them free. Show us the way, divine teacher. Amen."]], "271": [["dateVerse", "Wednesday, September 28", "Psalm 111", "1 Samuel 17:32–58", "John 3:27–36"], ["watchD", "The Lord has comforted his people, he has redeemed Jerusalem. Isaiah 52:9"], ["docT", "The darkness is passing away and the true light is already shining. 1 John 2:8"], ["prayer", "Lamb of God, who takes away the sin of the world, have mercy on us. According to your will, bring us closer to you every day. May our faith in you always lead to works of love that mirror your own. Amen."]], "272": [["dateVerse", "Thursday, September 29", "Psalm 112", "1 Samuel 18:1–19:7", "John 4:1–26"], ["watchD", "Joshua fell on his face to the earth and worshiped, and he said to him, “What do you command your servant, my Lord?” Joshua 5:1"], ["docT", "Jesus knelt down, and prayed, “Father, if you are willing, remove this cup from me; yet, not my will but yours be done.” Then an angel from heaven appeared to him and gave him strength. Luke 22:41-43"], ["prayer", "Christ, who taught us how to pray, draw near to your servants. In your mercy, give us but a small portion of the faith you showed in your earthly ministry, and lead us into right relationships with you and our neighbors. Hear our prayer, Chief Elder dear. Amen."]], "273": [["dateVerse", "Friday, September 30", "Psalm 113", "1 Samuel 19:8–20:17", "John 4:27–38"], ["watchD", "A thousand years in your sight are like yesterday when it is past, or like a watch in the night. Psalm 90:4"], ["docT", "His mercy is for those who fear him from generation to generation. Luke 1:50"], ["prayer", "God of all time, we praise you, for you have walked with us through each generation. We thank you for the gifts of those who have gone before us, and we thank you for being a God who is always with us. Amen."]], "274": [["dateVerse", "Saturday, October 1", "Psalm 114", "1 Samuel 20:18–21:9", "John 4:39–42"], ["watchD", "Upon him was the punishment that made us whole. Isaiah 53:5"], ["docT", "Christ himself bore our sins in his body on the cross, so that, free from sins, we might live for righteousness. 1 Peter 2:24"], ["prayer", "Gracious Lord, gratitude fills our hearts for your gift of salvation. As we joyfully receive your gift, inspire us to share the good news with our neighbors, both with our lips and through our lives. Amen."]], "275": [["info", "Seventeenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Commit your way to the Lord; trust in him, and he will act. Psalm 37:5"], ["dateVerse", "Sunday, October 2", "Habakkuk 1:1-4,2:1-4", "Psalm 37:1-9", "2 Timothy 1:1-14", "Luke 17:5-10"], ["watchD", "Woe to him who piles up stolen goods and makes himself wealthy by extortion! How long must this go on? Habakkuk 2:6 NIV"], ["docT", "Take care! Be on your guard against all kinds of greed; for one’s life does not consist in the abundance of possessions. Luke 12:15"], ["prayer", "Creator God, we thank you for the vast blessings you have lavished on your creation. Remove from us the fears that drive us to claim more than we need, thus robbing others of life-sustaining resources. Amen."]], "276": [["dateVerse", "Monday, October 3", "Psalm 115:1-8", "1 Samuel 21:10–22:23", "John 4:43–54"], ["watchD", "Woe to you who strive with your Maker, earthen vessels with the potter! Does the clay say to the one who fashions it, “What are you making?” Isaiah 45:9"], ["docT", "Our Father in heaven, hallowed be your name. Your kingdom come. Your will be done, on earth as it is in heaven. Matthew 6:9-10"], ["prayer", "Awesome God, we are frail creatures of dust yet your beloved children. Help us to keep that sacred balance between awe of your majesty and gratitude for being able to say, “Abba, Father.” Through Jesus Christ, our Savior. Amen."]], "277": [["dateVerse", "Tuesday, October 4", "Psalm 115:9-18", "1 Samuel 23", "John 5:1–15"], ["watchD", "The Lord executes justice for the orphan and the widow, and loves the strangers, providing them food and clothing. You shall also love the stranger. Deuteronomy 10:18-19"], ["docT", "I was a stranger and you welcomed me. Matthew 25:35"], ["prayer", "Loving Lord, make us mindful of the opportunities given to us each day to be kind to those who may be feeling unwelcome because they are different from us. Give us courage to truly act as your representatives. Amen."]], "278": [["dateVerse", "Wednesday, October 5", "Psalm 116:1-7", "1 Samuel 24:1–25:17", "John 5:16–30"], ["watchD", "The days are surely coming, says the Lord, when I will make a new covenant with the house of Israel and the house of Judah. Jeremiah 31:31"], ["docT", "They are Israelites, and to them belong the adoption, the glory, the covenants, the giving of the law, the worship, and the promises; to them belong the patriarchs, and from them, according to the flesh, comes the Messiah. Romans 9:4-5"], ["prayer", "Promise-keeping God, we extol your faithfulness throughout all generations. Enable us to be loyal partners with you, and so reveal your steadfast love and mercy to those who are seeking a sure foundation. Amen."]], "279": [["dateVerse", "Thursday, October 6", "Psalm 116:8-14", "1 Samuel 25:18–44", "John 5:31–47"], ["watchD", "The ways of the Lord are right, and the upright walk in them, but transgressors stumble in them. Hosea 14:9"], ["docT", "Therefore encourage one another and build up each other, as indeed you are doing. 1 Thessalonians 5:11"], ["prayer", "Merciful Lord, we confess that we have often been disobedient. As a result, our growth is stunted and the world languishes in despair. We have been challenged; arouse us to right living, O Holy Spirit of God. Amen."]], "280": [["dateVerse", "Friday, October 7", "Psalm 116:15-19", "1 Samuel 26,27", "John 6:1–15"], ["watchD", "His anger is but for a moment; his favor is for a lifetime. Weeping may linger for the night, but joy comes with the morning. Psalm 30:5"], ["docT", "We even boast in God through our Lord Jesus Christ, through whom we have now received reconciliation. Romans 5:11"], ["prayer", "Lord, we sometimes feel overwhelmed by the challenges of daily life, yet each day brings new evidence of your faithfulness. We heartily confess that it is in you that we find our hope, joy, and peace. Through Jesus Christ, we pray. Amen."]], "281": [["dateVerse", "Saturday, October 8", "Psalm 117", "1 Samuel 28,29", "John 6:16–24"], ["watchD", "See, the former things have come to pass, and new things I now declare; before they spring forth, I tell you of them. Isaiah 42:9"], ["docT", "Many prophets and righteous people longed to see what you see, but did not see it, and to hear what you hear, but did not hear it. Matthew 13:17"], ["prayer", "When we cannot see your work in our lives, grant us vision, O Lord. When we refuse to see your worth and tell of your salvation, pardon us, O Lord. Revive us through the power of your Holy Spirit. Amen."]], "282": [["info", "Eighteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — If we have died with him, we will also live with him. 2 Timothy 2:11"], ["dateVerse", "Sunday, October 9", "2 Kings 5:1-3,7-15c", "Psalm 111", "2 Timothy 2:8-15", "Luke 17:11-19"], ["watchD", "The Lord said to Moses, “I will raise up for them a prophet like you from among their own people; I will put my words in the mouth of the prophet.” Deuteronomy 18:18"], ["docT", "Just as we have been approved by God to be entrusted with the message of the gospel, even so we speak, not to please mortals, but to please God who tests our hearts. 1 Thessalonians 2:4"], ["prayer", "Dear Lord, we want to clearly identify your voice and hear you when you speak. Above all, give us the grace to understand your will, and the audacity to speak truth in your name. Amen."]], "283": [["dateVerse", "Monday, October 10", "Psalm 118:1-9", "1 Samuel 30,31", "John 6:25–42"], ["watchD", "You shall keep my commandments and observe them: I am the Lord. Leviticus 22:31"], ["docT", "You shine as lights in the world, holding fast the word of life. Philippians 2:15-16 NKJV"], ["prayer", "We praise you, Lord, for the confidence that you have placed in us mere earthen vessels, yet bearers of your love and life. When we fail, help us to rise again in your strength to labor for you. Amen."]], "284": [["dateVerse", "Tuesday, October 11", "Psalm 118:10-14", "1 Samuel 1", "John 6:43–51"], ["watchD", "Look down from your holy habitation, from heaven, and bless your people Israel. Deuteronomy 26:15"], ["docT", "Simeon said, “My eyes have seen your salvation, which you have prepared in the presence of all peoples, a light for revelation to the Gentiles and for glory to your people Israel.” Luke 2:30-32"], ["prayer", "Lord, open our eyes that we may see, our ears that we may hear; make us acutely aware that you are here and everywhere. As we experience you each day, open our lips to magnify your holy name. Amen."]], "285": [["dateVerse", "Wednesday, October 12", "Psalm 118:15-21", "2 Samuel 2", "John 6:52–59"], ["watchD", "From the west, people will fear the name of the Lord, and from the rising of the sun, they will revere his glory. Isaiah 59:19 NIV"], ["docT", "Jesus said, “Then people will come from east and west, from north and south, and will eat in the kingdom of God. Indeed, some are last who will be first, and some are first who will be last.” Luke 13:29-30"], ["prayer", "With our whole being, we magnify you, Lord. You have been our safe harbor in the turmoil of our world. We acknowledge that you have rescued us from the power of sin. All glory belongs to you. Amen."]], "286": [["dateVerse", "Thursday, October 13", "Psalm 118:22-29", "2 Samuel 3:1–34", "John 6:60–71"], ["watchD", "Restore us to yourself, O Lord, that we may be restored; renew our days as of old. Lamentations 5:21"], ["docT", "When the goodness and loving kindness of God our Savior appeared, he saved us, not because of any works of righteousness that we had done, but according to his mercy, through the water of rebirth and renewal by the Holy Spirit. Titus 3:4-5"], ["prayer", "Restoring, transforming Lord, we praise you for the gift of rebirth that you offer to us each day. We receive it with joy and share it with a world in need. Amen."]], "287": [["dateVerse", "Friday, October 14", "Psalm 119:1-8", "2 Samuel 3:35–5:16", "John 7:1–13"], ["watchD", "O Lord of hosts, you are God, you alone, of all the kingdoms of the earth; you have made heaven and earth. Isaiah 37:16"], ["docT", "Paul wrote: For this reason I kneel before the Father, from whom every family in heaven and on earth derives its name. I pray that out of his glorious riches he may strengthen you. Ephesians 3:14-16 NIV"], ["prayer", "Creator God, we are blessed to be a part of your family. Inspire us with your love, that we may willingly invite others to feast at the table that you have prepared for all humankind. For Christ’s sake. Amen."]], "288": [["dateVerse", "Saturday, October 15", "Psalm 119:9-16", "2 Samuel 5:17–6:23", "John 7:14–24"], ["watchD", "I will look to the Lord, I will wait for the God of my salvation; my God will hear me. Micah 7:7"], ["docT", "Set your minds on things that are above, not on things that are on earth. Colossians 3:2"], ["prayer", "Almighty God, it is on you that we depend. Forgive us when our conceit leads us to think that we rule our own destiny. In humility, we look to see your footsteps, that we may walk in your ways. Amen."]], "289": [["watchO", "Nineteenth Sunday after Pentecost Watchword for the week — Proclaim the message; be persistent whether the time is favorable or unfavorable; convince, rebuke, and encourage, with the utmost patience in teaching. 2 Timothy 4:2"], ["dateVerse", "Sunday, October 16", "Genesis 32:22-31", "Psalm 121", "2 Timothy 3:14-4:5", "Luke 18:1-8"], ["watchD", "You must not distort justice; you must not show partiality; and you must not accept bribes, for a bribe blinds the eyes of the wise and subverts the cause of those who are in the right. Deuteronomy 16:19"], ["docT", "How can you believe when you accept glory from one another and do not seek the glory that comes from the one who alone is God? John 5:44"], ["prayer", "God of creation, teach us that we cannot glorify you when we are contributors to injustice, oppression, and the destruction of your creation. Search our hearts and lead us to truth, that we, and our world, may be healed. Amen."]], "290": [["dateVerse", "Monday, October 17", "Psalm 119:17-24", "2 Samuel 7", "John 7:25–44"], ["watchD", "You shall not covet your neighbor’s wife. Deuteronomy 5:21 NIV"], ["docT", "This is love, that we walk according to his commandments. 2 John 6"], ["prayer", "Remind us today, Lord, that when we earnestly desire to serve, your commands become a delight to live by. Generate within us true love for you, that we may serve you and show your loving care to our neighbor. Amen."]], "291": [["dateVerse", "Tuesday, October 18", "Psalm 119:25-32", "2 Samuel 8,9", "John 7:45–52"], ["watchD", "The Lord kills and brings to life; he brings down to Sheol and raises up. 1 Samuel 2:6"], ["docT", "“I am the Alpha and the Omega,” says the Lord God, who is and who was and who is to come, the Almighty. Revelation 1:8"], ["prayer", "Lord, we acknowledge that you are the ruler of this world. Therefore, we have cause to rejoice in the present and have hope for the future. Lift our spirits, that we may go forth with songs of praise. Amen."]], "292": [["dateVerse", "Wednesday, October 19", "Psalm 119:33-40", "2 Samuel 10,11", "John 8:1–11"], ["watchD", "Make haste to help me, O Lord, my salvation. Psalm 38:22"], ["docT", "The blind Bartimaeus cried out, “Son of David, have mercy on me!” Jesus stood still and said, “Call him here.” Mark 10:48-49"], ["prayer", "God of love, mercifully hear our cry for the healing of our bodies, minds, and spirits. Restore us and the communities in which we live and work, that our transformation may testify of your care and honor you. Amen."]], "293": [["dateVerse", "Thursday, October 20", "Psalm 119:41-48", "2 Samuel 12", "John 8:12–30"], ["watchD", "I will give thanks to you, O Lord, for though you were angry with me, your anger turned away, and you comforted me. Isaiah 12:1"], ["docT", "Jesus said, “I have come to call not the righteous but sinners.” Matthew 9:13"], ["prayer", "Lord, we thank you for salvation through Jesus Christ, and for your lovingkindness and steadfast mercy that is given to us anew each day. Help us to bask in your love, and to exemplify its sacrificial nature, always. Amen."]], "294": [["dateVerse", "Friday, October 21", "Psalm 119:49-56", "2 Samuel 13:1–33", "John 8:31–41"], ["watchD", "The Lord has sent me to provide for those who mourn in Zion—to give them a garland instead of ashes, the oil of gladness instead of mourning, the mantle of praise instead of a faint spirit. Isaiah 61:1,3"], ["docT", "The son said to him, ‘Father, I have sinned against heaven and before you; I am no longer worthy to be called your son.’ But the father said to his slaves, ‘Quickly, bring out a robe—the best one—and put it on him.’ Luke 15:21-22"], ["prayer", "Merciful Lord, supply us with your grace sufficient for our needs today. As we receive your bounty, show us how to extend your grace to everyone under all circumstances. In the name of Jesus Christ. Amen."]], "295": [["dateVerse", "Saturday, October 22", "Psalm 119:57-64", "2 Samuel 13:34–14:33", "John 8:42–59"], ["watchD", "We do not know what to do, but our eyes are on you. 2 Chronicles 20:12"], ["docT", "Let us look to Jesus the pioneer, and perfecter of our faith. Hebrews 12:2"], ["prayer", "We confess that we are easily distracted from our focus on you, Lord. Narrow our thoughts to those things that are honorable, true, lovely, just, pure, excellent, and praiseworthy, and use them to order our actions each day. Amen."]], "296": [["info", "Twentieth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “All who exalt themselves will be humbled, but all who humble themselves will be exalted.” Luke 18:14"], ["dateVerse", "Sunday, October 23", "Jeremiah 14:7-10,19-22", "Psalm 84:1-7", "2 Timothy 4:6-8,16-18", "Luke 18:9-14"], ["watchD", "To the wicked God says: “What right have you to recite my statutes, or take my covenant on your lips? For you hate discipline, and you cast my words behind you.” Psalm 50:16-17"], ["docT", "But those who look into the perfect law, the law of liberty, and persevere, being not hearers who forget but doers who act—they will be blessed in their doing. James 1:25"], ["prayer", "Through the saving grace offered to us in Jesus Christ, we come in penitence before you, O Lord, seeking cleansing and renewal. Then, in your mercy, send us forth once more to labor for your sake. Amen."]], "297": [["dateVerse", "Monday, October 24", "Psalm 119:65-72", "2 Samuel 15:1–29", "John 9:1–12"], ["watchD", "You [our God] have been just in all that has come upon us, for you have dealt faithfully and we have acted wickedly. Nehemiah 9:33"], ["docT", "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9"], ["prayer", "Hear us, O Lord, and forgive us for our sins. Mercifully extend your love to us and help us face the truth of our rebelliousness. Teach us and enable us to extend this same mercy to our neighbor. Amen."]], "298": [["dateVerse", "Tuesday, October 25", "Psalm 119:73-80", "2 Samuel 15:30–16:23", "John 9:13–34"], ["watchD", "The Lord said to Jonah, ‘Is it right for you to be angry?’ Jonah 4:4"], ["docT", "If anyone is detected in a transgression, you who have received the Spirit should restore such a one in a spirit of gentleness. Take care that you yourselves are not tempted. Galatians 6:1"], ["prayer", "There are times, O Lord, when we do not understand what you are doing and how we are to be involved in your work. At such times, we ask for wisdom to balance patience and faithful service. Amen."]], "299": [["dateVerse", "Wednesday, October 26", "Psalm 119:81-88", "2 Samuel 17", "John 9:35–41"], ["watchD", "Rise up, O God, judge the earth; for all the nations belong to you! Psalm 82:8"], ["docT", "Indeed, God did not send the Son into the world to condemn the world, but in order that the world might be saved through him. John 3:17"], ["prayer", "Almighty God, you rule with love and justice. We come like eager children wanting to labor for you. Through your enabling grace, guide and equip us lest we falter or trip along the way. May your kingdom come. Amen."]], "300": [["dateVerse", "Thursday, October 27", "Psalm 119:89-96", "2 Samuel 18:1–30", "John 10:1–10"], ["watchD", "Know therefore that the Lord your God is God; he is the faithful God, keeping his covenant of love to a thousand generations of those who love him and keep his commandments. Deuteronomy 7:9 NIV"], ["docT", "Let us hold fast to the confession of our hope without wavering, for he who has promised is faithful. Hebrews 10:23"], ["prayer", "Covenant-keeping God, where you have remained faithful, we have often proved faithless; where you have been steadfast, we have often looked for a way out of serving you. In your mercy, forgive us and help us once more. Amen."]], "301": [["dateVerse", "Friday, October 28", "Psalm 119:97-104", "2 Samuel 18:31–19:30", "John 10:11–21"], ["watchD", "Children, who do not know this law, must hear it and learn to fear the Lord your God as long as you live. Deuteronomy 31:13 NIV"], ["docT", "Glory and honor and peace for everyone who does good, the Jew first and also the Greek. For God shows no partiality. Romans 2:10-11"], ["prayer", "God of grace, we are thankful for the resources given to us that offer us insight into your will. Help us to wisely utilize them to expand knowledge of your plan of restoration for creation. Mercifully guide us. Amen."]], "302": [["dateVerse", "Saturday, October 29", "Psalm 119:105-112", "2 Samuel 19:31–20:26", "John 10:22–33"], ["watchD", "Sing for joy, O heavens, and exult, O earth; break forth, O mountains, into singing! For the Lord has comforted his people, and will have compassion on his suffering ones. Isaiah 49:13"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation, who consoles us in all our affliction. 2 Corinthians 1:3-4"], ["prayer", "Such wondrous love and compassion abound in your presence, O Lord! Mercifully remind us today of our sacred obligation to be channels of your blessings, that the world may know you and glorify your name. Amen."]], "303": [["info", "Twenty-first Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “For the Son of Man came to seek and to save the lost.” Luke 19:10"], ["dateVerse", "Sunday, October 30", "Isaiah 1:10-18", "Psalm 32:1-7", "2 Thessalonians 1:1-4,11-12", "Luke 19:1-10"], ["watchD", "The Lord God is a sun and shield. Psalm 84:11"], ["docT", "Jesus said to the disciples, “Why are you afraid? Have you still no faith?” Mark 4:40"], ["prayer", "Amazing God, your faithfulness is without equal in all creation! Still the voices in our minds that whisper doubt and fear, and instill in us the constant faith that endows courage and inspires action. In your name, we pray. Amen."]], "304": [["dateVerse", "Monday, October 31", "Psalm 119:113-120", "2 Samuel 21", "John 10:34–42"], ["watchD", "Act with justice and righteousness, and deliver from the hand of the oppressor anyone who has been robbed. And do no wrong or violence to the alien, the orphan, and the widow. Jeremiah 22:3"], ["docT", "Let love be genuine; hate what is evil, hold fast to what is good. Romans 12:9"], ["prayer", "Lord of all humanity, we are conscious of your command to love and serve our neighbor. Forgive us for the times when we have been negligent and inspire us once more to go forth boldly, following your example of sacrifice. Amen."]], "305": [["info", "All Saints’ Day"], ["watchO", "Watchword for All Saints’ Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Tuesday, November 1", "Psalm 119:121-128", "2 Samuel 22:1–25", "John 11:1–16"], ["specialVerse", "All Saints’ Day", "Daniel 7:1-3,15-18", "Psalm 149", "Ephesians 1:11-23", "Luke 6:20-31"], ["watchD", "Sing and rejoice, O daughter Zion! For lo, I will come and dwell in your midst, says the Lord. Zechariah 2:10"], ["docT", "Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them. Luke 1:68"], ["prayer", "Redeeming God, we rejoice in your coming to us, saving us by your sacrifice, and dwelling within our hearts. Help us to continue the legacy of the saints before us as we share your favor with the generations to come. Amen."]], "306": [["dateVerse", "Wednesday, November 2", "Psalm 119:129-136", "2 Samuel 22:26–23:17", "John 11:17–30"], ["watchD", "Why is light given to one in misery, and life to the bitter in soul, who long for death, but it does not come? Job 3:20-21"], ["docT", "As it is, we do not yet see everything in subjection to them. Hebrews 2:8"], ["prayer", "Great Creator, it can be a challenge to trust your timing. Not all are willing to turn to you. Help us see how we can be your light, leading others to you, until your whole creation is turned toward you. Amen."]], "307": [["dateVerse", "Thursday, November 3", "Psalm 119:137-144", "2 Samuel 23:18–24:25", "John 11:31–44"], ["watchD", "When I gather the people of Israel from the nations where they have been scattered, I will be proved holy through them in the sight of the nations. Ezekiel 28:25 NIV"], ["docT", "The gifts and the calling of God are irrevocable. Romans 11:29"], ["prayer", "Lord God, you call us to your work of ministry. You give us gifts, so that all will see your goodness and love. As those gathered into your body, the church, keep us open to your gifts, and make us willing to use them. Amen."]], "308": [["dateVerse", "Friday, November 4", "Psalm 119:145-152", "1 Kings 1:1–27", "John 11:45–57"], ["watchD", "Your words became to me a joy and the delight of my heart; for I am called by your name, O Lord, God of hosts. Jeremiah 15:16"], ["docT", "Jesus said, “If you keep my commandments, you will abide in my love.” John 15:10"], ["prayer", "Word Giver, through your messengers and through your son, we hear your commands. You call us by name, and ask that we follow your will. In doing so, we abide in love. Continue to lead us, now and always. Amen."]], "309": [["dateVerse", "Saturday, November 5", "Psalm 119:153-160", "1 Kings 1:28–53", "John 12:1–11"], ["watchD", "In your hand are power and might, so that no one is able to withstand you. 2 Chronicles 20:6"], ["docT", "I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord. Romans 8:38-39"], ["prayer", "Your love is so great, O God, that nothing can separate us from it; not one thing can withstand it. Help us to abide in that love. Let love give us the courage to share it with the world. Amen."]], "310": [["info", "Twenty-second Sunday after Pentecost"], ["watchO", "Watchword for the week — For I know that my Redeemer lives, and that at the last he will stand upon the earth. Job 19:25"], ["dateVerse", "Sunday, November 6", "Job 19:23-27a", "Psalm 17:1-9", "2 Thessalonians 2:1-5,13-17", "Luke 20:27-38"], ["watchD", "Holy, holy, holy is the Lord of hosts; the whole earth is full of his glory. Isaiah 6:3"], ["docT", "As he who called you is holy, be holy yourselves in all your conduct. 1 Peter 1:15"], ["prayer", "O holy One, your glory is seen all around us. You call us to be holy as you are holy. Help us, so that all we do and say brings you glory, and may that glory fill your world. Amen."]], "311": [["dateVerse", "Monday, November 7", "Psalm 119:161-168", "1 Kings 2:1–38", "John 12:12–19"], ["watchD", "Then a shoot will spring from the stem of Jesse, and a branch from his roots will bear fruit. Isaiah 11:1 NASB"], ["docT", "Christ said, “I am the root and the descendant of David, the bright morning star.” Revelation 22:16"], ["prayer", "Brightest and best Morning Star, through you, the great family of faith shares God’s light with the world. We are your fruit. Help us continue to share the light of your love. Amen."]], "312": [["dateVerse", "Tuesday, November 8", "Psalm 119:169-176", "1 Kings 2:39–3:28", "John 12:20–36"], ["watchD", "Do not say, ‘I am too young.’ You must go to everyone I send you to and say whatever I command you. Jeremiah 1:7 NIV"], ["docT", "Do not be afraid, but speak and do not be silent; for I am with you, and no one will lay a hand on you to harm you. Acts 18:9-10"], ["prayer", "Lord, it can be scary to go to those to whom you send us; scarier still to speak your word to them. Grant us courage to say what you would have us say, knowing you are with us. Amen."]], "313": [["dateVerse", "Wednesday, November 9", "Psalm 120", "1 Kings 4:1–28", "John 12:37–50"], ["watchD", "The earth will be full of the knowledge of the Lord as the waters cover the sea. Isaiah 11:9"], ["docT", "When the Spirit of truth comes, he will guide you into all the truth. John 16:13"], ["prayer", "Giver of wisdom, you have promised your knowledge to us through the gift of your Spirit. Send your truth to us, so that it may guide us in the way of justice and peace for all your children. Amen."]], "314": [["dateVerse", "Thursday, November 10", "Psalm 121", "1 Kings 4:29–5:18", "John 13:1–17"], ["watchD", "Nothing can hinder the Lord from saving by many or by few. 1 Samuel 14:6"], ["docT", "Therefore, do not throw away your confidence, which has a great reward. Hebrews 10:35 NASB"], ["prayer", "Saving God, you welcome those who turn to you, and rejoice when one who is lost, returns. You give us the strength to find confidence in our relationship with you. Our reward is your loving presence throughout eternity. Thank you! Amen."]], "315": [["dateVerse", "Friday, November 11", "Psalm 122", "1 Kings 6", "John 13:18–30"], ["watchD", "The Lord gave, and the Lord has taken away; blessed be the name of the Lord. Job 1:21"], ["docT", "We know that suffering produces perseverance; perseverance, character; and character, hope. Romans 5:3-4 NIV"], ["prayer", "Sometimes we feel deeply, Lord God, and wish for swift relief. Yet, you are in control. Help us to be patient, to know you are with us. With you, we grow in hope and character. Amen."]], "316": [["dateVerse", "Saturday, November 12", "Psalm 123", "1 Kings 7:1–33", "John 13:31–38"], ["watchD", "The ransomed of the Lord shall return, they shall obtain joy and gladness, and sorrow and sighing shall flee away. Isaiah 51:11"], ["docT", "God will wipe every tear from their eyes. Revelation 21:4"], ["prayer", "Caring Parent, you hurt when we hurt, and desire to bring us out of pain and grief into your eternal joy. When sorrows overwhelm, wrap your arms around us in comfort and love. Amen."]], "317": [["info", "The Chief Elder Festival†"], ["watchO", "Watchword for the week — Brothers and sisters, do not be weary in doing what is right. 2 Thessalonians 3:13"], ["dateVerse", "Sunday, November 13", "Malachi 4:1-2a", "Psalm 98", "2 Thessalonians 3:6-13", "Luke 21:5-19"], ["specialVerse", "The Chief Elder Festival†", "Ezekiel 34:11-16,23-24", "Psalm 8", "Hebrews 4:14-16", "John 10:1-10"], ["watchD", "Gideon said, “Lord, if now I have found favor with you, then show me a sign that it is you who speak with me.” Judges 6:17"], ["docT", "This is the confidence we have in approaching God: that if we ask anything according to his will, he hears us. 1 John 5:14 NIV"], ["prayer", "Chief Elder, through you, we find favor with God and are able to approach you with our requests. Help us to do so, seeking not our wants, but your will, so that we may bear witness and glorify you. Amen."], ["info", "† On this day in 1741, it was announced in all Moravian congregations that Jesus Christ had been chosen Chief Elder of the Moravian Church. The Moravian Church has had no single human chief executive since then, and now observes this as a festival day."]], "318": [["dateVerse", "Monday, November 14", "Psalm 124", "1 Kings 7:34–8:16", "John 14:1–14"], ["watchD", "Thus says the Lord God: Repent and turn away from your idols. Ezekiel 14:6"], ["docT", "Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God—what is good and acceptable and perfect. Romans 12:2"], ["prayer", "Gracious God, you ask us to turn away from that which would separate us from you. Help us to turn to you, and to be transformed by your love, so we may seek your will for us and your world. Amen."]], "319": [["dateVerse", "Tuesday, November 15", "Psalm 125", "1 Kings 8:17–53", "John 14:15–24"], ["watchD", "Samuel said to Saul, “Stop here yourself for a while, that I may make known to you the word of God.” 1 Samuel 9:27"], ["docT", "Blessed are your eyes, for they see, and your ears, for they hear. Matthew 13:16"], ["prayer", "You seek out ways to tell us, O God, of your greatness and blessings. Help us pause to use our eyes, ears, minds, and hearts to receive your word for us, today and every day. Amen."]], "320": [["dateVerse", "Wednesday, November 16", "Psalm 126", "1 Kings 8:54–9:19", "John 14:25–15:8"], ["watchD", "Truly, the fear of the Lord, that is wisdom; and to depart from evil is understanding. Job 28:28"], ["docT", "Consider whether the light in you is not darkness. Luke 11:35"], ["prayer", "Our awe of you begins a journey to understanding, O God, which brings us out of darkness into the light of your love. By your Spirit, we can examine what we need to change to live our lives for you. Help us grow in wisdom as we seek to know your will. Amen."]], "321": [["dateVerse", "Thursday, November 17", "Psalm 127", "1 Kings 9:20–10:29", "John 15:9–17"], ["watchD", "Return, O my soul, to your rest, for the Lord has dealt bountifully with you. Psalm 116:7"], ["docT", "Now may the Lord of peace himself give you peace at all times in all ways. 2 Thessalonians 3:16"], ["prayer", "God, even in the struggles of life, its discords and challenges, you offer us rest in the knowledge that you are with us at all times. This is the peace you offer. Through your presence in our church family, give us the support we need. Amen."]], "322": [["dateVerse", "Friday, November 18", "Psalm 128", "1 Kings 11:1–25", "John 15:18–16:4"], ["watchD", "The Lord said to Abram, “Go from your country and your kindred and your father’s house to the land that I will show you.” Genesis 12:1"], ["docT", "Become imitators of those who through faith and patience inherit the promises. Hebrews 6:12"], ["prayer", "Calling God, you ask us to be as faithful as those who came before us. Grant us the patience needed to do the work, as we await the glory to come. Amen."]], "323": [["dateVerse", "Saturday, November 19", "Psalm 129", "1 Kings 11:26–12:24", "John 16:5–16"], ["watchD", "The Lord has proclaimed to the end of the earth: Say to daughter Zion, “See, your salvation comes.” Isaiah 62:11"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ! By his great mercy he has given us a new birth into a living hope through the resurrection of Jesus Christ from the dead. 1 Peter 1:3"], ["prayer", "Saving God, in Jesus, we are given a new birth which grants us life forever with you. Through him, you fulfilled your promise of salvation. Thank you for the hope we receive, knowing that we can be with you beyond time and space. Amen."]], "324": [["info", "Reign of Christ"], ["watchO", "Watchword for the week — Be still, and know that I am God! I am exalted among the nations, I am exalted in the earth. Psalm 46:10"], ["dateVerse", "Sunday, November 20", "Jeremiah 23:1-6", "Psalm 46", "Colossians 1:11-20", "Luke 23:33-43"], ["watchD", "Return, O faithless children, says the Lord, for I am your master; I will take you, and I will bring you to Zion. Jeremiah 3:14"], ["docT", "The son set off and went to his father. But while he was still far off, his father saw him and was filled with compassion; he ran and put his arms around him and kissed him. Luke 15:20"], ["prayer", "Forgiving Father, you call us to return to you when we have strayed. You offer us compassion and forgiveness we don’t deserve. Thank you for your great love, your welcoming grace, and your desire to bring us home. Amen."]], "325": [["dateVerse", "Monday, November 21", "Psalm 130", "1 Kings 12:25–13:22", "John 16:17–33"], ["watchD", "We might humble ourselves before our God, to seek from Him the right way for us. Ezra 8:21 NKJV"], ["docT", "Jesus said, “I am the way, and the truth, and the life. No one comes to the Father except through me.” John 14:6"], ["prayer", "Way-giver, help us in humility to recognize your leadership in our lives. You seek to give us the truth and life. Open us up to your teachings, through Jesus, our Lord, and through the Holy Spirit within us. Amen."]], "326": [["dateVerse", "Tuesday, November 22", "Psalm 131", "1 Kings 13:23–14:20", "John 17:1–19"], ["watchD", "He guards the lives of his faithful; he rescues them from the hand of the wicked. Psalm 97:10"], ["docT", "As servants of God we have commended ourselves in every way: in beatings, imprisonments, riots, labors, sleepless nights, hunger; in honor and dishonor, in ill repute and good repute. We are treated as impostors, and yet are true; as unknown, and yet are well known; as dying, and see—we are alive. 2 Corinthians 6:4,5,8-9"], ["prayer", "Protecting God, in faithfulness, we seek to do your work in a world that can feel punishing; a world that may strike back when we stand up for your will. Continue to give us life in you and courage when needed. Amen."]], "327": [["dateVerse", "Wednesday, November 23", "Psalm 132", "1 Kings 14:21–15:8", "John 17:20–26"], ["watchD", "Lift up your heads, O gates! And be lifted up, O ancient doors! That the King of glory may come in. Psalm 24:7"], ["docT", "To all who received him, who believed in his name, he gave power to become children of God. John 1:12"], ["prayer", "Glorious God, you came with the power to bring us into your family as your children, yet, you leave the choice to us. Help us to be open to receiving you anew each day. Lift up our heads to see your love and welcome. Amen."]], "328": [["dateVerse", "Thursday, November 24", "Psalm 133", "1 Kings 15:9–16:14", "John 18:1–11"], ["watchD", "Thus says the Lord, “In a time of favor I have answered you, on a day of salvation I have helped you.” Isaiah 49:8"], ["docT", "For, in fact, the kingdom of God is among you. Luke 17:21"], ["prayer", "Reigning God, your kingdom of love and salvation is all around us. You hear our cries to be free from the things that would separate us from you, and have given us yourself through Jesus Christ. Thank you. Amen."]], "329": [["dateVerse", "Friday, November 25", "Psalm 134", "1 Kings 16:15–17:24", "John 18:12–24"], ["watchD", "The Lord gives the sun for light by day and the fixed order of the moon and the stars for light by night; he stirs up the sea so that its waves roar. Jeremiah 31:35"], ["docT", "For us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:6"], ["prayer", "We praise you, our true God, for the creation around us and the life it brings. We exist through you and for you. May the way we live be our response to the gift of life you give. Amen."]], "330": [["dateVerse", "Saturday, November 26", "Psalm 135:1-12", "1 Kings 18", "John 18:25–40"], ["watchD", "I walk before the Lord in the land of the living. Psalm 116:9"], ["docT", "He is God not of the dead, but of the living; for to him all of them are alive. Luke 20:38"], ["prayer", "In valleys of death, O God, you remind us that in you we live. Our living is not our own, but a gift that goes beyond this world into the life to come. Help us to walk with this knowledge, both here in this world and through eternity. Amen."]], "331": [["info", "First Sunday of Advent"], ["watchO", "Watchword for the week — Come, let us walk in the light of the Lord! Isaiah 2:5"], ["dateVerse", "Sunday, November 27", "Isaiah 2:1-5", "Psalm 122", "Romans 13:11-14", "Matthew 24:36-44"], ["watchD", "So be careful not to forget the covenant that the Lord your God made with you, and not to make for yourselves an idol in the form of anything that the Lord your God has forbidden you. Deuteronomy 4:23"], ["docT", "Christ is the image of the invisible God, the firstborn of all creation. Colossians 1:15"], ["prayer", "Creator, you remind us through your Son that, though our eyes cannot see you, we can glimpse your image. Forgive us for the idols we make in our world, and help us be recreated in the image of our Savior. Amen."]], "332": [["dateVerse", "Monday, November 28", "Psalm 135:13-21", "1 Kings 19", "John 19:1–11"], ["watchD", "Upon your walls, O Jerusalem, I have posted sentinels; all day and all night they shall never be silent. Isaiah 62:6"], ["docT", "So we have the prophetic message more fully confirmed. You will do well to be attentive to this as to a lamp shining in a dark place, until the day dawns and the morning star rises in your hearts. 2 Peter 1:19"], ["prayer", "Your light seeks to break through the walls and darkness with which we surround ourselves, O Light divine. Help us to pay attention to the ways you beam your love into our hearts and lives. Amen."]], "333": [["dateVerse", "Tuesday, November 29", "Psalm 136", "1 Kings 20:1–21", "John 19:12–24"], ["watchD", "Even youths will faint and be weary, and the young will fall exhausted; but those who wait for the Lord shall renew their strength, they shall mount up with wings like eagles, they shall run and not be weary. Isaiah 40:30-31"], ["docT", "You then, my child, be strong in the grace that is in Christ Jesus. 2 Timothy 2:1"], ["prayer", "Great Strengthener, weariness can sometimes overwhelm us as we seek to continue in your name. Yet, when we are patient, through your Spirit and grace, you renew us and make us stronger. May we use this strength to continue in service. Amen."]], "334": [["dateVerse", "Wednesday, November 30", "Psalm 137", "1 Kings 20:22–21:16", "John 19:25–37"], ["watchD", "He gives power to the faint, and strengthens the powerless. Isaiah 40:29"], ["docT", "Jesus said, “I am the bread of life. Whoever comes to me will never be hungry, and whoever believes in me will never be thirsty.” John 6:35"], ["prayer", "Great Provider, you give strength in weakness, you feed us with life, and you refresh us with your love. Help us to use the provisions you give to continue your work in your world. Amen."]], "335": [["dateVerse", "Thursday, December 1", "Psalm 138:1-5", "1 Kings 21:17–22:28", "John 19:38–20:9"], ["watchD", "Jacob said, “Come, let us go up to Bethel, that I may make an altar there to the God who answered me in the day of my distress and has been with me wherever I have gone.” Genesis 35:3"], ["docT", "Give thanks to God the Father at all times and for everything. Ephesians 5:20"], ["prayer", "Heavenly Creator, we thank you for your faithfulness. You have blessed us richly in ways which are seen and unseen. Thank you for your presence in our lives, through your Holy Spirit. Amen."]], "336": [["dateVerse", "Friday, December 2", "Psalm 138:6-8", "1 Kings 22:29–53", "John 20:10–23"], ["watchD", "Moses said, “Would that all the Lord’s people were prophets, and that the Lord would put his spirit on them!” Numbers 11:29"], ["docT", "Do not quench the Spirit. Do not despise the words of prophets, but test everything; hold fast to what is good. 1 Thessalonians 5:19-21"], ["prayer", "Holy One, your love for us is unequaled. We ask that we may be strengthened through your presence. May we be steadfast, representing you in your world, always abounding in your grace. Amen."]], "337": [["dateVerse", "Saturday, December 3", "Psalm 139:1-6", "2 Kings 1:1–2:18", "John 20:24–31"], ["watchD", "From heaven the Lord looked at the earth, to hear the groans of the prisoners, to set free those who were doomed to die. Psalm 102:19-20"], ["docT", "So if the Son makes you free, you will be free indeed. John 8:36"], ["prayer", "Loving God, thank you for your gift of salvation. We humbly bow before you and acknowledge your gift of new life. Abide with us, gracious Lord. Amen."]], "338": [["info", "Second Sunday of Advent"], ["watchO", "Watchword for the week — Repent, for the kingdom of heaven has come near. Matthew 3:2"], ["dateVerse", "Sunday, December 4", "Isaiah 11:1-10", "Psalm 72", "Romans 15:4-13", "Matthew 3:1-12"], ["watchD", "As shepherds seek out their flocks when they are among their scattered sheep, so I will seek out my sheep. Ezekiel 34:12"], ["docT", "Jesus said, “I am the good shepherd. The good shepherd lays down his life for the sheep.” John 10:11"], ["prayer", "Great Shepherd, may your loving arms wrap around us in this time of reflection. You have led us to still waters in the midst of turmoil. We follow your leading, and rest in your green pastures. Amen."]], "339": [["dateVerse", "Monday, December 5", "Psalm 139:7-12", "2 Kings 2:19–3:27", "John 21:1–14"], ["watchD", "Teach me to do your will, for you are my God. Let your good spirit lead me on a level path. Psalm 143:10"], ["docT", "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. Galatians 5:22-23"], ["prayer", "Dear Lord, as we walk in your Spirit, bless us. As we endeavor to follow on your path, may your love be our love, your strength be our strength, and may we find hope in you. Amen."]], "340": [["dateVerse", "Tuesday, December 6", "Psalm 139:13-16", "2 Kings 4:1–37", "John 21:15–25"], ["watchD", "Violence shall no more be heard in your land, devastation or destruction within your borders; you shall call your walls Salvation, and your gates Praise. Isaiah 60:18"], ["docT", "In accordance with his promise, we wait for new heavens and a new earth, where righteousness is at home. 2 Peter 3:13"], ["prayer", "Lord, you created us in your image, an image of love and grace. We live in the hope of your salvation when all things will be made new. Amen."]], "341": [["dateVerse", "Wednesday, December 7", "Psalm 139:17-24", "2 Kings 4:38–5:14", "Acts 1:1–14"], ["watchD", "Woe to those who acquit the guilty for a bribe, but deny justice to the innocent. Isaiah 5:22,23 NIV"], ["docT", "Whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is pleasing, whatever is commendable, if there is any excellence and if there is anything worthy of praise, think about these things. Philippians 4:8"], ["prayer", "Lord, we sometimes struggle with our place in the world. At times, we haven’t done that which you would have us do. Forgive us, please, and guide us in what is true, honorable, just, pure, pleasing, and commendable. Amen."]], "342": [["dateVerse", "Thursday, December 8", "Psalm 140:1-5", "2 Kings 5:15–6:23", "Acts 1:15–26"], ["watchD", "All the Israelite men and women who were willing brought to the Lord freewill offerings. Exodus 35:29 NIV"], ["docT", "Like living stones, let yourselves be built into a spiritual house, to be a holy priesthood, to offer spiritual sacrifices acceptable to God through Jesus Christ. 1 Peter 2:5"], ["prayer", "Holy One, you have given us bounty beyond measure. May we show our gratitude for your generosity through our actions. May we be living examples of your grace and minister to your world. Amen."]], "343": [["dateVerse", "Friday, December 9", "Psalm 140:6-13", "2 Kings 6:24–7:20", "Acts 2:1–13"], ["watchD", "Surely he has borne our infirmities and carried our diseases; yet we accounted him stricken, struck down by God, and afflicted. Isaiah 53:4"], ["docT", "Consider him who endured such hostility against himself from sinners, so that you may not grow weary or lose heart. Hebrews 12:3"], ["prayer", "Holy Redeemer, you have not only called us into your presence, you have redeemed us and set us free. We thank you for the gracious gift of redemption and the promise of eternity. Amen."]], "344": [["dateVerse", "Saturday, December 10", "Psalm 141:1-4", "2 Kings 8", "Acts 2:14–28"], ["watchD", "For as the new heavens and the new earth, which I will make, shall remain before me, says the Lord, so shall your descendants and your name remain. Isaiah 66:22"], ["docT", "Many will come from east and west, and sit down with Abraham, Isaac, and Jacob in the kingdom of heaven. Matthew 8:11 NKJV"], ["prayer", "God of Abraham, Isaac, and Jacob, we praise you for your wonder. We wait for the time when we may join our spiritual ancestors in your presence and sit at your table. Bless us, we humbly pray. Amen."]], "345": [["info", "Third Sunday of Advent"], ["watchO", "Watchword for the week — Be strong, do not fear! Here is your God. Isaiah 35:4"], ["dateVerse", "Sunday, December 11", "Isaiah 35:1-10", "Psalm 146:5-10", "James 5:7-10", "Matthew 11:2-11"], ["watchD", "Human ways are under the eyes of the Lord. Proverbs 5:21"], ["docT", "Mary said, “Here am I, the servant of the Lord; let it be with me according to your word.” Luke 1:38"], ["prayer", "God of light, you blessed Mary, that she could bless the world. This Advent season, we celebrate the virgin birth of our Savior, who walked this earth to show us how to live. Continue to guide us, we pray. Amen."]], "346": [["dateVerse", "Monday, December 12", "Psalm 141:5-10", "2 Kings 9", "Acts 2:29–47"], ["watchD", "Let your face shine upon your servant; save me in your steadfast love. Psalm 31:16"], ["docT", "For once you were darkness, but now in the Lord you are light. Ephesians 5:8"], ["prayer", "Precious Lord, in times of joy and sorrow, you are with us. Your presence in our lives shows us the way we should go. Thank you for speaking to us in ways we can hear and see. Amen."]], "347": [["dateVerse", "Tuesday, December 13", "Psalm 142", "2 Kings 10", "Acts 3:1–10"], ["watchD", "Do not put the Lord your God to the test. Deuteronomy 6:16"], ["docT", "Do not be deceived; God is not mocked, for you reap whatever you sow. Galatians 6:7"], ["prayer", "Lord, it’s easy to test you, and turn from your path. Yet, in your love, you remain faithful. Help us sow the seeds of your love and grace rather than hate. May we be instruments of your will. Amen."]], "348": [["dateVerse", "Wednesday, December 14", "Psalm 143:1-6", "2 Kings 11", "Acts 3:11–26"], ["watchD", "Many nations shall join themselves to the Lord on that day, and shall be my people. Zechariah 2:11"], ["docT", "I looked, and there was a great multitude that no one could count, from every nation, from all tribes and peoples and languages, standing before the throne and before the Lamb. Revelation 7:9"], ["prayer", "Saving God, you long for us to join your celebrations. You’ve blessed us with the gift of salvation through Jesus. May we, when this life is through, join you with the saints above. Amen."]], "349": [["dateVerse", "Thursday, December 15", "Psalm 143:7-12", "2 Kings 12,13", "Acts 4:1–12"], ["watchD", "How very good and pleasant it is when kindred live together in unity! For there the Lord ordained his blessing, life for evermore. Psalm 133:1,3"], ["docT", "For as in one body we have many members, and not all the members have the same function, so we, who are many, are one body in Christ, and individually we are members one of another. Romans 12:4-5"], ["prayer", "Giver of gifts, we thank you for the presence of your Spirit within our lives. We thank you for the community of faith into which you called us. May we support and encourage one another in faith. Amen."]], "350": [["dateVerse", "Friday, December 16", "Psalm 144:1-4", "2 Kings 14", "Acts 4:13–22"], ["watchD", "O Lord, you have searched me and known me. You know when I sit down and when I rise up; you discern my thoughts from far away. Psalm 139:1-2"], ["docT", "In him we live and move and have our being. Acts 17:28"], ["prayer", "God of compassion, you carry us as we journey through this life. You even know our thoughts before we do. Forgive us for our bad thoughts, and guide us through our good ones. In Jesus’ name, Amen."]], "351": [["dateVerse", "Saturday, December 17", "Psalm 144:5-8", "2 Kings 15", "Acts 4:23–37"], ["watchD", "Bless our God, O peoples, let the sound of his praise be heard, who has kept us among the living, and has not let our feet slip. Psalm 66:8-9"], ["docT", "To him who is able to keep you from falling, and to make you stand without blemish in the presence of his glory with rejoicing, to the only God our Savior, through Jesus Christ our Lord, be glory, majesty, power, and authority, before all time and now and forever. Jude 24-25"], ["prayer", "Holy One, giver of life, we thank you for your blessings which we receive every day. We praise you as the living God. We rejoice in your presence, and praise your glorious name. In Jesus’ name, we pray. Amen."]], "352": [["info", "Fourth Sunday of Advent"], ["watchO", "Watchword for the week — Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["dateVerse", "Sunday, December 18", "Isaiah 7:10-16", "Psalm 80:1-7,10-14", "Romans 1:1-7", "Matthew 1:18-25"], ["watchD", "The Lord said to Moses, “Who gives speech to mortals? Is it not I, the Lord?” Exodus 4:11"], ["docT", "Paul wrote: My speech and my preaching were not with persuasive words of human wisdom, but in demonstration of the Spirit and of power. 1 Corinthians 2:4 NKJV"], ["prayer", "Creator God, you brought us into being through the speaking of your creative word. You redeemed us from our errors through the gift of your Son. You empower us through the presence of your Spirit. Thank you. Amen."]], "353": [["dateVerse", "Monday, December 19", "Psalm 144:9-15", "2 Kings 16:1–17:6", "Acts 5:1–11"], ["watchD", "You shall be called by a new name that the mouth of the Lord will give. Isaiah 62:2"], ["docT", "If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["prayer", "Lord, your unending love leads us to a new life. We unwrap each day as a gift from you. Only you know our future and we pray it will be well pleasing in your sight. In Jesus’ name, we pray. Amen."]], "354": [["dateVerse", "Tuesday, December 20", "Psalm 145:1-7", "2 Kings 17:7–41", "Acts 5:12–16"], ["watchD", "Noah found favor in the sight of the Lord. Genesis 6:8"], ["docT", "When the Son of Man comes, will he find faith on earth? Luke 18:8"], ["prayer", "Sustaining God, we humbly come before you in preparation for your greatest gift. As we celebrate the birth of a baby, may our faith recognize him as your son. Through faith, may we welcome you into our world. Amen."]], "355": [["dateVerse", "Wednesday, December 21", "Psalm 145:8-16", "2 Kings 18", "Acts 5:17–40"], ["watchD", "I sought the Lord, and he answered me, and delivered me from all my fears. Psalm 34:4"], ["docT", "The angel said to him, “Do not be afraid, Zechariah, for your prayer has been heard.” Luke 1:13"], ["prayer", "Gracious One, may your angels calm our fears. May the trust we place in your presence in our life be the foundation upon which we stand. Hear our prayer, gracious Lord. Amen."]], "356": [["dateVerse", "Thursday, December 22", "Psalm 145:17-21", "2 Kings 19:1–28", "Acts 5:41–6:7"], ["watchD", "You who seek God, your hearts shall live. Psalm 69:32 NKJV"], ["docT", "Mary entered the house of Zechariah and greeted Elizabeth. When Elizabeth heard Mary’s greeting, the child leaped in her womb. And Elizabeth was filled with the Holy Spirit. Luke 1:40-41"], ["prayer", "Holy Spirit, gracious guest, you filled Elizabeth’s heart when she heard Mary’s greeting. We ask that you fill our hearts as we remember the birth of a baby boy—your son, our Lord—in whose name we pray. Amen."]], "357": [["dateVerse", "Friday, December 23", "Psalm 146", "2 Kings 19:29–20:21", "Acts 6:8–7:3"], ["watchD", "Be exalted, O Lord, in your strength! We will sing and praise your power. Psalm 21:13"], ["docT", "The mystery of our religion is great: He was revealed in flesh, vindicated in spirit, seen by angels, proclaimed among Gentiles, believed in throughout the world, taken up in glory. 1 Timothy 3:16"], ["prayer", "Holy Savior, the extent of your love is beyond mortal comprehension. It is only through your Spirit that we truly see how your life’s story has brought us peace and life-everlasting. Thank you for this wondrous gift. Amen."]], "358": [["dateVerse", "Saturday, December 24", "Psalm 147:1-6", "2 Kings 21:1–22:10", "Acts 7:4–16"], ["watchD", "He shall command peace to the nations. Zechariah 9:10"], ["docT", "Glory to God in the highest heaven, and on earth peace among those whom he favors! Luke 2:14"], ["prayer", "Holy Lord, as we gather this night to remember the story of your coming, bless our world, we pray. May your Spirit renew a right spirit within us, and may we become your light to the world. Amen."]], "359": [["info", "Nativity of the Lord (Christmas)"], ["watchO", "Watchword for Christmas Day — The law was given through Moses; grace and truth came through Jesus Christ. John 1:17"], ["dateVerse", "Sunday, December 25", "Isaiah 52:7-10", "Psalm 98", "Hebrews 1:1-4,(5-12)", "John 1:1-14"], ["watchD", "Put away the foreign gods that are among you, and incline your hearts to the Lord. Joshua 24:23"], ["docT", "No one has ever seen God. It is God the only Son, who is close to the Father’s heart, who has made him known. John 1:18"], ["prayer", "O Child Divine, you have brought light into the world and into our lives. You have blessed us beyond measure and brought joy into our lives. On this blessed day, we praise you and glorify your name in love. Amen."]], "360": [["dateVerse", "Monday, December 26", "Psalm 147:7-14", "2 Kings 22:11–23:20", "Acts 7:17–29"], ["watchD", "They went to their tents, joyful and in good spirits because of all the goodness that the Lord had shown to his servant David and to his people Israel. 1 Kings 8:66"], ["docT", "The shepherds went with haste and found Mary and Joseph, and the child lying in the manger. When they saw this, they made known what had been told them about this child. Luke 2:16-17"], ["prayer", "O holy Child of Bethlehem, you came to bring life abundant and a life in peace: not peace as the world knows, but inward peace with our soul. Thank you for your act of reconciliation within ourselves. Amen."]], "361": [["dateVerse", "Tuesday, December 27", "Psalm 147:15-20", "2 Kings 23:21–24:20", "Acts 7:30–43"], ["watchD", "Just as I have watched over them to pluck up and break down, so I will watch over them to build and to plant, says the Lord. Jeremiah 31:28"], ["docT", "Be patient, therefore, beloved, until the coming of the Lord. The farmer waits for the precious crop from the earth, being patient with it until it receives the early and the late rains. James 5:7"], ["prayer", "Gracious Lord, hear our prayer for trust and patience. Help us to trust the promise of your presence, and to patiently wait for your guidance. Forgive us when our impatience takes over, and renew our faith in your guidance. Amen."]], "362": [["dateVerse", "Wednesday, December 28", "Psalm 148:1-6", "2 Kings 25", "Acts 7:44–60"], ["watchD", "Why are you cast down, O my soul, and why are you disquieted within me? Hope in God; for I shall again praise him, my help and my God. Psalm 42:11"], ["docT", "Since, then, we have such a hope, we act with great boldness. 2 Corinthians 3:12"], ["prayer", "God of hope, when our spirits fall and our hope is challenged, remain with us. Send your uplifting Spirit to lift us to a new awareness of your love and grace in all matters. Be with us, we pray. Amen."]], "363": [["dateVerse", "Thursday, December 29", "Psalm 148:7-14", "1 Chronicles 1:1–37", "Acts 8:1–8"], ["watchD", "Does God speak and then not act? Does he promise and not fulfill? Numbers 23:19 NIV"], ["docT", "Jesus Christ was not “Yes and No”; but in him it is always “Yes.” 2 Corinthians 1:19"], ["prayer", "Jesus, you not only stand with us, you stand under us, holding us up. Our trust, O Lord, is in you and you alone. May we walk in that strength and witness to your love. Amen."]], "364": [["dateVerse", "Friday, December 30", "Psalm 149", "1 Chronicles 1:38–2:17", "Acts 8:9–25"], ["watchD", "Six days you shall labor and do all your work. But the seventh day is a Sabbath to the Lord your God; you shall not do any work. Exodus 20:9-10"], ["docT", "The sabbath was made for humankind. Mark 2:27"], ["prayer", "Jesus, you knew when to separate and rest. You knew when to refresh your mind and body, so you could better fulfill your ministry. Refreshing Savior, lead us into times of rest, so we, too, might fulfill our ministry. Amen."]], "365": [["dateVerse", "Saturday, December 31", "Psalm 150", "1 Chronicles 2:18–55", "Acts 8:26–40"], ["watchD", "Thus said the Lord, “I will encamp at my house as a guard.” Zechariah 9:8"], ["docT", "If God is for us, who is against us? He who did not withhold his own Son, but gave him up for all of us, will he not with him also give us everything else? Romans 8:31-32"], ["prayer", "Lord, your promises are sure. You guide us and guard us, protect us and save us, but best of all, you love us into eternity. As this year ends, walk with us into a new beginning, dear Lord. Amen."]]}